{
   "chapters" : [
      {
         "entries" : [
            {
               "link" : "",
               "tags" : [
                  "Pod::Weaver"
               ],
               "text" : "It is Yanick Champoux story time again. This is such a great counter example of the other blog post, I read today. That rant about the lack of documentation. This is a solution. I love the way Yanick writes. I wish, I would understand more of it. No! I wish I could write like that.",
               "title" : "Taming Pod::Weaver",
               "ts" : "2011.10.08",
               "url" : "http://babyl.ca/techblog/entry/taming-pod-weaver"
            },
            {
               "link" : "",
               "tags" : [],
               "text" : "The Perl Weekly readers probably don't need any convincing as to why use Perl but this article by John Napiorkowski can be a good tool when you talk to others about the language.",
               "title" : "Why Perl?",
               "ts" : "2011.10.07",
               "url" : "http://jjnapiorkowski.typepad.com/modern-perl/2011/10/why-perl.html"
            },
            {
               "link" : "",
               "tags" : [
                  "perlbrew",
                  "corelist"
               ],
               "text" : "Tyler Slijboom asks: Will this script run under the Perl version available to the customer? and then uses the above two tools to give an answer.",
               "title" : "Corelist and Perlbrew - 2 Perl command line tools for remote Perl work",
               "ts" : "2011.10.07",
               "url" : "http://blogs.perl.org/users/tyler_slijboom/2011/10/corelist-and-perlbrew---2-perl-command-line-tools-for-remote-perl-work.html"
            },
            {
               "link" : "",
               "tags" : [
                  "taint",
                  "Module::Load",
                  "security"
               ],
               "text" : "For improved security of your Perl application David Golden (dagolden) suggest the use of the (IMHO) mostly neglected taint mode of Perl.",
               "title" : "Yet another taint mode reminder",
               "ts" : "2011.10.04",
               "url" : "http://www.dagolden.com/index.php/1560/yet-another-taint-mode-reminder-to-use-taint-mode-if-you-care-about-security/"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "link" : "",
               "tags" : [
                  "Test::DBIx::Class"
               ],
               "text" : "Wolfgang Kinkeldei too 'complains' about documentation (this is the 3rd I read tonight) but he actually complains that there is too much of it ... so he provides a simple example on how to use the Test::DBIx::Class module.",
               "title" : "Test::DBIx::Class",
               "ts" : "2011.10.06",
               "url" : "http://blogs.perl.org/users/wolfgang_kinkeldei/2011/10/testdbixclass.html"
            }
         ],
         "title" : "Testing"
      },
      {
         "entries" : [
            {
               "link" : "",
               "tags" : [
                  "Tie::CHI"
               ],
               "text" : "Caching a hash. Jonathan Swartz, the author of Mason and CHI shows how 'tie' can provide a very simple interface to a cache.",
               "title" : "The inevitable Tie::CHI",
               "ts" : "2011.10.07",
               "url" : "http://www.openswartz.com/2011/10/07/the-inevitable-tiechi/"
            },
            {
               "link" : "",
               "tags" : [
                  "Dancer",
                  "Template::Plugin::Pagination",
                  "pagination"
               ],
               "text" : "Mohammad S Anwar is new on blogs.perl.org and this is his second very useful blog. This time he takes us through the way he used Template::Plugin::Pagination to divide up a result set to several pages of results.",
               "title" : "Pagination has become kids play with Dancer ...",
               "ts" : "2011.10.06",
               "url" : "http://blogs.perl.org/users/mohammad_s_anwar/2011/10/pagination-has-become-kids-play-with-dancer.html"
            },
            {
               "link" : "",
               "tags" : [
                  "JSON",
                  "vim",
                  "ElasticSearch"
               ],
               "text" : "It is a bit unclear to me why did Ovid give this title while it seems the interesting part of his blog entry was the Perl script that highlights the character where a json file has a syntax error. The funny thing is that the Perl Weekly is based on a JSON file and I am writing it in Padre. So I already wanted to write a plugin to do syntax checking of JSON files. Now I can just take what Ovid wrote.",
               "title" : "Querying ElasticSearch from VIM",
               "ts" : "2011.10.07",
               "url" : "http://blogs.perl.org/users/ovid/2011/10/querying-elasticsearch-from-vim.html"
            }
         ],
         "title" : "Code"
      }
   ],
   "date" : "2011-10-10",
   "editor" : "gabor_szabo",
   "header" : [
      "Hi there!",
      "The London Perl Workshop will take place on 12th November. There are going to be a few training classes. Among them, I am giving a 4 hours long Perl Testing class. It would be nice to see you there.",
      "I read a blog post, (I won't link to it) about the the lack of documentation of some CPAN modules and how it is the 'job' of the CPAN authors to write that too. I would like to see more and better documentation, but this rant was totally useless. If you find a module lacking documentation and you are already reading the source code to understand how to use it, please, spend an hour or two writing some PODs and sending to the author. Or just publish them as a blog entry. This will make our whole ecosystem better.",
      "But let's see the posts:"
   ],
   "subject" : "Why Perl?"
}
