{
   "date" : "2012-02-20",
   "subject" : "Programming Perl, 4th Edition eBook is available at half price",
   "header" : [
     "Welcome to the new readers!",
     "Last week, Jeff Bisbee invited the members of the <a href=http://linkd.in/zoU7sO>Perl Mongers group on LinkedIN</a> to sign up to this newsletter. This resulted in more than 100 new sign-ups. Those of you, who are not part of that group yet, let me recommend you to join it. One day it will help you finding a new job or finding employees.",
     "This issue is also full of posts related to brian d foy. Lots of good things came together.",
     "See the posts:"
   ],
   "chapters" : [
      {
         "title" : "Headlines",
         "entries" : [
            {
               "title" : "Programming Perl, 4th Edition eBook is available at half price",
               "text" : "This is a heavy book. Even the PDF is 21 Mb and took a few minutes to download. I consider this to be the ultimate source of Perl. It is not a book to learn the basics from, but it is a must read for everyone who wants to be serious about Perl. I read the 3rd edition and I am looking forward to read this new edition. I'll probably buy the printed version as well, but till then I am going to read the PDF.",
               "url" : "http://shop.oreilly.com/product/9780596004927.do",
               "link" : "http://oreil.ly/wbRBRH",
               "ts" : "2012.02.19",
               "tags" : []
            },
            {
               "title" : "Learning Perl Student Book, 2nd Edition is out",
               "text" : "This is a collection of 125 exercises covering every chapter of the Learning Perl book. It includes exercises for smart matching and database access. I think if you want to learn Perl you should pay the little price and do all the exercises. I bought it and I plan to learn from this how to create some interesting exercises for my students. As I think about this, I might even give them a copy of this. I just need to work this out with brian and O'Reilly.",
               "url" : "http://www.learning-perl.com/?p=268",
               "link" : "http://bit.ly/yyX5Ev",
               "ts" : "2012.02.01",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "YAPC::EU::2012 Call for Papers",
               "text" : "Finally the CFP is here. They will use a sliding acceptance of talks, a bit similar to what's happening at YAPC::NA already. So the earlier you propose the talk the higher your chances are. This changes the whole meaning of procrastination and the dead-line.",
               "url" : "http://mdk.per.ly/2012/02/14/yapceu2012-call-for-papers/",
               "link" : "http://bit.ly/ySckbN",
               "ts" : "2012.02.14",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "Install your own Perl with your own CPAN ",
               "text" : "Gianluca Casati has an environment where only some of the computers have direct Internet access. He describes the steps how to build perl and use mini-CPAN on the connected machine to build the environment that can later be moved to the other machines as well.",
               "url" : "http://perl-node-interface.blogspot.com/2012/02/install-your-own-perl-with-your-own.html",
               "link" : "http://bit.ly/ylALSH",
               "ts" : "2012.02.28",
               "tags" : []
            },
            {
               "title" : "Use __SUB__ to get a reference to the current subroutine",
               "text" : "What do you do if you create a subroutine during run-time and you would like to call it recursively? There are two solutions using CPAN modules but in perl 5.16 you'll be able to do it with parts of perl itself. I guess this is one of those things that you need very rarely but then it is very useful to have.",
               "url" : "http://www.effectiveperlprogramming.com/blog/1503",
               "link" : "http://bit.ly/xMVGdC",
               "ts" : "2012.02.19",
               "tags" : []
            },
            {
               "title" : "Improving Perl 5: Grant Report for Month 5",
               "text" : "Frankly, the code in there is just too much for me, but the text is very readable and interesting. It shows how Nicholas Clark deals with cleaning up some deep bugs in perl and reveals a bit about the way the Perl 5 Porters work.",
               "url" : "http://news.perlfoundation.org/2012/02/improving-perl-5-grant-report-2.html",
               "link" : "http://bit.ly/xT3HCQ",
               "ts" : "2012.02.17",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Discussion",
         "entries" : [
            {
               "title" : "The Perl Learning Environment",
               "text" : "brian d foy is thinking on some new tools to teach Perl to beginners and he is asking your opinion. Having a Virtual-Box image of Linux already filled with all the necessary tools is a good idea, I have been doing that with my test automation classes. I hope, for people who prefer Windows he will pick DWIM Perl for Windows and Padre. They were built with the idea that they can be a smoother entry for people in the Windows world.",
               "url" : "http://blogs.perl.org/users/brian_d_foy/2012/02/the-perl-learning-environment.html",
               "link" : "http://bit.ly/x3sfk3",
               "ts" : "2012.02.18",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Fun",
         "entries" : [
            {
               "title" : "Got 20 minutes? WWW::xkcd is born!",
               "text" : "xkcd is one of the greatest geek comic. Ever. It now has a module on CPAN. Actually, as Sawyer writes 'I searched CPAN and saw only a few xkcd modules'. Let me emphasize that: He saw only a *few*, and then went on writing another one... I think that attitude has been analyzed already by xkcd. And for all the people who might misunderstand me: I applaud Sawyer and the creation of WWW::xkcd.",
               "url" : "http://blogs.perl.org/users/sawyer_x/2012/02/got-20-minutes-wwwxkcd-is-born.html",
               "link" : "http://bit.ly/A5lq0c",
               "ts" : "2012.02.14",
               "tags" : []
            },
            {
               "title" : "Your Perl-driven cyborgs can soon recognize objects",
               "text" : "Max Maischein (Corion) is trying to make sure we are going to be able to  track objects as they move around in movies.",
               "url" : "http://blogs.perl.org/users/max_maischein/2012/02/your-perl-driven-cyborgs-can-soon-recognize-objects.html",
               "link" : "http://bit.ly/zEWNR9",
               "ts" : "2012.02.13",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Code",
         "entries" : [
            {
               "title" : "Found this Perl script on a defaced web-server",
               "text" : "Everyone has to start somewhere. Sure, putting your first perl script on CPAN wouldn't be a good idea but using it to attack a server... And that person somehow got on the server so maybe the Perl code isn't perfectly engineered (to say the least) but it worked :)",
               "url" : "http://showmetheco.de/articles/2012/2/found-this-perl-script-on-a-defaced-webserver.html",
               "link" : "http://bit.ly/x8cYjA",
               "ts" : "2012.02.17",
               "tags" : []
            },
            {
               "title" : "Hilight growls from irssi with Plack and ssh",
               "text" : "Apparently David Golden has a similar setup to mine for IRC. Using an ssh connection to a remote server, where he runs irssi. The problem that we don't get pop-up notification when someone is talking to us. Or I'd say we did not get. Following the instructions of @dagolden one can set up a pop-up alert... Actually, in one of the comments he pointed to another solution by RGS that was even simpler to setup. So now I have notifications! Shall I be happy not? Shall I say goodbye to the little productivity I had earlier?",
               "url" : "http://www.dagolden.com/index.php/1643/hilight-growls-from-irssi-with-plack-and-ssh/",
               "link" : "http://bit.ly/yggCMk",
               "ts" : "2012.02.16",
               "tags" : []
            }
          ]
      },
      {
         "title" : "Slides",
         "entries" : [
            {
               "title" : "PerlTalks: Parallele::ForkManager (cases of usage)",
               "text" : "There are a number of ways to run several tasks at the same time. Parallel::ForkManager provides a simple way to do that. Geistteufel (aka celogeek) created some very clear slides on how to use the module in simple cases and cases when you need database access in all the child processes. The 3D slides are also very nice.",
               "url" : "http://qa.celogeek.com/programming/perl/talks/slides/parallel-forkmanager",
               "link" : "http://bit.ly/xX3BWS",
               "ts" : "2012.02.19",
               "tags" : ["Parallel::ForkManager"]
            }
          ]
      },
      {
         "title" : "Perl 6",
         "entries" : [
            {
               "title" : "Results from the Prisoner's Dilemma Challenge",
               "text" : "There were a number of submissions which got a few interesting names such as 'Turn the Other Cheek', 'Inevitable Betrayal' and 'Me'. The length of the solutions also had great variation from 15 lines down to 3 lines of 'Me' written by Audrey Tang. 'Crazy' is an understatement.",
               "url" : "http://perlgeek.de/blog-en/perl-6/prisoners-dilemma-results.html",
               "link" : "http://bit.ly/wiQULb",
               "ts" : "2012.02.18",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Other",
         "entries" : [
            {
               "title" : "Resource on debugging, profiling and benchmarking in Perl",
               "text" : "Pradeep Pant links to a couple of old, but still useful articles on speeding up your perl code. Look, he also has a banner of the Perl Weekly! Thanks for that!",
               "url" : "http://pradeeppant.com/2012/02/18/resource-on-debugging-profiling-and-benchmarking-in-perl/",
               "link" : "http://bit.ly/AqZlog",
               "ts" : "2012.02.18",
               "tags" : []
            },
            {
               "title" : "'cuz multiple steps into one is cool :)",
               "text" : "Dominic Humphries takes vim and git, glues them together with Perl so he can easily find out who to blame a piece of code on. But why blame? You should praise them!",
               "url" : "http://geekblog.oneandoneis2.org/index.php/2012/02/15/cuz-multiple-steps-into-one-is-cool",
               "link" : "http://bit.ly/xw6E7e",
               "ts" : "2012.02.15",
               "tags" : []
            },
            {
               "title" : "Estimating like an Adult - What to Steal from Agile...",
               "text" : "This is the 2nd part of Peter Sergeant's article on trying to handle the developer-product manager relationship through better time estimates. He argues for using Story Points instead of time units and Velocity to balance the difference between developers. I personally don't have much use for this as I mostly write for myself but I think others could benefit from this approach. I certainly would like to read abut the experience of others.",
               "url" : "http://www.writemoretests.com/2012/02/estimating-like-an-adult-what-to-steal-from-agile.html",
               "link" : "http://bit.ly/zYUIZ4",
               "ts" : "2012.02.16",
               "tags" : []
            },
            {
               "title" : "The rise and fall of personal computing",
               "text" : "According to this graph PCs might have reached their peak 'units shipped per year' but more telling is the relation between the number of PC+Mac vs Android+iPhone+iPad. The important for Perl programmers is, that Perl has no real presence on the handheld devices. Only in the back-end, serving those devices.",
               "url" : "http://www.asymco.com/2012/01/17/the-rise-and-fall-of-personal-computing/",
               "link" : "http://bit.ly/wFpdt9",
               "ts" : "2012.01.17",
               "tags" : []
            }
          ]
      },
      {
         "title" : "The self promotion section",
         "entries" : [
            {
               "title" : "Matching numbers using Perl regex",
               "text" : "I took a regex related question I saw on PDX.pm and described how I'd build the regex step-by-step. The string isn't too complex: 'Usage:524944/1000000 messages' but I hope this approach can help people learn how they can go about building a regular expression.",
               "url" : "http://szabgab.com/matching-numbers-using-perl-regex.html",
               "link" : "http://bit.ly/zH9IRS",
               "ts" : "2012.02.16",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Events",
         "entries" : [
            {
               "title" : "Perl Workshop in Israel",
               "text" : "February 28, 2012, Ramat Gan, Israel",
               "url" : "http://act.perl.org.il/ilpw2012/",
               "link" : "http://bit.ly/v3MPzl",
               "ts" : "2012.02.28",
               "tags" : ["Ramat Gan", "Tel Aviv", "Israel", "Workshop", "events"]
             },
             {
               "title" : "German Perl workshop",
               "text" : "March 5-7, 2012, Erlangen, Germany",
               "url" : "http://conferences.yapceurope.org/gpw2012/",
               "link" : "http://bit.ly/uAkkog",
               "ts" : "2012.03.05",
               "tags" : ["Germany", "Europe", "workshops", "events"]
             },
             {
               "title" : "DC-Baltimore Perl workshop",
               "text" : "April 14, 2012, Catonsville, MD, USA",
               "url" : "http://dcbpw.org/",
               "link" : "http://bit.ly/uPPep6",
               "ts" : "2012.04.14",
               "tags" : ["Baltimore", "USA", "workshops", "events"]
             },
             {
               "title" : "Dutch Perl Workshop",
               "text" : "April 14, 2012, The Hague, The Netherlands",
               "url" : "http://www.perlworkshop.nl/nlpw2012/",
               "link" : "http://bit.ly/xGvt2Q",
               "ts" : "2012.04.14",
               "tags" : ["The Hague", "The Netherlands", "workshops", "events"]
             }
         ]
      }
   ]
}
