{
   "chapters" : [
      {
         "entries" : [
            {
               "tags" : [
                  "Slashdot"
               ],
               "text" : "This is not strictly a Perl news but Slashdot was such an important part of the Perl world that I think it is worth mentioning. Here I link to the article in the Wired magazine.",
               "title" : "Slashdot editor resigns",
               "ts" : "2011.08.25",
               "url" : "http://www.wired.com/beyond_the_beyond/2011/08/dead-media-beat-slashdot-editor-resigns/"
            },
            {
               "tags" : [
                  "Dancer",
                  "web",
                  "release"
               ],
               "text" : "David Precious  (Bigpresh) reports that the new version of Dancer was named after him. Some minor developments and lots of documentation updates. BTW I did not know Dancer does recursion.",
               "title" : "Dancer 1.3080 released",
               "ts" : "2011.08.23",
               "url" : "http://www.preshweb.co.uk/2011/08/dancer-1-3080-released/"
            },
            {
               "tags" : [
                  "vSphere",
                  "SDK",
                  "vmware",
                  "cloud"
               ],
               "text" : "",
               "title" : "vSphere SDK for Perl 5.0 Release Notes",
               "ts" : "2011.08.24",
               "url" : "http://www.vmware.com/support/developer/viperltoolkit/viperl50/vsp50_vsperl_relnotes.html"
            }
         ],
         "title" : "Headlines"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "Linux",
                  "Windows",
                  "OSX",
                  "distribution",
                  "Citrus Perl"
               ],
               "text" : "Mark Dootson writes about his creature that can make it easy to package and distribute Perl application to Linux, Windows and Mac OSX.",
               "title" : "Create your own binary Perl distribution using Citrus Perl",
               "ts" : "2011.08.22",
               "url" : "http://binaryperl.blogspot.com/2011/08/citrus-perl-create-your-own-binary.html"
            },
            {
               "tags" : [
                  "Padre",
                  "IDE",
                  "threads"
               ],
               "text" : "Adam Kennedy (Alias) describes the current status of Padre, the Perl IDE regarding the upcoming 1.0 version. In short: The current version 0.90 is quite stable. 0.92 will be likely broken as the background API is being replaced.",
               "title" : "Padre::Task 3.0 - Smaller and safer with full service support",
               "ts" : "2011.08.23",
               "url" : "http://blogs.perl.org/users/adam_kennedy/2011/08/padretask-30---smaller-and-safer-with-full-service-support.html"
            },
            {
               "tags" : [
                  "monkey-patching",
                  "subclassing"
               ],
               "text" : "Aaron Crane describes some often used but dangerous programming techniques common to all programming languages and then shows how you can avoid the problems in Perl. Follow the link to 'paper' to reach the really interesting part.",
               "title" : "Monkey-patching, subclassing, and accidental overriding",
               "ts" : "2011.08.26",
               "url" : "http://blogs.perl.org/users/aaron_crane/2011/08/monkey-patching-subclassing-and-accidental-overriding.html"
            },
            {
               "tags" : [
                  "MetaCPAN",
                  "PAUSE"
               ],
               "text" : "Viacheslav Tykhanovskyi (vti) took the idea to mashup data from MetaCPAN into another direction. He created automatically generated resumes for each CPAN author.",
               "title" : "Perl Résumé",
               "ts" : "2011.08.24",
               "url" : "http://showmetheco.de/articles/2011/8/perl-resume.html"
            },
            {
               "tags" : [
                  "Stackato",
                  "ActiveState",
                  "cloud",
                  "Rubric"
               ],
               "text" : "Ricardo Signes (RJBS) describes his experience with Stackato the cloud system of ActiveState. He shows how he deployed Rubric, a web application he wrote 7 years ago. If I understand it correctly, he is using Rubric for his blog.",
               "title" : "First impressions of ActiveState Stackato",
               "ts" : "2011.08.25",
               "url" : "http://rjbs.manxome.org/rubric/entry/1909"
            },
            {
               "tags" : [
                  "JSON",
                  "utf8",
                  "Unicode"
               ],
               "text" : "Flavio Poletti goes into a detailed description on how strings are handled within Perl regarding bytes and characters and how you should handle them. Then he explains how to use the JSON module to avoid issues with Unicode.",
               "title" : "Quick note on character encoding and using the JSON module",
               "ts" : "2011.08.28",
               "url" : "http://blogs.perl.org/users/polettix/2011/08/quick-note-on-using-module-json.html"
            },
            {
               "tags" : [
                  "Learning Perl"
               ],
               "text" : "Nikos Vaggalis writes about the new edition of the Learning Perl book and offers a few reasons why people should learn Perl. None of this is new to people already using Perl but I found it important to mention as this was published on a generic web site for programmers.",
               "title" : "In Praise of Perl and the Llama ",
               "ts" : "2011.08.10",
               "url" : "http://www.i-programmer.info/professional-programmer/i-programmer/2864-in-praise-of-perl-and-the-llama.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "YAPC",
                  "conference",
                  "workshop",
                  "event",
                  "code of conduct"
               ],
               "text" : "The discussion around code of conduct for conferences has surfaced on several Perl related web sites recently. In this article, Dave Rolsky goes into more depth about the topic. As this is relevant to all YAPCs and Perl Workshops, if you are planning to attend or organize such event it might be better to voice your opinion now than to complain later.",
               "title" : "Conference Code of Conduct Considerations",
               "ts" : "2011.08.22",
               "url" : "http://blog.urth.org/2011/08/conference-code-of-conduct-considerations.html"
            }
         ],
         "title" : "Discussions"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "Carp::Always",
                  "Devel::SimpleTrace"
               ],
               "text" : "Randy J. Ray shows us how to get stack trace from warnings and exceptions in code we might not control or that we might not want to change. Excellent tool for code maintenance.",
               "title" : "Perl Module Monday: Carp::Always",
               "ts" : "2011.08.22",
               "url" : "http://www.dereferenced.com/2011/08/22/perl-module-monday-carpalways/"
            },
            {
               "tags" : [
                  "Template::Declare",
                  "Dancer::Template::TemplateDeclare"
               ],
               "text" : "Reading the entries of Yanick Champoux (yanick) is always a challenge and it is always fun. This time he introduces the new Dancer template based on Template::Declare and shows and example how to define templates in their own files.",
               "title" : "A Wee Bit of Fun with Template::Declare",
               "ts" : "2011.08.22",
               "url" : "http://babyl.dyndns.org/techblog/entry/fun-with-template-declare"
            },
            {
               "tags" : [
                  "Net::SFTP::Foreign",
                  "autodie",
                  "exceptions"
               ],
               "text" : "Mark Gardner tells the story of how he wrote a wrapper for Net::SFTP::Foreign to throw hard exceptions instead of returning soft errors. How that prompted the inclusion of this feature in the original module and how did he go on to deprecate the now unnecessary wrapper. I love the idea of having less, but more powerful modules on CPAN.",
               "title" : "The life and death (well, deprecation) of a wrapper module",
               "ts" : "2011.08.23",
               "url" : "http://blogs.perl.org/users/mark_gardner/2011/08/the-life-and-death-well-deprecation-of-a-wrapper-module.html"
            },
            {
               "tags" : [
                  "AnyEvent",
                  "Node.js"
               ],
               "text" : "Rebecca has been writing Perl for 10 years and she is now reconnecting with the Perl community. In her first post she is introducing her new module called On::Event that supposed to have an API similar to that of Node.js",
               "title" : "$world->on( create => sub { say 'Hello' } )",
               "ts" : "2011.08.24",
               "url" : "http://blogs.perl.org/users/rebecca/2011/08/world-on-create-sub-say-hello.html"
            },
            {
               "tags" : [
                  "AnyEvent",
                  "IO::Async"
               ],
               "text" : "Another AnyEvent related article. In this one Paul Evans (LeoNerd) writes about adding the AnyEvent loop to IO::Async.",
               "title" : "IO::Async and AnyEvent ",
               "ts" : "2011.08.27",
               "url" : "http://leonerds-code.blogspot.com/2011/08/ioasync-and-anyevent.html"
            },
            {
               "tags" : [
                  "Datetime"
               ],
               "text" : "A simple example using the Datetime module written by Ovid.",
               "title" : "Determining my daughter's age",
               "ts" : "2011.08.27",
               "url" : "http://blogs.perl.org/users/ovid/2011/08/determining-my-daughters-age.html"
            },
            {
               "tags" : [
                  "Plack"
               ],
               "text" : "In a very small example chromatic shows the power of Plack to put together a little applications serving files.",
               "title" : "Serving a Local Directory with Plack",
               "ts" : "2011.08.24",
               "url" : "http://www.modernperlbooks.com/mt/2011/08/serving-a-local-directory-with-plack.html"
            },
            {
               "tags" : [
                  "dispatch table",
                  "OOP"
               ],
               "text" : "fREW Schmidt gives a nice and simple example on how to use simple dispatch tables. Then he goes on and shows how the same idea can be applied to methods of classes.",
               "title" : "Refactoring Dispatch Tables into Objects",
               "ts" : "2011.08.24",
               "url" : "http://blog.afoolishmanifesto.com/archives/1648"
            },
            {
               "tags" : [
                  "Mojolicious",
                  "HTML5",
                  "web"
               ],
               "text" : "Sebastian Riedel (kraih) provides a short example on how to use HTML5 EventSource, which is - as he writes - 'a dead simple technology'. My first reaction was, yeah, when he writes that I know I am going to get lost. But then it turned out it is not that hard after all. Unfortunately it is not yet supported in IE.",
               "title" : "Mojolicious hack of the day: HTML5 EventSource",
               "ts" : "2011.08.26",
               "url" : "http://blog.kraih.com/mojolicious-hack-of-the-day-html5-eventsource"
            }
         ],
         "title" : "Code"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "Perl 6",
                  "LWP::Simple"
               ],
               "text" : "Cosimo Streppone reports how the Perl 6 version of LWP::Simple is now using THE standard grammar of URIs and IPv6 addresses.",
               "title" : "Perl6 LWP::Simple now uses the URI module for added awesome",
               "ts" : "2011.08.24",
               "url" : "http://my.opera.com/cstrep/blog/2011/08/24/perl6-lwp-simple-now-uses-the-uri-module-for-added-awesome"
            }
         ],
         "title" : "Perl 6"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "culture"
               ],
               "text" : "If you ever wanted to express your gratitude to an open source developer, Ricardo Signes (RJBS) describes a simple and very nice way to do that. You got a nice present in the form of a CPAN module? Now you can return the favor even if your employer does not let you release open source code.",
               "title" : "promoting little gifts ",
               "ts" : "2011.08.23",
               "url" : "http://rjbs.manxome.org/rubric/entry/1906"
            }
         ],
         "title" : "People"
      },
      {
         "entries" : [
            {
               "tags" : [
                  "London",
                  "Workshop",
                  "CFP",
                  "events"
               ],
               "text" : "In the previous issue I managed to include the wrong date. This is now fixed. I hope.",
               "title" : "London Perl Workshop (LPW2011): Dates and Call for Speakers 12th November 2011",
               "ts" : "2011.07.29",
               "url" : "http://perlnews.org/2011/07/lpw2011-call-for-speakers/"
            },
            {
               "tags" : [
                  "FrOSCon",
                  "German",
                  "event"
               ],
               "text" : "After arriving home from YAPC Renee Baecker went on to attend FrOSCon. If you don't know German you can use the automatic translation service of Google. Just remember, the word order in German is quite different from that in English which makes some really funny sentences.",
               "title" : "FrOSCon 2011 report (in German)",
               "ts" : "2011.08.22",
               "url" : "http://reneeb-perlblog.blogspot.com/2011/08/froscon-2011.html"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2011-08-29",
   "editor" : "gabor_szabo",
   "header" : [
      "In the last week a few people raised the issue that the newsletter came in HTML format and they would prefer simple text. So starting from this issue the newsletter will include both and HTML and a plain text version of the content. If you encounter any problem, please let me know ASAP.",
      "Richard Dice pointed out that in the previous issue I had the date of the London Perl Workshop wrong. Please take note, it is on 12th November 2011. Thank you, Richard!",
      "Do you like the Perl Weekly? If so, you could help others to find out about it by Tweeting a link to its web site and telling people why do you recommend it!"
   ],
   "subject" : "Dancer 1.3080 released - Perl Résumé announced"
}
