{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "stuart_mackintosh",
               "text" : "Thanks to Nic Evans for securing a regular slot in Linux magazine. If you would like to contribute then please do get in touch with her.",
               "title" : "Perl and Raku featured in Linux Format magazine",
               "ts" : "2022.03.04",
               "url" : "https://news.perlfoundation.org/post/perl-raku-linux-format-magazine"
            },
            {
               "author" : "ed_jordan",
               "text" : "Lots of performace improvements in the latest release. Please check out the link for more details.",
               "title" : "PDL 2.077 released",
               "ts" : "2022.03.17",
               "url" : "https://www.perlmonks.org/?node_id=11142132"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "It is aimed to fix issue and allow intermix text parts in the messages to log with sub references.",
               "title" : "Log::Log4perl::Tiny",
               "ts" : "2022.03.20",
               "url" : "https://metacpan.org/release/POLETTIX/Log-Log4perl-Tiny-1.4.1-TRIAL"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "dragos_trif",
               "text" : "A thorough tutorial on the use of Cucumber and Perl.",
               "title" : "How To Test Web APIs with Perl and Cucumber",
               "ts" : "2022.03.10",
               "url" : "https://www.cognizantsoftvision.com/blog/how-to-test-web-apis-with-perl-and-cucumber"
            },
            {
               "author" : "steve_bertrand",
               "text" : "Cool use of Tesla::Vehicle to access Tesla API.",
               "title" : "Access the Tesla API with Perl!",
               "ts" : "2022.03.18",
               "url" : "http://blogs.perl.org/users/steve_bertrand/2022/03/access-the-tesla-api-with-perl.html"
            },
            {
               "author" : "thibault_duponchelle",
               "text" : "Nice collection of Memes about Perl. Do you have more?",
               "title" : "The love of Perl in Memes",
               "ts" : "2022.03.15",
               "url" : "https://dev.to/thibaultduponchelle/the-love-of-perl-in-memes-1lmm"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Pythagorean Means\" and \"Brazilian Number\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 157",
               "ts" : "2022.03.21",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-157"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Pernicious Numbers\" and \"Weird Number\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 156",
               "ts" : "2022.03.21",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-154"
            },
            {
               "author" : "colin_crain",
               "tags" : [],
               "text" : "Perl Solutions Review by Colin Crain.",
               "title" : "Perl Review - Perl Weekly Challenge - 152",
               "ts" : "2022.03.21",
               "url" : "https://theweeklychallenge.org/blog/review-challenge-152"
            },
            {
               "author" : "adam_russell",
               "tags" : [],
               "text" : "Use of CPAN module makes the solution sleek. Thanks for introducing new CPAN modules. Keep it up great work.",
               "title" : "Persnickety Pernicious and Weird",
               "ts" : "2022.03.20",
               "url" : "http://www.rabbitfarm.com/cgi-bin/blosxom/perl/2022/03/20"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "For me, I found the one-liner solution in Raku for Pernicious Number task is the top class. Thanks for sharing the knowledge with us.",
               "title" : "Weirdly Pernicious",
               "ts" : "2022.03.18",
               "url" : "https://raku-musings.com/weirdly-pernicious.html"
            },
            {
               "author" : "c_y_fung",
               "tags" : [],
               "text" : "Cheok-Yin is a very brave contributor in my humble opinion. I liked the way she goes beyond the task and present her solution. Kudos to your effort.",
               "title" : "CY's Take on The Weekly Challenge #156",
               "ts" : "2022.03.19",
               "url" : "https://e7-87-83.github.io/coding/challenge_156.html"
            },
            {
               "author" : "colin_crain",
               "tags" : [],
               "text" : "Colin just being simply Colin once again. I loved the story telling ability and always a pleasure. Thanks for everything.",
               "title" : "Pernicious Perfidy",
               "ts" : "2022.03.19",
               "url" : "https://colincrain.com/2022/03/19/pernicious-perfidy/"
            },
            {
               "author" : "colin_crain",
               "tags" : [],
               "text" : "Thanks for sharing the beautiful use of __SUB__ token. Nice to see it after a long time. Keep it up great work.",
               "title" : "High Weirdness on the Number Plane",
               "ts" : "2022.03.20",
               "url" : "https://colincrain.com/2022/03/20/high-weirdness-on-the-number-plane/"
            },
            {
               "author" : "dave_jacoby",
               "tags" : [],
               "text" : "Thanks Dave for sharing the bits about Pi Day. Also because it is my daughter's birthday.",
               "title" : "Pernicious and Weird Are The Numbers We Two Can Share",
               "ts" : "2022.03.14",
               "url" : "https://jacoby.github.io/2022/03/14/pernicious-and-weird-are-the-numbers-we-two-can-share-weekly-challenge-156.html"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "I liked how easily Flavio used the bit operator. It did make the end result sleek. Thanks for sharing the knowledge. ",
               "title" : "PWC156 - Pernicious Numbers",
               "ts" : "2022.03.16",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/03/16/pwc156-pernicious-numbers/"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "Kudos to Flavio for the poetry in the middle of the blog. Keep surprising us every week.",
               "title" : "PWC156 - Weird Number",
               "ts" : "2022.03.17",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/03/17/pwc156-weird-number/"
            },
            {
               "author" : "james_smith",
               "tags" : [],
               "text" : "James presents solution with clarity. It makes even the harder task appears simple, great quality to have. Keep it up.",
               "title" : "The Weekly Challenge #156",
               "ts" : "2022.03.15",
               "url" : "https://github.com/manwar/perlweeklychallenge-club/tree/master/challenge-156/james-smith#readme"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Narative style story telling is the highlight of Laurent's blog. This week we had bonus solutions in Julia and Python too. Thank you for your contributions.",
               "title" : "Perl Weekly Challenge 156: Pernicious and Weird Numbers",
               "ts" : "2022.03.15",
               "url" : "http://blogs.perl.org/users/laurent_r/2022/03/perl-weekly-challenge-156-pernicious-and-weird-numbers.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Luis surprised all of us with his one-liner in Raku. I wonder why he didn't share the code as solution. Well done.",
               "title" : "Perl Weekly Challenge 156",
               "ts" : "2022.03.14",
               "url" : "https://wlmb.github.io/2022/03/14/PWC156/"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Peter's blog make sure all the fun bits are shared. Thanks for sharing the knowledge with us every week.",
               "title" : "Pernicious and weird ...",
               "ts" : "2022.03.17",
               "url" : "https://pjcs-pwc.blogspot.com/2022/03/pernicious-and-weird.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "The use of Hamming weight is something I wasn't aware of earlier. Discussion of multiple languages in one blog makes it even more fun to read. Thanks for everything.",
               "title" : "Weirdly Pernicious or Perniciously Weird?",
               "ts" : "2022.03.17",
               "url" : "https://blog.firedrake.org/archive/2022/03/The_Weekly_Challenge_156__Weirdly_Pernicious_or_Perniciously_Weird_.html"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org/\">The Weekly Challenge</a> by <a href=\"http://www.manwar.org/\">Mohammad Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 Amazon voucher by participating in the weekly challenge. We pick one winner at the end of the month from among all of the contributors during the month. The monthly prize is kindly sponsored by Peter Sergeant of <a href=\"https://perl.careers/\">PerlCareers</a>.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2022.11 Tau / 2",
               "ts" : "2022.03.14",
               "url" : "https://rakudoweekly.blog/2022/03/14/2022-011-tau-2/"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2022/03/ccclxxxiv-12-great-cpan-modules.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2022/03/dxxvi-stackoverflow-perl-report.html\">StackOverflow Perl report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2022.03.19",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "text" : "Our client is looking for junior and mid-level Perl developers, Node engineers, and those with stellar Python and SQL skills. They embrace flexibility, and their ideal candidate will, too. Perl may be your core competency, but if you’re invested in cross-training to Node, you may be the full package that this client wants on their team.",
               "title" : "Perl to Node Cross-training? Yes Please! UK Remote Perl Role",
               "url" : "https://job.perl.careers/ntm"
            },
            {
               "text" : "Working with first responders, educators, manufacturers, and engineers, our client is the leading provider of award-winning intelligent SaaS solutions. They’re looking for a Perl developer with Catalyst and DBlx::Class.",
               "title" : "Good (Perl) Humans Wanted. Remote Perl role in USA",
               "url" : "https://job.perl.careers/79j"
            },
            {
               "text" : "We’ve got a role open for a Senior Developer skilled in both Perl and Python. These premium native advertising gurus understand corporate, tech, financial services, and lifestyle technology. You’ll use server-side code, client-side code, databases, and websites to develop the software platform.",
               "title" : "Python and Perl: Better Together! Perl/Python role in London",
               "url" : "https://job.perl.careers/c98"
            },
            {
               "text" : "Our international client provides online trading services. They’ve got a stack of projects that need the right Chief Software Architect to manage their team as they work through these projects, and that’s where you come in. You’ll work closely with the Chief Technology Officer, mentor engineering teams and provide guidance in solving issues.",
               "title" : "Are you at the head of the pack? Chief Software Architect role in Malaysia",
               "url" : "https://job.perl.careers/ij9"
            },
            {
               "text" : "Our client is the worldwide leader in machine intelligence for matching people with jobs, which is to say that when it comes to hiring, they know what they’re doing. Applicants, bring your “A” game: they’re looking for a Natural Language Processing (NLP) Engineer who is passionate about Machine Intelligence and can evaluate NLP systems.",
               "title" : "What would your computer say about you? Perl, Python, NLP role in Amsterdam",
               "url" : "https://job.perl.careers/e0n"
            }
         ],
         "sponsor" : 1,
         "title" : "<a href=\"https://perl.careers/?utm_source=perlweekly&utm_campaign=perlweekly&utm_medium=perlweekly\">Perl Jobs by Perl Careers</a>"
      }
   ],
   "date" : "2022-03-21",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there",
      "How do you test <strong>Web API</strong> using Perl?",
      "I am sure you have most likely used TDD to test your Web API. How about trying something new for a change?",
      "Something like BDD, Behaviour Driven Development. I came across BDD many years ago when my manager introduced the term to the team and gave us a short tutorial using Java. I was completely blown away by the idea itself. I never actually got the opportunity to use BDD in any of the Perl projects I have worked afterwards, unfortunately. Then few years later in 2018, I got the opportunity to attend the talk <a href=\"https://act.yapc.eu/lpw2018/talk/7547\">Behaviour Driven Development and Cucumber</a> by <strong>Martin Berends</strong> at London Perl Workshop. Just quick search and I found the <a href=\"https://www.youtube.com/watch?v=B6IsKr50wAE\">video</a> of the same talk. If you missed the talk then it is your chance now to watch the talk. If the video is not enough and you are looking for more. I would highly recommend the book <a href=\"https://www.amazon.co.uk/dp/B084Z6GTKK\">Cucumber & Perl</a> by <strong>John Davies</strong>. It was published by <a href=\"https://perlschool.com\">Perl School</a> publishing house run by <strong>Dave Cross</strong>. If you are interested in complete tutorial then you should check out this <a href=\"https://www.cognizantsoftvision.com/blog/how-to-test-web-apis-with-perl-and-cucumber\">blog post</a>.",
      "Talking about BDD, I came across the term \"<strong>Extreme Programming (XP)</strong>\". TDD has been part of my day job most of the time without realising it being part of XP. I found this <a href=\"https://www.extremeperl.org/bk/home\">website</a> showing <strong>Extreme Programming using Perl</strong>. You can download the entire book in <a href=\"https://www.extremeperl.org/f/extremeperl.pdf\">pdf format</a> for FREE. If you are new to <strong>Extreme Programming</strong> then take a look at the <a href=\"http://www.extremeprogramming.org\">gentle introduction</a>.",
      "Last couple of years have been very tough for most of us in the IT sector. Although we all have been adjusted to the new normal of work from home culture, it still has left some scars behind. Mental health is one such thing being discussed more frequently during this period. I have found a way to keep my mind busy when needed and it is reading books (mostly non-technical). Recently I found the quote <strong>\"Lately my peace has been more important than proving my point.\"</strong> on web that express my current mental state. How do you deal with your WFH blues?",
      "Last but not the least, I have finally reached the 3 digits figure i.e. my <strong>100th edition</strong> of the weekly newsletter. It took me nearly <strong>3 years</strong> to get this far. I would like to take this opportunity to thank each and every readers of the weekly newsletter for the kind words and appreciations. I would also like to thank, <strong>Gabor Szabo</strong> for being my guide and mentor, all these years.",
      "Enjoy the rest of the newsletter, stay safe and pray for world peace."
   ],
   "subject" : "Cucumber & Perl"
}
