{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "flavio_poletti",
               "text" : "",
               "title" : "ActiveDirectory password encoding in Perl and shell",
               "ts" : "2022.05.16",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/16/ad-password-perl-and-shell/"
            },
            {
               "author" : "flavio_poletti",
               "text" : "'As any average Perl hacker, ...' Flavio opens his post. On the second reading I understood that he means that many Perl hackers do it, but first I thought he think of himself as being average. If that was the case, Perl would not be declining and we would have so many articles for the Perl weekly that we would not be able to include even 10% of them. Anyway, who does not want to maintain a templating system?",
               "title" : "Adding functions in Template::Perlish",
               "ts" : "2022.05.20",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/20/template-perlish-adding-functions/"
            },
            {
               "author" : "flavio_poletti",
               "text" : "",
               "title" : "Curses::UI and signatures",
               "ts" : "2022.05.21",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/21/curses-ui-and-signatures/"
            },
            {
               "author" : "flavio_poletti",
               "text" : "",
               "title" : "Curses::UI callbacks",
               "ts" : "2022.05.22",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/22/curses-ui-callbacks/"
            },
            {
               "author" : "curtis_ovid_poe",
               "text" : "How to create a version of Moose which is safer and easier to use, including removing a lot of boilerplate?",
               "title" : "MooseX::Extreme Needs a New Name",
               "ts" : "2022.05.22",
               "url" : "http://blogs.perl.org/users/ovid/2022/05/moosexextreme-needs-a-new-name.html"
            },
            {
               "author" : "tom_wyant",
               "text" : "",
               "title" : "My Favorite Modules: Time::Piece",
               "ts" : "2022.05.19",
               "url" : "http://blogs.perl.org/users/tom_wyant/2022/05/my-favorite-modules-timepiece.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "victoria_beserra",
               "text" : "More articles about Mojolicious from Victoria Ricarte Bispo Beserra",
               "title" : "Mojolicious in Portuguese",
               "ts" : "2022.05.16",
               "url" : "https://dev.to/victoriabispo/mojolicious-12j"
            },
            {
               "author" : "gabor_szabo",
               "text" : "",
               "title" : "Dancer2: Exercise 1 - Calculator, Counter",
               "ts" : "2022.05.16",
               "url" : "https://perlmaven.com/dancer2-exercise-1"
            },
            {
               "author" : "gabor_szabo",
               "text" : "",
               "title" : "Dancer2: Solution: 1 - Calculator",
               "ts" : "2022.05.23",
               "url" : "https://perlmaven.com/dancer2-solution-1-calculator"
            }
         ],
         "title" : "Web"
      },
      {
         "entries" : [
            {
               "author" : "dave_cross",
               "text" : "Dave started to create a list of tutorials for CPAN modules with the idea to link to them from MetaCPAN. Excellent idea. I hope it will be integrated into MetaCPAN and won't be a separate web site. And if it is a separate website I'd probably just use GitHub pages. See also <a href=\"https://www.reddit.com/r/perl/comments/ut2u91/linking_cpan_modules_with_tutorials/\">Reddit</a>.",
               "title" : "CPAN Module Tutorials",
               "ts" : "2022.05.20",
               "url" : "https://dev.to/davorg/cpan-module-tutorials-2be9"
            }
         ],
         "title" : "CPAN"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Hexadecimal Words\" and \"K-Directory Diff\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 166",
               "ts" : "2022.05.23",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-166"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Scalable Vector Graphics (SVG)\" and \"Line of Best Fit\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 165",
               "ts" : "2022.05.23",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-165"
            },
            {
               "author" : "adam_russell",
               "tags" : [],
               "text" : "Cool compact and modular solution to the weekly challenge. Thanks for your contributions.",
               "title" : "SVG Plots of Points and Lines",
               "ts" : "2022.05.22",
               "url" : "http://www.rabbitfarm.com/cgi-bin/blosxom/perl/2022/05/22"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "Arne's style of showing the steps to get the end result is very impressive. Thanks for sharing the knowledge with us.",
               "title" : "Doubly Scalable",
               "ts" : "2022.05.22",
               "url" : "https://raku-musings.com/doubly-scalable.html"
            },
            {
               "author" : "cheok_fung",
               "tags" : [],
               "text" : "Cheok=Yin's blog is lot more than just the solutions and I loved that. Keep it up great work.",
               "title" : "CY's Take on The Weekly Challenge #165",
               "ts" : "2022.05.17",
               "url" : "https://e7-87-83.github.io/coding/challenge_165.html"
            },
            {
               "author" : "james_smith",
               "tags" : [],
               "text" : "I am a big fan of James's style of coding. It feels like reading a poetry. Incredible, thanks for your contributions.",
               "title" : "straight through the point!",
               "ts" : "2022.05.18",
               "url" : "https://github.com/manwar/perlweeklychallenge-club/tree/master/challenge-165/james-smith#readme"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "Nice representation of SVG in Raku makes it look simple and easy to follow. Beauty, thanks.",
               "title" : "PWC165 - Scalable Vector Graphics (SVG)",
               "ts" : "2022.05.17",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/17/pwc165-scalable-vector-graphics/"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "Too much maths involved but the end result looks not that bad. Nice work, keep it up.",
               "title" : "PWC165 - Line of Best Fit",
               "ts" : "2022.05.18",
               "url" : "https://github.polettix.it/ETOOBUSY/2022/05/18/pwc165-line-of-best-fit/"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Good use of CPAN module SVG. The end result is the compact and easy to read solution. Thanks for your contribution.",
               "title" : "Perl Weekly Challenge 165: Scalable Vector Graphics",
               "ts" : "2022.05.21",
               "url" : "http://blogs.perl.org/users/laurent_r/2022/05/perl-weekly-challenge-165-scalable-vestor-graphics.html"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Laurent's side by side solutions in Perl and Raku is the best way to learn. Keep it up great work.",
               "title" : "Perl Weekly Challenge 165: Line of Best Fit",
               "ts" : "2022.05.19",
               "url" : "http://blogs.perl.org/users/laurent_r/2022/05/perl-weekly-challenge-165-line-of-best-fit.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "Luca's forte is Raku but I am sure you would appreciate his PostgreSQL solution. Thanks for everything.",
               "title" : "Perl Weekly Challenge 165: SVG",
               "ts" : "2022.05.18",
               "url" : "https://fluca1978.github.io/2022/05/18/PerlWeeklyChallenge165.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Another nice demo of PDL by Luis as one-liner. Great job, thanks.",
               "title" : "Perl Weekly Challenge 165",
               "ts" : "2022.05.20",
               "url" : "https://wlmb.github.io/2022/05/20/PWC165/"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Peter has a lot to say this week as SVG is his favourite subject. It shows in the blog details. Keep it up great work.",
               "title" : "Dots, lines and whatever fits best",
               "ts" : "2022.05.18",
               "url" : "https://pjcs-pwc.blogspot.com/2022/05/dots-lines-and-whatever-fits-best.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "Well documented solution in Raku along with the precise breakdown. Nice and easy to ready. Thanks for your contributions.",
               "title" : "Scaling the Fits",
               "ts" : "2022.05.19",
               "url" : "https://blog.firedrake.org/archive/2022/05/The_Weekly_Challenge_165__Scaling_the_Fits.html"
            },
            {
               "author" : "ryan_thompson",
               "tags" : [],
               "text" : "I simply love the presentation. It is so colourfull and makes it fun to follow through. Keep it up great work.",
               "title" : "PWC 165 › Simple SVG generator",
               "ts" : "2022.05.18",
               "url" : "https://ry.ca/2022/05/simple-svg-generator/"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"http://www.manwar.org\">Mohammad Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 Amazon voucher by participating in the weekly challenge. We pick one winner at the end of the month from among all of the contributors during the month. The monthly prize is kindly sponsored by Peter Sergeant of <a href=\"https://perl.careers/\">PerlCareers</a>.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2022/05/cccxciii-7-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2022/05/dvii-metacpan-weekly-report.html\">MetaCPAN weekly report</a>;<br><a href=\"https://niceperl.blogspot.com/2022/05/dxxxv-stackoverflow-perl-report.html\">StackOverflow Perl report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2022.05.21",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2022-05-25T18:00:00-04:00",
               "text" : "Wednesday, May 25, 2022; 06:00 PM Eastern Time (US and Canada)",
               "title" : "Charlotte PM Richard Hipp Talks About All Things SQLite",
               "url" : "https://www.meetup.com/charlotte-pm/events/285406494/"
            }
         ],
         "title" : "Events"
      },
      {
         "entries" : [
            {
               "text" : "Are you experienced with backend web development? (Mojolicious, Perl, and Go to the front!) Do you have oodles of vanilla JS expertise and an ability to work with a geographically dispersed team? Can you write unit and integration tests for frontend and backend code? We want to hear from you!",
               "title" : "Senior Web Developers, Defend the Internet! Remote US-based Perl role (open to Canadians)",
               "url" : "https://job.perl.careers/116"
            },
            {
               "text" : "Our client connects people in the UK and US seeking flatmates or homes to share, allowing would-be roomies to find exactly what they’re looking for. These flatmate matchmakers need a Software Developer (Backend) to increase the delivery capacity of their core team. Their core platform is mostly written in Perl, so Perl folks, this one’s for you.",
               "title" : "Wanna be Flatmates? Perl role in Manchester",
               "url" : "https://job.perl.careers/v1m"
            },
            {
               "text" : "Our client is looking for junior or intermediate Perl developers, Node engineers, and those with stellar Python and SQL skills. They embrace flexibility, and their ideal candidate will, too. Perl may be your core competency, but if you’re invested in cross-training to Node, you may be the full package that this client wants on their team.",
               "title" : "Perl to Node Cross-training? Yes Please! UK Remote Perl Role",
               "url" : "https://job.perl.careers/om4"
            },
            {
               "text" : "A global leader in machine intelligence matching job seekers with their perfect career: our client’s goal is human level parsing. They’re on the hunt for an NLP Engineer whose passion for NLP is matched only by their interest in Machine Intelligence and their ability to drive quality improvements, measurement standards, and error analysis processes for the NLP framework.",
               "title" : "NLP is all right by me! Perl, Python, NLP role in Amsterdam",
               "url" : "https://job.perl.careers/orx"
            },
            {
               "text" : "In an ideal world, you’ll be on-site in Malaysia. Malta or Dubai would do in a pinch as this global company has offices there, too. However, if you’re reading this from Cairo or Buenos Aires and think you’re the star candidate they’re looking for, you’re not out of the running. Our client knows the value of a strong leader and even if you’re located outside their preferred places.",
               "title" : "Thought-Leader Wanted. Chief Software Architect Role",
               "url" : "https://job.perl.careers/euq"
            }
         ],
         "sponsor" : 1,
         "title" : "<a href=\"https://perl.careers/?utm_source=perlweekly&utm_campaign=perlweekly&utm_medium=perlweekly\">Perl Jobs by Perl Careers</a>"
      }
   ],
   "date" : "2022-05-23",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there!",
      "Two weeks ago I wrote about the issues we are facing with the Perl Weekly. I got a lot of responses and then yesterday I also noticed there were quite few comments on <a href=\"https://www.reddit.com/r/perl/comments/unb6yd/do_you_want_the_perl_weekly_to_continue/\">Reddit</a> as well. Let me thank all the responses now.",
      "Many people suggested that we could switch to sending out every 2 weeks or once a month, but I don't think either of those would be a good idea. Some people suggested we (Mohammad and myself) should write more articles or interview people. Well, no. The Perl Weekly is specifically about collecting <b>your</b> content and sharing it. So it is the wider Perl community that could solve the content-problem by writing more articles. Which brings me to one of our posts today. Dave Cross had another nice idea, <a href=\"https://dev.to/davorg/cpan-module-tutorials-2be9\">linking to tutorials of CPAN modules from MetaCPAN</a>. You don't need to write some article on a topic that has never been mentioned. It would be enough to take one of the modules you use anyway. Put together an example on how to use it. Add some explanations and then post it on your blog. (Which could be very simple using GitHub pages.) Send us the link and also include it in the CSV file of Dave.",
      "Some people suggested to have a (better) web version and RSS feed. You are welcome to send a PR changing the web version to be better. The source of the Perl Weekly is <a href=\"https://github.com/szabgab/perlweekly\">here</a>. We also have two different RSS feeds: <a href=\"https://perlweekly.com/perlweekly.rss\">latest edition</a>, <a href=\"https://perlweekly.com/index.rss\">10 most recent editions</a>. However these get updated only once a week. If you really like RSS, you might want to use the <a href=\"https://perl.theplanetarium.org/\">Perl Planetarium</a> by who else, Dave Cross.",
      "There was some back-and-forth on Reddit whether the Perl-related Facebook groups are the best thing on earth or the worst thing on Earth. I think both sides are right. On one hand Facebook is a black hole that anything going there is invisible from the outside world - that's why I don't often link to it. On the other hand the <a href=\"https://www.facebook.com/groups/perlcommunity\">Perl Community</a> and the <a href=\"https://www.facebook.com/groups/perlprogrammers/\">Perl programmers</a> Facebook groups seem to be the most active locations for discussing anything about Perl. So let's thank those Perl Mongers who spend time in these groups helping the newcomers. If I may suggest something, if you are not doing it yet: You could also try to direct them to the Perl Weekly and you could also work with them to set up a public blog (or use <a href=\"https://dev.to/t/perl\">dev.to</a>) and write a post about something Perl related.",
      "Finally, some people suggested to ask for a grant from The Perl Foundation. Here is the thing. Money in itself is not an issue, but feeling that the work we do is appreciated goes a long way. The many responses I got show that there are at least a few people who value our work. Thank you!. However, if the issue of money was already raised you could use some money to show your appreciation. <a href=\"https://www.patreon.com/manwar\">Mohammad S Anwar</a> has Patreon account with currently 23 supporters. Can we double this number? I also have a Patreon account, but for me a much better boost would be if you checked out the web-site of my son and became a user and a paying subscriber. It is called <a href=\"https://torto.ai/welcome?utm_source=perlweekly&utm_medium=email&utm_campaign=perlweekly565\">torto.ai</a>. That will make me a lot happier than any money you might send to my Patreon account.",
      "So that's about it for now.",
      "Enjoy your week!"
   ],
   "subject" : "Supporting the Perl Weekly"
}
