{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "I watched the presentation of Sawyer, and then the QA. One thing I can tell, that when I received abuse in public, what really hurt was that I did not see (enough) people publicly standing up for me. Not even with a down-vote of the abusing post (e.g. Reddit). Besides hurting me, I think this also hurts the community a lot. People watching these forums seeing the abuse that goes unchallenged will much less likely to get involved in the community.",
               "title" : "No One Is Immune to Abuse",
               "ts" : "2023.07.30",
               "url" : "https://blogs.perl.org/users/oldtechaa/2023/07/no-one-is-immune-to-abuse.html"
            },
            {
               "author" : "flavio_poletti",
               "text" : "Romeo is a hydra-like Perl program. But what is Hydra? Here is what Flavio says about Romeo: Terminal utilities, mainly for fun and celebrating a great cat.",
               "title" : "Romeo teepee gets looping option",
               "ts" : "2023.07.30",
               "url" : "https://github.polettix.it/ETOOBUSY/2023/07/30/romeo-teepee-gets-looping-option/"
            },
            {
               "author" : "",
               "text" : "That is, someone wanted to know if the book <b>Programming Perl</b> will be updated.",
               "title" : "Will the reference books be updated?",
               "ts" : "2023.07.30",
               "url" : "https://www.reddit.com/r/perl/comments/15dbkjn/will_the_reference_books_be_updated/"
            },
            {
               "author" : "william_shunn",
               "text" : "The new social media network is growing by leaps and bounds. Learning to post to it with Perl offers lessons useful to coders of all languages.",
               "title" : "Building a Perl Module for Posting to Bluesky Social",
               "ts" : "2023.07.11",
               "url" : "https://betterprogramming.pub/building-a-perl-module-for-posting-to-bluesky-social-92fc732fc297"
            },
            {
               "author" : "flavio_poletti",
               "text" : "After 3 years of blogging every day, Flavio took a 3-day break. Just to have fresh start.",
               "title" : "Three days of pause",
               "ts" : "2023.07.25",
               "url" : "https://github.polettix.it/ETOOBUSY/2023/07/25/three-days-of-pause/"
            },
            {
               "author" : "oodler",
               "text" : "",
               "title" : "More prototype play: Dispatch::Fu",
               "ts" : "2023.07.26",
               "url" : "https://blogs.perl.org/users/oodler_577/2023/07/more-prototype-play-dispatchfu.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "tony_cook",
               "text" : "",
               "title" : "Perl Core Maintenance Grant Extension request ",
               "ts" : "2023.07.25",
               "url" : "https://news.perlfoundation.org/post/grant-extension-tony-cook-2023"
            }
         ],
         "title" : "Grants"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Unique Sum\" and \"Empty Array\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 228",
               "ts" : "2023.07.31",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-228"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Friday 13th\" and \"Roman Maths\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 227",
               "ts" : "2023.07.31",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-227"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Use of CPAN module made the solutions compact. Thanks for the blog post.",
               "title" : "TWC227",
               "ts" : "2023.07.24",
               "url" : "https://deadmarshal.blogspot.com/"
            },
            {
               "author" : "andrew_shitov",
               "tags" : [],
               "text" : "How to write compact Raku code? You will find the answer in the post by Andrew.",
               "title" : "Counting Fridays the 13th in Raku",
               "ts" : "2023.07.24",
               "url" : "https://andrewshitov.com/2023/07/24/counting-friday-the-13th-in-raku/"
            },
            {
               "author" : "andrew_shitov",
               "tags" : [],
               "text" : "Use of Raku grammar to solve the task. Complex topic can be explained in easy to follow post. Thanks for sharing.",
               "title" : "Calculator with Roman numbers using Raku Grammars",
               "ts" : "2023.07.24",
               "url" : "https://andrewshitov.com/2023/07/24/calculator-with-roman-numbers-in-raku/"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The verbose nature of Raku is making the solution elegant. Thanks for sharing.",
               "title" : "The 13th Roman",
               "ts" : "2023.07.26",
               "url" : "https://raku-musings.com/13th-roman.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "Favourite CPAN module for date, DateTime, is once again showing the elegance. Well done.",
               "title" : "Perl Weekly Challenge: Week 227",
               "ts" : "2023.07.30",
               "url" : "https://www.braincells.com/perl/2023/07/perl_weekly_challenge_week_227.html"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "Raku one-liner is worth taking a look. You will fall in love with it. Thanks for sharing.",
               "title" : "PWC227 - Friday 13th",
               "ts" : "2023.07.28",
               "url" : "https://github.polettix.it/ETOOBUSY/2023/07/28/pwc227-friday-13th/"
            },
            {
               "author" : "flavio_poletti",
               "tags" : [],
               "text" : "Roman number task solved by resident of Rome. Nice co-incidence. Highly recommended.",
               "title" : "PWC227 - Roman Maths",
               "ts" : "2023.07.29",
               "url" : "https://github.polettix.it/ETOOBUSY/2023/07/29/pwc227-roman-maths/"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Using the core module for date operation in Perl and Raku makes the end result portable. Keep it up great work.",
               "title" : "Perl Weekly Challenge 227: Friday 13th",
               "ts" : "2023.07.26",
               "url" : "https://blogs.perl.org/users/laurent_r/2023/07/perl-weekly-challenge-227-friday-13th.html"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "A thorough task analysis is worth reading, you don't want to miss it. Thanks for sharing.",
               "title" : "Perl Weekly Challenge 227: Roman Maths",
               "ts" : "2023.07.26",
               "url" : "https://blogs.perl.org/users/laurent_r/2023/07/perl-weekly-challenge-227-roman-maths.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Pure Perl solution without the use of CPAN and it is one-liner too. Great work.",
               "title" : "Perl Weekly Challenge 227",
               "ts" : "2023.07.24",
               "url" : "https://wlmb.github.io/2023/07/24/PWC227/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "High performance solution with detailed discussion. Keep it up great work.",
               "title" : "Friday XIII",
               "ts" : "2023.07.30",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-227/challenge-227/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "Using core Perl module makes the solution nice and clean. It is so easy to follow too. Thanks for your contributions.",
               "title" : "Perl Weekly Challenge #227",
               "ts" : "2023.07.27",
               "url" : "http://packy.dardan.com/2023/07/27/perl-weekly-challenge-227/"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Peter solving his own proposed tasks. As usual you will see the elegance every where. Thank you.",
               "title" : "Bad luck and mathematica",
               "ts" : "2023.07.24",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/227"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "Clever use of CPAN module and we have cool solution. Well done.",
               "title" : "The Weekly Challenge #227",
               "ts" : "2023.07.24",
               "url" : "https://hatley-software.blogspot.com/2023/07/robbie-hatleys-solutions-to-weekly_24.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "No gimmicks, just get the job done in multiple languages. Highly recommended.",
               "title" : "The 13th Roman",
               "ts" : "2023.07.30",
               "url" : "https://blog.firedrake.org/archive/2023/07/The_Weekly_Challenge_227__The_13th_Roman.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "Like every week, we have Perl and Python solutions together. Thanks for sharing the knowledge with us.",
               "title" : "Weekly Challenge 227",
               "ts" : "2023.07.30",
               "url" : "https://dev.to/simongreennet/weekly-challenge-227-3loi"
            },
            {
               "author" : "stephen_lynn",
               "tags" : [],
               "text" : "Playing safe with the use of CPAN module. You will love the solutions too. Well done.",
               "title" : "PWC 227",
               "ts" : "2023.07.30",
               "url" : "https://thiujiac.blogspot.com/2023/07/pwc-227.html"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"http://www.manwar.org\">Mohammad Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 Amazon voucher by participating in the weekly challenge. We pick one winner at the end of the month from among all of the contributors during the month. The monthly prize is kindly sponsored by Peter Sergeant of <a href=\"https://perl.careers/\">PerlCareers</a>.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2023/07/cdliv-14-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2023/07/dlxiii-metacpan-weekly-report-lingy.html\">MetaCPAN weekly report</a>;<br><a href=\"https://niceperl.blogspot.com/2023/07/dlxxxviii-stackoverflow-perl-report.html\">StackOverflow Perl report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2023.07",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2023-04-24",
               "text" : "August 14-18, 2023, Helsinki, Finland",
               "title" : "Perl and Koha",
               "url" : "https://perlkohacon.fi/"
            }
         ],
         "title" : "Events"
      },
      {
         "entries" : [
            {
               "text" : "Our client is a global leader in the enterprise technology publishing industry, providing audiences worldwide with stimulating perspectives and unique news on enterprise tech that matters today and tomorrow. They are seeking a talented Perl programmer to manage the full life-cycle of software projects on a remote basis. The ideal candidate must be UK/EU-based.",
               "title" : "UK Remote Perl Programmer for Leading Enterprise Tech Publication",
               "url" : "https://job.perl.careers/10e"
            },
            {
               "text" : "Our UK-based client is a global leader in the enterprise technology publishing industry, providing audiences worldwide with stimulating perspectives and unique news on enterprise tech that matters today and tomorrow. They are currently seeking a passionate and exceptional Perl programmer based in the Philippines to join their team.",
               "title" : "Perl Programmer Opportunity - Join a Prominent Tech Publishing Powerhouse in the Philippines",
               "url" : "https://job.perl.careers/mo8"
            },
            {
               "text" : "With all the knowledge in your big, beautiful brain, it’s time to join a company that appreciates your breadth of experience. Our client provides online trading services and with offices in Dubai, Malta, and Malaysia, they’ve got the global reach that may provide the challenge you’re looking for. They know that a seasoned Perl pro is just what their team needs, and that’s where you come in!",
               "title" : "Bold, beautiful, and… brainy? Senior Perl roles in Malaysia, Dubai and Malta",
               "url" : "https://job.perl.careers/0gh"
            },
            {
               "text" : "Are you a talented Perl programmer with Rust experience looking to work for a cutting-edge enterprise tech publisher that’s at the forefront of the industry? Look no further than our client, a renowned publisher that provides unique news and stimulating perspectives on the enterprise tech that powers businesses across the globe.",
               "title" : "Perl Programmer with Rust Experience - UK Remote",
               "url" : "https://job.perl.careers/a0m"
            }
         ],
         "sponsor" : 1,
         "title" : "<a href=\"https://perl.careers/?utm_source=perlweekly&utm_campaign=perlweekly&utm_medium=perlweekly\">Perl Jobs by Perl Careers</a>"
      }
   ],
   "date" : "2023-07-31",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there!",
      "You might know that for many years I provided Perl training to corporations, both here in Israel and overseas. Unfortunately there are hardly any Perl courses these days. Three years ago I had a client from Switzerland that wanted to have a mix of training and consulting on testing their perl-based code. Another client from Germany wanted me to analyze their code-base and give them recommendations on how to modernize their code-base. There were a few others who reached out to me, but none of them were testing-related and none talked about training. I recommended them to contact some of the other people who do Perl consulting.",
      "I am not the only one who mostly lost their perl-related income. Some still stick around the Perl community maybe writing some Perl for fun, but they had to find other sources of income. Some people moved away from hi-tech altogether others moved to non-programming positions, and others learned other languages. For some time Ruby was a big winner of ex Perl developers, but it has been declining for years. Python had an appeal too, but they created so much animosity towards Perl, that switching over had an emotional toll. In a way Go (Golang) was an easier choice as it is so different from Perl. Then came Rust.",
      "So what shall I do now? I asked myself a couple of years ago when I noticed that my Perl-related income has almost totally vanished. I still ask it now as I have not really found a 'home'.",
      "It took me quite a while to pick up Python, but eventually I started to write a lot of code and started teach it too. It is going quite well. However, despite even helping with the organization of several Python conferences, I never felt part of the Python community.",
      "Recently I picked up Rust and I went all in. I started to work on the <a href=\"https://rust-digger.code-maven.com/\">Rust Digger</a> which is similar to the <a href=\"https://cpan-digger.perlmaven.com/\">CPAN Digger</a>, I already uploaded my <a href=\"https://rustatic.code-maven.com/\">first crate</a>, and I even started to run my first experimental Rust course (in Hebrew). I was quite happy to see the presentation of Dave Rolsy: <a href=\"https://www.youtube.com/watch?v=vBsEF-anSLY\">Why Do Programmers Love Rust?</a>. That gave me further motivation.",
      "So now I am thinking to offer another, still experimental Rust course. This time in English. Probably starting in September. It will be Zoom-based; 2-3 hours a meeting in the morning hours of USA, late afternoon in Europe; running for a few weeks. It will cost a few hundred USD/EUR. The exact details will be determined later. For now I'd like to see if there is an interest attending it. So if you feel you'd like to participate let me know. Without any obligation to actually participate.",
      "Have a good your week!"
   ],
   "subject" : "Rust is fun"
}
