{
   "date" : "2024-09-02",
   "editor" : "mohammad_anwar",
   "subject" : "Perl and Corinna",
   "header" : [
     "Hi there,",
     "<strong>Corinna?</strong>",
     "<strong>Did you just asked that?</strong> Well just to give some background, it was the project to add a new object system to the <strong>Perl</strong> core led by <strong>Curtis Poe</strong>. I would highly recommend you <a href=\"https://github.com/Perl-Apollo/Corinna\">checkout this repository</a> if you are completely new to <strong>Corinna</strong>. And if you still have time to read more then you should <a href=\"https://curtispoe.org/articles/corinna-in-the-perl-core.html\">this blog post</a> by the man himself, <strong>Curtis Poe</strong>. Those who are well informed and updated, might ask why am I talking about it now since it is already in core? Well, many have got their hand dirty with the new OO system and shared their experiences. Overall response is, we loved it but we want more. I am pretty confident in the next production release we would have more features added to it. The one I am personally looking for is to be able to create <strong>role</strong> using new OO syntax. Well again, I haven't answered the question, why talking about it now? Last <strong>Thursday</strong>, I went to office (day job) to attend company meeting. I only go when it is special occassion otherwise I work from home. This time, it was giving farewell to our boss and best friend. After we were done with speech and celebration, I was just looking for something to read and I came across <a href=\"https://dev.to/davorg/on-the-bleading-edge-1olf\">this blog post</a> by <strong>Dave Cross</strong>. I was completely blown away the way he articulated his experience with the new OO system. It is not easy to do so, as if you are not carefull then it might come across as negative. I am a big fan of his writing skill, be it his <a href=\"https://davecross.co.uk/books\">books</a> or his <a href=\"https://perlhacks.com/author/davorg\">blog posts</a>. Coming back to his recent post, he mentioned few names (I don't want to repeat here and spoil your experience) and how they helped him deal with the issues he discussed in the post. I really want you all to take your own sweet time and read this thoroughly. I am sure, you will love it too.",
     "<strong>Are you lazy programmer?</strong>",
     "Please don't get me wrong, I don't mean in derogatory way. We, as a programmer, always look for getting things done quick. With experience in hand, you do get your way most of the time. <strong>Olaf Alders</strong> recently shared a very <a href=\"https://www.olafalders.com/2024/08/28/i-am-still-lazy\">engaging blost post</a>. In the post he is talking about his toy, <a href=\"https://metacpan.org/pod/lazy\">lazy</a>. I liked the name, short and precise. This tool is definitely going into my toolbox as I find it very handy and easy to use. If you ever had trouble with dependency when running a script then this is your friend.",
     "Let me share a funny story about my early days. I started as a <strong>Visual Basic</strong> programmer. Then few years after playing with it, I decided to make a move in the year <strong>1999</strong>. I was given two choices, <strong>Perl</strong> and <strong>Java</strong>. The company offered me to learn the language on the job. I picked <strong>Perl</strong> without knowing anything about it and here I am editing weekly newsletter specially for <strong>Perl</strong> fans. I didn't ditch <strong>Java</strong> completely to be honest. I keep playing with it as and when I got time. With the project like <a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> that I have been running successfully for over <strong>5 years</strong> helped me keep the passion alive. A friend of mine shared this fun project, <a href=\"https://github.com/fglock/PerlOnJava\">PerlOnJava</a>. Just to give you an overview, it is a <strong>Perl</strong> compiler. It compiles <strong>Perl</strong> into <strong>Java</strong> bytecode and runs it.",
     "<strong>What's new on CPAN?</strong>",
     "Thank you, <strong>Mathew Korica</strong> for keeping the tradition alive. It gives an insight what is happening on <strong>CPAN</strong>. It doesn't matter whether you have your own distributions or you use others, it is always fun to see what is new added on. It also gives you an overview as bonus. If you never uploaded anything to <strong>CPAN</strong> then do come up with something usefull and push it. And if you are lucky, it might end up in the monthly report. If we are talking about <strong>CPAN</strong> then we can't ignore <a href=\"https://metacpan.org\">MetaCPAN</a>. It is one stop place for all <strong>Perl</strong> programmers. I have seen it's growth over the years with added features and tools. Thanks to the entire team behind the project. Also thanks to the sponsor, <a href=\"https://opencagedata.com\">OpenCage</a>, for the support. Someone shared the blog post: <a href=\"https://www.perl.com/article/why-we-sponsor-metacpan-opencage\">Why We Sponsor MetaCPAN: OpenCage</a>. It is pleasure to see how <strong>Perl</strong> is helping such a big project. It is worth reading, in my humble opinion.",
     "In the less than two months, we are going to have <a href=\"https://act.yapc.eu/lpw2024\">London Perl & Raku Workshop 2024</a>. I am so happy to hear that we are now 90% full on two tracks. The organiser is now planning to add a third track. If you are planning to attend the much awaited event then I would suggest you register asap. This would help the organisers manage the event better. If you or your company using <strong>Perl</strong> then why not consider sponsoring the event. Talking about conference, I would like to mention <a href=\"https://yapcjapan.org/2024hakodate\">YAPC::Hakodate 2024</a>. This is second event in the year <strong>2024</strong>. I wish we had at least one in <strong>Europe</strong>. Before the pandemic, it used to be an annual event. Last time, <strong>YAPC::Europe</strong> happened was in <strong>Riga</strong> in the year <strong>2019</strong>. It was decided at the event the that in <strong>2020</strong> we would meet in <strong>Amsterdam</strong>. Unfortunately it didn't happen, so sad.",
     "Please do take extra care of yourself and your loved one. Enjoy rest of the newsletter."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "LPW 2024 Will Have A Third Track",
               "author" : "lee_johnson",
               "text" : "We now have a third track, wohooo. Please do come and experience the positive energy.",
               "url" : "https://act.yapc.eu/lpw2024/news/1704",
               "ts" : "2024.08.24"
            },
            {
               "title" : "YAPC::Hakodate 2024",
               "author" : "",
               "text" : "Tickets for the event are on sale. If you are planning to attend then get your ticket before it is too late.",
               "url" : "https://yapcjapan.org/2024hakodate/",
               "ts" : "2024.08.29"
            },
            {
               "title" : "What's new on CPAN - July 2024",
               "author" : "mathew_korica",
               "text" : "See what's new on <strong>CPAN</strong> last month. Who knows you might find something usefull in it.",
               "url" : "https://www.perl.com/article/what-s-new-on-cpan-july-2024/",
               "ts" : "2024.08.26"
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "On the [b]leading edge",
               "author" : "dave_cross",
               "text" : "Are you one of those, who wants to play on bleading edge? If yes then checkout this masterpiece.",
               "url" : "https://dev.to/davorg/on-the-bleading-edge-1olf",
               "ts" : "2024.08.29"
            },
            {
               "title" : "I'm Still Lazy",
               "author" : "olaf_alders",
               "text" : "Do you consider yourself lazy? Nothing wrong to be a lazy programmer. Please checkout this handy tool named <strong>\"lazy\"</strong>.",
               "url" : "https://www.olafalders.com/2024/08/28/i-am-still-lazy/",
               "ts" : "2024.08.28"
            },
            {
               "title" : "PerlOnJava - Perl Compiler Under Development",
               "author" : "",
               "text" : "If you are Perl programmer and wants the flexibility of running on JVM then you should give it a go.",
               "url" : "https://github.com/fglock/PerlOnJava",
               "ts" : "2024.08.29"
            },
            {
               "title" : "Why We Sponsor MetaCPAN: OpenCage",
               "author" : "ed_freyfogle",
               "text" : "Ed sharing the reason behind sponsoring MetaCPAN.",
               "url" : "https://www.perl.com/article/why-we-sponsor-metacpan-opencage",
               "ts" : "2024.08.12"
            }
         ]
      },
      {
         "title" : "Discussion",
         "entries" : [
            {
               "title" : "This week in PSC (158) | 2024-08-29",
               "author" : "",
               "text" : "Memory leak in 5.40 was one of topics discussed in PSC meetings.",
               "url" : "https://blogs.perl.org/users/psc/2024/08/this-week-in-psc-158-2024-08-29.html",
               "ts" : "2024.08.31"
            },
            {
               "title" : "New class of memory leaks inaugurated by Perl v5.40 (and we are unprepared for that)",
               "author" : "karjala",
               "text" : "A rather rare memory leak found in v5.40 as shared in the post. Nothing to worry as it is being looked after.",
               "url" : "https://blogs.perl.org/users/karjala/2024/08/new-class-of-memory-leaks-inaugurated-by-perl-v540-and-we-are-unprepared-for-that.html",
               "ts" : "2024.08.28"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"No Connection\" and \"Making Change\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 285",
               "ts" : "2024.09.02",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-285"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Lucky Integer\" and \"Relative Sort\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 284",
               "ts" : "2024.09.02",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-284"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Compact and concise solutions in Perl with the help of CPAN module. Thanks for sharing the knowledge.",
               "title" : "TWC284",
               "ts" : "2024.08.28",
               "url" : "https://deadmarshal.blogspot.com/2024/08/twc284.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "If you are looking for variations then you will likely find many in the post. Ofcourse it is limited to Raku only. Enjoy !!!",
               "title" : "Relatively Lucky",
               "ts" : "2024.08.29",
               "url" : "https://raku-musings.com/relatively-lucky.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "Plenty of Raku magics end up in one-liner with every details discussed and enough to keep you busy. Keep it up great work.",
               "title" : "Perl Weekly Challenge: Week 284",
               "ts" : "2024.09.01",
               "url" : "https://www.braincells.com/perl/2024/08/perl_weekly_challenge_week_284.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "If you are PDL fan then you don't want to skip this. It seems so simple, yet elegant. Well done and keep it up.",
               "title" : "Relatively Lucky",
               "ts" : "2024.08.30",
               "url" : "https://github.sommrey.de/the-bears-den/2024/08/30/ch-284.html"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Comparative approach in Perl and Raku makes an interesting read, plenty to learn too. Highly recommended.",
               "title" : "Perl Weekly Challenge 284: Lucky Integer",
               "ts" : "2024.08.26",
               "url" : "https://blogs.perl.org/users/laurent_r/2024/08/perl-weekly-challenge-284-lucky-integer.html"
            },
            {
               "author" : "laurent_rosenfeld",
               "tags" : [],
               "text" : "Please checkout the use of BagHash in Raku and regular hash in Perl. Enjoy the best of both worlds.",
               "title" : "Perl Weekly Challenge 284: Relative Sort",
               "ts" : "2024.08.27",
               "url" : "https://blogs.perl.org/users/laurent_r/2024/08/perl-weekly-challenge-284-relative-sort.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Master of Perl one-liner is once again sharing his masterpiece. Highly recommended.",
               "title" : "Perl Weekly Challenge 284",
               "ts" : "2024.08.26",
               "url" : "https://wlmb.github.io/2024/08/26/PWC284/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "Use of map and sort together can be lethal. See it yourself how it worked out the challenge. Well done.",
               "title" : "Use frequency frequently!",
               "ts" : "2024.09.01",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-284/challenge-284/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "Method chaining of Raku in action and well crafted. I am very impressed, thanks for the contributions.",
               "title" : "Relatively Lucky",
               "ts" : "2024.08.26",
               "url" : "https://packy.dardan.com/b/QX"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Task analysis is well drafted to keep you engaged. Ofcourse you have the DIY tool to play as well.",
               "title" : "Lucky relatives",
               "ts" : "2024.08.26",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/284"
            },
            {
               "author" : "reinier_maliepaard",
               "tags" : [],
               "text" : "Once again you see the power of CPAN module. It gets job done in no time. Well done and thanks for sharing.",
               "title" : "The Weekly Challenge - 284",
               "ts" : "2024.08.29",
               "url" : "https://reiniermaliepaard.nl/perl/pwc/index.php?id=pwc284"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "Compact one line narration to sum up the whole story. Incredible.",
               "title" : "The Weekly Challenge #284",
               "ts" : "2024.08.26",
               "url" : "https://hatley-software.blogspot.com/2024/08/robbie-hatleys-solutions-to-weekly_26.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "Lazy approach by sharp brain. See the power of Perl. You get the collection of guest languages as bonus. Keep it up great.",
               "title" : "Lucky Relative",
               "ts" : "2024.09.01",
               "url" : "https://blog.firedrake.org/archive/2024/09/The_Weekly_Challenge_284__Lucky_Relative.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "As always blog focussed on Python and it's simplicity. You will fall in love with one-liner. Great work.",
               "title" : "The lucky sort",
               "ts" : "2024.09.01",
               "url" : "https://dev.to/simongreennet/the-lucky-sort-1648"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2024.35 Cro 💍 HTMX",
               "ts" : "2024.08.26",
               "url" : "https://rakudoweekly.blog/2024/08/26/2024-35-cro-%f0%9f%92%8d-htmx/"
            }
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2024/08/dxi-15-great-cpan-modules-released-last.html\">Great CPAN modules released last week</a>.",
              "ts" : "2024.08.31"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
