{
   "date" : "2025-09-01",
   "editor" : "mohammad_anwar",
   "subject" : "NICEPERL",
   "header" : [
     "Hi there,",
     "The association of the weekly newsletter with <a href=\"https://niceperl.blogspot.com\">NICEPERL</a> goes back much further than mine.",
     "Right from its tagline, <strong>\"where we turn Perl inside out\"</strong>, the blog signals its mission: to dive deep into the <strong>Perl</strong> language and its ecosystem with a hands-on, exploratory spirit.",
     "It covers notable updates and insightful commentary on <strong>CPAN</strong> modules and <strong>Perl</strong> tools.",
     "There’s a balance of careful maintenance, practical technical insights and well-curated community news. By consistently showcasing noteworthy <strong>CPAN</strong> modules and pairing that with a personal, open-source-driven perspective, it provides steady, meaningful value, quietly but effectively.",
     "In a world awash with generic tech content, efforts like <strong>NICEPERL</strong> stand out for their depth and specificity. For <strong>Perl</strong> professionals, whether you're tracking tools, following community trends or just curious about the latest <strong>CPAN</strong> releases, <strong>NICEPERL</strong> remains a reliable and worthwhile resource.",
     "Do you remember, <strong>What is new on CPAN?</strong> series on <a href=\"https://www.perl.com\">perl.com</a>? Unfortunately, the last post in the series was in <a href=\"https://www.perl.com/article/what-s-new-on-cpan---january-2025\">January 2025</a>. Hopefully, it makes a comeback soon, I would love to see it return as a regular feature.",
     "Enjoy rest of the newsletter."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "My Guilty Perl Obsession",
               "author" : "bryan_katz",
               "text" : "The article beautifully captures what many in open-source communities know but sometimes forget: that our everyday tools represent labor and generosity. Bryan's earnest confession and commitment to reciprocate stands out as both humble and inspiring, a timely reminder that supporting the communities behind our tools is not just benevolent, but essential.",
               "url" : "https://www.perl.com/article/my-guilty-perl-obsession/",
               "ts" : "2025.08.26"
            },
            {
               "title" : "OpenAPI::Client::OpenAI",
               "author" : "curtis_ovid_poe",
               "text" : "The changes appear well-considered and address several common developer pain points while positioning the platform for more sophisticated use cases.",
               "url" : "https://metacpan.org/dist/OpenAPI-Client-OpenAI/changes",
               "ts" : "2025.08.22"
            },
            {
               "title" : "Call for Papers & Participation - Perl Community Conference, Winter 2025",
               "author" : "oodler",
               "text" : "The Winter 2025 Perl Community Conference is a hybrid in-person and online event.",
               "url" : "https://science.perlcommunity.org/spj/announcement/view/9",
               "ts" : "2025.08.27"
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "Testing a Perl Mojolicious web app",
               "author" : "dragos_trif",
               "text" : "The post is a practical, hands-on tutorial demonstrating how to write tests for a web application built with the Mojolicious framework in Perl. It's aimed at developers who are familiar with the basics of Mojolicious and want to implement a test-driven development (TDD) workflow or simply add tests to their application.",
               "url" : "https://dev.to/dragostrif/testing-an-perl-mojolicious-web-app-43j7",
               "ts" : "2025.08.25"
            },
            {
               "title" : "Even lighter Perl modulinos with Util::H2O::More",
               "author" : "mark_gardner",
               "text" : "This post is an advanced, in-depth tutorial that tackles a sophisticated Perl software design pattern: the Modulino. It explains how to transform a standalone script into a module-like entity that is both runnable directly and testable by external programs.",
               "url" : "https://phoenixtrap.com/2025/08/24/testable-perl-modulinos-h2o-more/",
               "ts" : "2025.08.24"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Smaller Than Current\" and \"Odd Matrix\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 337",
               "ts" : "2025.09.01",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-337"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Equal Group\" and \"Final Score\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 336",
               "ts" : "2025.09.01",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-336"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Excellent solutions. They are concise, efficient and demonstrate a strong command of Perl idioms and core modules. The logic is clear and directly addresses the problem requirements.",
               "title" : "TWC336",
               "ts" : "2025.08.25",
               "url" : "https://deadmarshal.blogspot.com/2025/08/twc336.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "This is an excellent, intermediate-to-advanced level post that effectively showcases Raku's unique approach to OOP. It is well-structured, using clear, practical examples to demonstrate the \"what,\" \"why\" and \"how\" of these features.",
               "title" : "Equally Final",
               "ts" : "2025.08.29",
               "url" : "https://raku-musings.com/equally-final.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "The post delivers a clean and approachable presentation of both challenges—with clear problem statements, illustrative examples and step-by-step solutions. Each task is broken down intuitively, making it accessible to both new and seasoned Perl programmers.",
               "title" : "Perl Weekly Challenge: Week 336",
               "ts" : "2025.08.26",
               "url" : "https://www.braincells.com/perl/2025/08/perl_weekly_challenge_week_336.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "This post is a fantastic and highly practical walkthrough of solving the task. It excels not just in providing solutions but in demonstrating a thought process and the iterative refinement of code.",
               "title" : "Finally Equal",
               "ts" : "2025.08.29",
               "url" : "https://github.sommrey.de/the-bears-den/2025/08/29/ch-336.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Both solutions are clear, concise, and idiomatic, demonstrating solid problem-solving skills and effective use of Perl features. They balance simplicity with robustness and are well supported by examples.",
               "title" : "Perl Weekly Challenge 336",
               "ts" : "2025.08.25",
               "url" : "https://wlmb.github.io/2025/08/25/PWC336/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "Both solutions are clear, idiomatic and well-structured, with code that directly reflects the problem description.",
               "title" : "Equal Groups and Final Scores",
               "ts" : "2025.08.31",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-336/challenge-336/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This is a high-quality technical blog post that demonstrates excellent programming skills across multiple languages. It shows deep understanding of each language's unique features and idioms while maintaining consistent logic across implementations. The explanations are clear and the code is well-structured and readable.",
               "title" : "The Score for Group Therapy",
               "ts" : "2025.08.26",
               "url" : "https://packy.dardan.com/b/a9"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Solutions are more mathematically elegant, while they are more explicit about verifying the actual grouping conditions. Both approaches have merit depending on the specific requirements!",
               "title" : "Grouping and scoring",
               "ts" : "2025.08.25",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/336"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "Solutions are generally preferable for their clarity and efficiency, while Robbie's demonstrate alternative approaches with more defensive programming. The mathematical insight that GCD > 1 ⇔ all frequencies divisible by smallest frequency > 1 is particularly interesting!",
               "title" : "The Weekly Challenge #336",
               "ts" : "2025.08.25",
               "url" : "https://hatley-software.blogspot.com/2025/08/robbie-hatleys-solutions-in-perl-for_25.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "The approaches are clean, readable and effective, though you could acknowledge the efficiency of a GCD-based shortcut for Task 1 or bolster Task 2 with safeguards (like guarding against empty-stack operations) to strengthen robustness.",
               "title" : "In the Final Reckoning, We're All Equal",
               "ts" : "2025.08.31",
               "url" : "https://blog.firedrake.org/archive/2025/08/The_Weekly_Challenge_336__In_the_Final_Reckoning__We_re_All_Equal.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "The post delivers a clear, idiomatic Python and Perl solution that elegantly operationalises the stack-based scoring logic, complete with thorough error handling for invalid inputs. The structured walkthrough from leveraging GitHub Copilot to reinforcing robustness with exceptions—results in both readable and resilient code.",
               "title" : "Equalling the score",
               "ts" : "2025.08.31",
               "url" : "https://dev.to/simongreennet/weekly-challenge-equalling-the-score-5f2n"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "The title, \"Computationally Irreducible\", is a playful and clever reference to a core theme of the week: complex problems that can't be easily simplified or predicted without actually running the code.",
               "title" : "2025.34 Computationally Irreducible",
               "ts" : "2025.08.25",
               "url" : "https://rakudoweekly.blog/2025/08/25/2025-34-computationally-irreducible/"
            }
         ]
      },
      {
         "title" : "Training",
         "entries" : [
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2025/08/dlxiii-11-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2025/08/dcxiv-metacpan-weekly-report-timepiece.html\">MetaCPAN weekly report</a>.",
              "ts" : "2025.08.30"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
