{
   "date" : "2025-09-15",
   "editor" : "mohammad_anwar",
   "subject" : "Design Patterns",
   "header" : [
     "Hi there,",
     "Say <strong>\"Design Patterns\"</strong> and <strong>\"Perl\"</strong> in the same sentence and you may receive puzzled looks. To a large audience of the software world, <strong>Perl</strong> is still pigeon holed as a \"write-only\" script; a wild west where structure goes to die. In comparison, there is the <strong>Gang of Four's</strong> text, with its formalized object-oriented design diagrams, which seems to exist in its own universe.",
    "That perception isn't just stale, but wrong. <strong>Perl</strong> is compatible with <strong>Design Patterns</strong>. As a matter of fact, patterns and perl are quite complementary.",
    "<strong>Perl</strong> has always embraced the principles that patterns are trying to get at: flexibility, maintainability, and clarity. The well-known principle of \"There's more than one way to do it\" (TIMTOWTDI) isn't meant to be a negation of structure, but more of an encouragement for intentional design. <strong>Perl</strong> doesn't just allow patterns, it often can express design patterns more nimbly than rigid patterns in rule-bound languages.",
    "In <strong>Perl</strong> there really is no decision to go with patterns or not, but rather how to apply patterns. Patterns as they relate to <strong>Perl</strong> will intricately exist as idioms based and not frameworks as in many other languages, even when additional libraries are implemented there are patterns that are idiomatic to the language and its ecosystem.",
    "<strong>Perl</strong>'s best design pattern is, simply, the pattern of well-thought out and effective problem-solving. And that, I think, is as timeless as software engineering gets.",
    "I've published the first post, <a href=\"https://theweeklychallenge.org/blog/design-pattern-factory\">Factory Method</a>, part of a long series.",
    "Enjoy rest of the newsletter."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "Strawberry Perl 5.42.0.1 64-bit UCRT",
               "author" : "",
               "text" : "The release notes are in draft form only and need to be edited before being uploaded to the website. In particular, DBD::MySql is not part of the release.",
               "url" : "https://github.com/StrawberryPerl/Perl-Dist-Strawberry/releases/tag/SP_54201_64bit",
               "ts" : "2025.08.06"
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "Caching using CHI",
               "author" : "mohammad_anwar",
               "text" : "Here is piece of work that demonstrates the power of Perl's modern ecosystem by taking a common, real-world problem (caching) and showcasing a robust, modular solution (the CHI module).",
               "url" : "https://theweeklychallenge.org/blog/caching-using-chi",
               "ts" : "2025.09.08"
            },
            {
               "title" : "Design Pattern Factory",
               "author" : "mohammad_anwar",
               "text" : "An educational article, it successfully demystifies the Factory Pattern by grounding it in a concrete, relatable example. The post is exceptionally well-structured moving from a real-world problem to a suboptimal solution and finally to an elegant implementation of the pattern.",
               "url" : "https://theweeklychallenge.org/blog/design-pattern-factory/",
               "ts" : "2025.09.11"
            },
            {
               "title" : "Migration direction has matter!",
               "author" : "eugen_konkov",
               "text" : "This is a highly technical, niche and opinionated post aimed at a very specific audience: system administrators or developers maintaining legacy Perl code that interacts with databases.",
               "url" : "https://blogs.perl.org/users/eugen_konkov/2025/09/migration-direction-has-matter.html",
               "ts" : "2025.09.11"
            },
            {
               "title" : "Perl Rebounds In TIOBE Index - Why?",
               "author" : "nikos_vaggalis",
               "text" : "The article is valuable as a news brief. It informs readers that Perl is still active and may be experiencing a renewal of interest. It introduces valid, positive points about the language. It identifies a relevant trend, accurately describes Perl's strengths, positive and readable.",
               "url" : "https://www.i-programmer.info/news/222-perl/18308-perl-rebounds-in-tiobe-index-why.html",
               "ts" : "2025.09.10"
            }
         ]
      },
      {
         "title" : "Grants",
         "entries" : [
            {
               "title" : "PEVANS Core Perl 5: Grant Report for August 2025",
               "author" : "",
               "text" : "",
               "url" : "https://news.perlfoundation.org/post/pevans_core_dev_august_2025",
               "ts" : "2025.09.09"
            },
            {
               "title" : "Maintaining Perl (Tony Cook) August 2025",
               "author" : "",
               "text" : "",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_tonyc_august_2025",
               "ts" : "2025.09.09"
            },
            {
               "title" : "Maintaining Perl 5 Core (Dave Mitchell): August 2025",
               "author" : "",
               "text" : "",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_dave_mitchell_august_2025",
               "ts" : "2025.09.09"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Max Diff\" and \"Peak Point\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 339",
               "ts" : "2025.09.15",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-339"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Highest Row\" and \"Max Distance\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 338",
               "ts" : "2025.09.15",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-338"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "The solutions are concise, correct and effectively leverage the power of the List::Util module. They demonstrate a strong functional programming style within Perl, using map to transform data and higher-order functions like max to find solutions. The code is clean, readable and gets the job done with minimal overhead.",
               "title" : "TWC338",
               "ts" : "2025.09.08",
               "url" : "https://deadmarshal.blogspot.com/2025/09/twc338.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "This is a well-written, high-quality post that perfectly embodies the spirit of Raku programming. It demonstrates a clear progression from a straightforward, imperative solution to a more elegant, functional and idiomatic Raku solution.",
               "title" : "Row the Distance",
               "ts" : "2025.09.10",
               "url" : "https://raku-musings.com/row-distance.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "It is a well-written, clear and practical walkthrough of solving the weekly challenge. It successfully achieves its goal of explaining the thought process and implementation for the first task. The post is technically sound, easy to follow and demonstrates good coding practices.",
               "title" : "Maximal maximization of maximums",
               "ts" : "2025.09.08",
               "url" : "https://dev.to/boblied/pwc-338-maximal-maximization-of-maximums-4jm1"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "This is a classic example of a \"code golfer\" or \"one-liner\" approach to solving coding challenges. The solutions are exceptionally concise and leverage the high-level features of Raku and Perl to their fullest. The focus is on brevity and clever use of built-in operators rather than on readability, educational value or software engineering best practices.",
               "title" : "Perl Weekly Challenge: Week 338",
               "ts" : "2025.09.10",
               "url" : "https://www.braincells.com/perl/2025/09/perl_weekly_challenge_week_338.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "This post is a fantastic deep dive into problem-solving. It stands out for its exceptional quality, showcasing not just solutions but a true computer scientist's approach: rigorous analysis, systematic exploration of multiple algorithms with clear complexity analysis and empirical performance testing.",
               "title" : "Vectored Max",
               "ts" : "2025.09.12",
               "url" : "https://github.sommrey.de/the-bears-den/2025/09/12/ch-338.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "These solutions leverage the powerful Perl Data Language (PDL) to solve the challenges with extreme brevity and computational efficiency. PDL is designed for numerical computing and these examples perfectly demonstrate its strength in vectorizing operations that would require explicit loops in standard Perl. The solutions are concise, efficient and elegant for those familiar with the PDL paradigm.",
               "title" : "Perl Weekly Challenge 338",
               "ts" : "2025.09.07",
               "url" : "https://wlmb.github.io/2025/09/07/PWC338/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "This is a masterclass in writing concise, idiomatic and efficient Perl. Matthias demonstrates a deep understanding of the language's functional programming capabilities and standard libraries. The solutions are not just correct; they are elegant and demonstrate a clear preference for clarity and performance over brute force.",
               "title" : "Higher and Higher",
               "ts" : "2025.09.14",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-338/challenge-338/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "A solid, correct and engaging post. The solutions are technically sound and nicely idiomatic in each language.",
               "title" : "Maxwell’s Silver Highest",
               "ts" : "2025.09.08",
               "url" : "https://packy.dardan.com/b/b0"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Peter's solutions are exemplary models of clarity, robustness and efficiency. He deliberately chooses transparent, verbose code over clever one-liners, making his solutions easy to understand and maintain. Furthermore, he demonstrates deep insight by identifying and implementing highly efficient algorithms, especially for the second task.",
               "title" : "High and far",
               "ts" : "2025.09.08",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/338"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "This is an exemplary model of how to write clean, professional and well-documented solutions to coding challenges. The code prioritizes readability, robustness and maintainability over cleverness or brevity.",
               "title" : "Mad Max Beyond Perldome",
               "ts" : "2025.09.09",
               "url" : "https://hatley-software.blogspot.com/2025/09/robbie-hatleys-solutions-in-perl-for_9.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This is a concise, efficient and highly practical blog post. It quickly identifies the core of the problem and implement the most efficient solution with clean, idiomatic code and avoids unnecessary fluff and focuses on the key insights and implementations.",
               "title" : "Highest to the Max",
               "ts" : "2025.09.14",
               "url" : "https://blog.firedrake.org/archive/2025/09/The_Weekly_Challenge_338__Highest_to_the_Max.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This is a well-structured, beginner-friendly and practical walkthrough of solving the weekly challenge. It takes a tutorial-style approach, explaining thought process step-by-step in a clear and accessible manner. The post is light on deep algorithmic analysis but heavy on clarity and implementation.",
               "title" : "The Highest Distance",
               "ts" : "2025.09.14",
               "url" : "https://dev.to/simongreennet/weekly-challenge-the-highest-distance-4ec"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "The reboot of raku.org is a masterclass in modern open-source pragmatism. It successfully transforms a stagnant, manually-curated webpage into a vibrant, automated showcase of the language it represents.",
               "title" : "2025.36 Raku.org Reboot",
               "ts" : "2025.09.08",
               "url" : "https://rakudoweekly.blog/2025/09/08/2025-36-raku-org-reboot/"
            }
         ]
      },
      {
         "title" : "Training",
         "entries" : [
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2025/09/dlxv-15-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
              "ts" : "2025.09.13"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
