{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "philippe_bruhat",
               "text" : "During the Perl Toolchain Summit 2025 in Leipzig, we interviewed Merijn Brand, Test::Smoke's founder, and Thibault Duponchelle, its new maintainer following the passing of Abe Timmerman, about the history of the project and how to contribute to it.",
               "title" : "The Underbar, episode 5",
               "ts" : "2025.09.26",
               "url" : "https://underbar.cpan.io/episodes/5/"
            },
            {
               "author" : "",
               "text" : "Unicode 17.0 is now supported in this release.",
               "title" : "Development Release Perl v5.43.3",
               "ts" : "2025.09.23",
               "url" : "https://metacpan.org/release/CONTRA/perl-5.43.3/view/pod/perldelta.pod"
            },
            {
               "author" : "olaf_alders",
               "text" : "fixmystreet project of mySociety is primarily written in Perl.",
               "title" : "Latest MetaCPAN sponsor mySociety",
               "ts" : "2025.09.27",
               "url" : "https://metacpan.org/about/sponsors"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "text" : "Refresher about unary operator in Perl. In the post, I shared my recent encounter.",
               "title" : "Unary Operator",
               "ts" : "2025.09.24",
               "url" : "https://theweeklychallenge.org/blog/unary-operator"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "If you ever had to work with Roles in Perl then this is must read for you. In the post, I shared my understandings.",
               "title" : "Roles in Perl",
               "ts" : "2025.09.27",
               "url" : "https://theweeklychallenge.org/blog/roles-in-perl/"
            },
            {
               "author" : "dave_cross",
               "text" : "This blog post is practical, clearly organized and can be immediately useful as it provides what it promises: simple, automated SEO solutions developed for developers. Dave exhibits strong software engineering judgment by emphasizing automation, reproducibility and measurable results based on this automated SEO analysis tool, rather than abstract SEO theories.",
               "title" : "Easy SEO for lazy programmers",
               "ts" : "2025.09.24",
               "url" : "https://perlhacks.com/2025/09/easy-seo-for-lazy-programmers/"
            },
            {
               "author" : "nikos_vaggalis",
               "text" : "This article is informative and is written in news article style. The post does a great job of informing a technical audience about a neat Perl-based AI project (which is technical), balancing enough technical details while still being accessible to both Perl lovers as well as the general programming community. It's also good advertising and exposure to an open-source project that helps to show how Perl is germane to today's AI ecosystem.",
               "title" : "LocalCode - A Perl-Based AI Coding Agent",
               "ts" : "2025.09.25",
               "url" : "https://www.i-programmer.info/news/222-perl/18340-localcode-a-perl-based-ai-coding-agent.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Broken Keyboard\" and \"Reverse Prefix\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 341",
               "ts" : "2025.09.29",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-341"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Duplicate Removals\" and \"Ascending Numbers\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 340",
               "ts" : "2025.09.29",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-340"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "This is a brief, technically correct and organized blog post that presents efficient solutions to both problems. Ali shows great problem-solving skill with neat implementations but the explanations are minimal and assume that the reader is familiar with the algorithms used.",
               "title" : "TWC340",
               "ts" : "2025.09.22",
               "url" : "https://deadmarshal.blogspot.com/2025/09/twc340.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "This is a clear, concise and useful technical blog post that demonstrates the power and expressiveness of Raku by demonstrating two different solutions to the same problem. The layout of the blog is structured in a classic and effective way: the problem statement is followed by explanations of two different approaches in a step-by-step manner. The code is clean, idiomatic and well-commented.",
               "title" : "Ascending Duplicates",
               "ts" : "2025.09.27",
               "url" : "https://raku-musings.com/ascending-duplicates.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This is a well-structured, meticulously-prepared and technically-sound blog post that demonstrates an excellent command of programming across multiple languages. Luis presents full, runnable programs instead of short snippets of code and shows excellent discipline with regard to software engineering. It is unique because of its methodical and practically minded details on implementation.",
               "title" : "Perl Weekly Challenge 340",
               "ts" : "2025.09.22",
               "url" : "https://wlmb.github.io/2025/09/22/PWC340/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "This is a how-to in writing idiomatic, succinct and concise Perl. The solutions in this article exemplify the Perl philosophy of making easy things easy and hard things possible. They leverage the features that make Perl unique, namely the regular expression engine and functional programming utilities, to produce code that is elegant and very readable to a perl programmer.",
               "title" : "Two Times Two Lines",
               "ts" : "2025.09.28",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-340/challenge-340/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This blog post is well written, engaging and education focused, providing an excellent overview of the problem solving process. Packy, takes a conversational, reflective style to walk the reader through his thinking - including thinking poorly initially and considering alternatives. The writing demonstrates strong technical competence and while still highly approachable.",
               "title" : "Rising in Num",
               "ts" : "2025.09.23",
               "url" : "https://packy.dardan.com/2025/09/23/perl-weekly-challenge-rising-in-num/"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "This is a fantastic practitioner-centred blog. It doesn't just propose a solution; it provides a thoroughly critical review of the different types of algorithmic approaches. You can really see Peter's strong engineering mindset, not only with correctness but also performance and clarity. The layout of the blog is very well structured, making the performance trade-offs between the two methods for Task 1 a very clear summary.",
               "title" : "Deduplicate and going up",
               "ts" : "2025.09.22",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/340"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "This is a smartly organized, beautifully presented and technically valid set of solutions. Robbie shows great engineering discipline through extensive documentation, organized code structure and thought given to edge cases. The solutions are correct, easy to read and easy to implement given the intended use cases.",
               "title" : "The Weekly Challenge #340",
               "ts" : "2025.09.23",
               "url" : "https://hatley-software.blogspot.com/2025/09/robbie-hatleys-solutions-in-perl-for_23.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This blog post is well-written and technical and it shows Roger has expert problem-solving skills. Roger presents correct and optimized solutions with minimal code and maximum clarity. This post has a no-frills, engineering-style approach that values correctness and efficiency over detailed explanations.",
               "title" : "Ascending Duplicates",
               "ts" : "2025.09.28",
               "url" : "https://blog.firedrake.org/archive/2025/09/The_Weekly_Challenge_340__Ascending_Duplicates.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "The blog post is approachable, clear and practical, and leads the reader through a problem solving process. Simon takes a conversational and tutorial format that should be especially inviting to developers who may be more unfamiliar with either Perl or algorithmic thinking. The post is well thought-out and explains both 'how' and 'why' to take each solution.",
               "title" : "Ascending Regex to remove the Duplicates",
               "ts" : "2025.09.28",
               "url" : "https://dev.to/simongreennet/weekly-challenge-ascending-regex-to-remove-the-duplicates-2bd"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "This is an outstanding community newsletter that achieves its dual purpose of being a technical resource and a community update. It is well balanced in both technical aspects and engagement with the community as well as providing valuable news. It is also curated at a professional level, has a wide variety of content and has a welcoming tone.",
               "title" : "2025.38 Cyclone Liz",
               "ts" : "2025.09.22",
               "url" : "https://rakudoweekly.blog/2025/09/22/2025-38-cyclone-liz/"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/09/dlxvii-8-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.09.27",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-10-14T19:30:00-04:00",
               "text" : "October 14, 2025",
               "title" : "Boston.pm - online - (2d Tuesday)",
               "url" : "https://boston-pm.github.io/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-09-29",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there,",
      "Last week was exciting for those who enjoy using <strong>Perl</strong> as <a href=\"https://metacpan.org/release/CONTRA/perl-5.43.3/view/pod/perldelta.pod\">Perl v5.43.3</a> is now available. It is nice to see another release from the tireless work, our core developers do to keep <strong>Perl</strong> modern, stable and innovative for its users. Thank you to all who have contributed to useful feature suggestions and prioritizing upgrade work for <strong>Perl</strong>.",
      "An area that we still need to grow (in terms of community engagement) is the <strong>experimental class</strong> feature. The work on the underlying feature is solid but it is missing support for <strong>Roles</strong>, a topic that many of us would consider to be essential for creating maintainable, reusable object systems. The good news is that it is not the end of the road for this feature; it is an opportunity if we are able to corral enough community support, we can help the core team get <strong>Role</strong> support into <strong>experimental class</strong> syntax sooner than later. If you have the ability, time and even just ideas, now is a great time to lend a hand to help implement this feature.",
      "As a related consideration, I've been involved in my own native <strong>Roles</strong> investigation with zero dependencies. The intention is to provide an example of using <strong>Roles</strong> in <strong>Perl</strong>'s evolving object model as simultaneously light and powerful. I shared my recent encounter in the <a href=\"https://theweeklychallenge.org/blog/roles-in-perl\">blog post</a> for now, I hope it promotes discussion and collaboration around what <strong>Role</strong> support looks like for <strong>Perl</strong> moving forward.",
      "<strong>Perl</strong> has always benefited from the support and strength of community. Let's continue to build the community by working together to contribute <strong>Roles</strong> to the core, in a way that benefits every member of the community.",
      "Enjoy rest of the newsletter."
   ],
   "subject" : "Perl v5.43.3"
}
