{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "DuckDuckGo Donates $25,000 to The Perl and Raku Foundation v2025",
               "ts" : "2025.10.01",
               "url" : "https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation-v2025/"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "mark_gardner",
               "text" : "New blog post: updating just the patches of Homebrew packages with Perl, and more macOS logging.",
               "title" : "Patch-Perfect: Smarter Homebrew Upgrades on macOS 🍎",
               "ts" : "2025.09.28",
               "url" : "https://phoenixtrap.com/2025/09/28/patch-perfect-homebrew/"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "",
               "title" : "Class and Role",
               "ts" : "2025.09",
               "url" : "https://theweeklychallenge.org/blog/class-and-role/"
            },
            {
               "author" : "e_choroba",
               "text" : "An excellent post on how to use (or not) AI to improve the speed of some code. I wonder though, and this is one of the biggest problems I have with AI:  How do I know that the lack of success by the AI was because AI is not good enough or because the prompt wasn't good enough? Maybe the selected model wasn't the right one for this task? In any case I'd reiterate the last sentence: I'd love to read your experience using AI. Both good and bad. Both with Perl and otherwise.",
               "title" : "Using AI 🤖 to Optimise the Calculation of Krippendorff’s Alpha",
               "ts" : "2025.10.01",
               "url" : "https://blogs.perl.org/users/e_choroba/2025/10/using-ai-to-optimise-the-calculation-of-krippendorffs-alhpa.html"
            },
            {
               "author" : "wesley_schwengle",
               "text" : "i3wm  is the i3 Window Manager - I admit I never understood what are Window Managers and which one I am using 😊, I also hardly cusomize anything on my computer.",
               "title" : "Workspace on Demand in i3wm 🪟",
               "ts" : "2025.09.24",
               "url" : "https://dev.to/waterkip/workspace-on-demand-in-i3wm-3nki"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "Perl instead of VBA?",
               "ts" : "2025.10.03",
               "url" : "https://www.reddit.com/r/perl/comments/1nwj431/perl_instead_of_vba/"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "Need a module for three-letter language codes + native names + reverse (optional)",
               "ts" : "2025.10.04",
               "url" : "https://www.reddit.com/r/perl/comments/1nxsgji/need_a_module_for_threeletter_language_codes/"
            },
            {
               "author" : "",
               "text" : "I find it sad that people use the word DevOps as if it was a job-description and not a cultural idea of Developers and Operations working together, but what can we do it seem a large chunk of the industry instead of embracing the DevOps culture, just created a new silo for sysadmins who know how to configure cloud services.",
               "title" : "Is Perl still used actively in DevOps or is bash used more?",
               "ts" : "2025.10.01",
               "url" : "https://www.reddit.com/r/perl/comments/1nv5xuy/is_perl_still_used_actively_in_devops_or_is_bash/"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "cpanm, local CPAN mirror served with https and self-signed certificate",
               "ts" : "2025.10.06",
               "url" : "https://www.reddit.com/r/perl/comments/1nyvbcs/cpanm_local_cpan_mirror_served_with_https_and/"
            }
         ],
         "title" : "Discussion"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "This week in PSC (202)",
               "ts" : "2025.09.25",
               "url" : "https://blogs.perl.org/users/psc/2025/09/this-week-in-psc-201-2025-09-25.html"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "This week in PSC (203)",
               "ts" : "2025.09.29",
               "url" : "https://blogs.perl.org/users/psc/2025/09/this-week-in-psc-202-2025-09-29.html"
            }
         ],
         "title" : "Perl"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Balance String\" and \"Max Score\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 342",
               "ts" : "2025.10.06",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-342"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Broken Keyboard\" and \"Reverse Prefix\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 341",
               "ts" : "2025.10.06",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-341"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "The post excels at demonstrating a problem-solving mindset, translating the problem statements into working code and explaining the logic in an accessible manner. It's a solid example of a \"solutions blog\" that is useful for others learning the language or tackling the same challenges.",
               "title" : "TWC341",
               "ts" : "2025.09.30",
               "url" : "https://deadmarshal.blogspot.com/2025/09/twc341.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The post is a well-written, insightful and practical deep dive into a specific, recurring issue in Raku: the inconsistent behavior of the reverse function. It's a high-quality piece of technical writing that is both accessible and informative.",
               "title" : "Reverse Broken Again",
               "ts" : "2025.10.04",
               "url" : "https://raku-musings.com/reverse-broken-again.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "This is a high-quality technical blog post demonstrating expert-level proficiency in both Perl and Raku. It presents elegant, efficient solutions to two programming challenges while providing clear pedagogical explanations. The content shows deep language mastery and effective teaching methodology.",
               "title" : "Perl Weekly Challenge: Week 341",
               "ts" : "2025.10.01",
               "url" : "https://www.braincells.com/perl/2025/10/perl_weekly_challenge_week_341.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "This is a comprehensive, professionally crafted technical blog post that demonstrates exceptional depth in both problem analysis and solution implementation. Flavio provides multiple approaches for each challenge, complete with detailed explanations, performance considerations and SQL implementations—making this stand out from typical solution blogs.",
               "title" : "back from Japan",
               "ts" : "2025.10.02",
               "url" : "https://fluca1978.github.io/2025/10/02/PerlWeeklyChallenge341.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This is a comprehensive, mathematically rigorous technical blog post that demonstrates exceptional analytical depth and sophisticated problem-solving across multiple programming paradigms. Luis provides solutions in Perl with detailed algorithmic analysis and creative extensions.",
               "title" : "Perl Weekly Challenge 341",
               "ts" : "2025.09.29",
               "url" : "https://wlmb.github.io/2025/09/29/PWC341/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "This is an exceptional technical blog post that demonstrates sophisticated software engineering principles, focusing on code quality, maintainability and thoughtful trade-off analysis. Matthias elevates beyond mere problem-solving to provide valuable insights into professional coding practices.",
               "title" : "(Pre-)Fix what is Broken",
               "ts" : "2025.09.29",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-341/challenge-341/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This is a well-crafted, practical technical blog post that demonstrates solid problem-solving skills with a focus on clean, readable code. Packy provides straightforward solutions to both challenges while maintaining good coding practices and offering clear explanations.",
               "title" : "Something just BROKE…",
               "ts" : "2025.09.30",
               "url" : "https://packy.dardan.com/b/bw"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "This is a practical, well-documented technical blog post that demonstrates a regex-focused approach to problem-solving with strong emphasis on robustness and error handling. Peter provides clean, working solutions with comprehensive examples and thoughtful edge case consideration.",
               "title" : "Broken keys and mixed up words",
               "ts" : "2025.09.29",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/341"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "This is an exceptionally thorough, professionally documented technical blog post that demonstrates deep Perl expertise with comprehensive problem analysis and robust implementation. Robbie provides solutions that go far beyond basic requirements, featuring extensive documentation, advanced language features and thoughtful consideration of real-world constraints.",
               "title" : "The Weekly Challenge #341",
               "ts" : "2025.10.02",
               "url" : "https://hatley-software.blogspot.com/2025/10/robbie-hatleys-solutions-in-perl-for.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This is a concise, technically proficient blog post that demonstrates clean, efficient problem-solving in multiple programming languages. Roger provides straightforward solutions with clear explanations, focusing on algorithmic clarity and practical implementation.",
               "title" : "Broken Prefix",
               "ts" : "2025.10.05",
               "url" : "https://blog.firedrake.org/archive/2025/10/The_Weekly_Challenge_341__Broken_Prefix.html"
            },
            {
               "author" : "ryan_thompson",
               "tags" : [],
               "text" : "This is a sophisticated, mathematically-inclined technical blog post that demonstrates exceptional analytical depth and creative problem-solving. Ryan provides multiple solution approaches with thorough analysis, performance considerations and elegant implementations.",
               "title" : "The Weekly Challenge #341",
               "ts" : "2025.10.04",
               "url" : "https://ry.ca/2025/10/brken-keybards-reverse-prefixes/"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This is a well-structured, beginner-friendly technical blog post that demonstrates practical problem-solving with clear explanations and multiple programming language implementations. Simon provides accessible solutions with a focus on teaching fundamental concepts.",
               "title" : "Reversing my broken keys",
               "ts" : "2025.10.05",
               "url" : "https://dev.to/simongreennet/weekly-challenge-reversing-my-broken-keys-313l"
            },
            {
               "author" : "torgny_lyon",
               "tags" : [],
               "text" : "This is a practical, test-driven development focused blog post that demonstrates clean problem-solving with an emphasis on code quality and professional practices. Torgny shows strong engineering habits and thoughtful consideration of Perl idioms.",
               "title" : "Week 341 - Broken Keyboard & Reverse Prefix",
               "ts" : "2025.10.01",
               "url" : "https://www.abc.se/~torgny/pwc.html#341"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/10/dlxviii-6-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.10.04",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-10-08T20:00:00+02:00",
               "text" : "October 8, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-10-14T19:30:00-04:00",
               "text" : "October 14, 2025",
               "title" : "Boston.pm - online - (2d Tuesday)",
               "url" : "https://boston-pm.github.io/"
            },
            {
               "begin" : "2025-11-12T20:00:00+02:00",
               "text" : "November 12, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            },
            {
               "begin" : "2025-12-10T20:00:00+02:00",
               "text" : "December 10, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-10-06",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there!",
      "It seems <a href=\"https://perl.theplanetarium.org/\">The Perl Planetarium</a> got a facelift. Congratulations!",
      "A couple of days ago I received an email from Olaf Alders, let me include the whole thing here as he explains it much better than I could do:",
      "<hr>",
      "Hi Everyone,",
      "Please excuse the mass email. Today we have a funding announcement for TPRF which is our largest gift (so far?) of 2025. I'd like to make a big splash for a few reasons:",
      "",
      "- Drawing attention to this may help to get our message out to more potential donors",
      "- This is great news for Perl/TPRF",
      "- Generating some buzz around this kind of news makes it easier for us to get another donation next year",
      "",
      "If you feel comfortable, please help to amplify this in the venues where it works for you. I will list them below. If this is not your thing, that's ok too, and I hope you'll forgive the intrusion.",
      "If you're reposting on LinkedIn, the more impactful option is to repost with your own thoughts. If you don't have thoughts to add, just a regular repost is great too.",
      "If you're able to upvote on Hacker News, that's a pretty big deal. We have managed to spend a lot of time on the front page with these kinds of announcements and I can tell you that it does not go unnoticed, especially internally at the orgs who fund us.",
      "If you can't do this today, you can also do it tomorrow, later in the week etc. The idea is to keep this information circulating as much as possible and it doesn't all have to happen on the same day.",
      "On a related note, I'm happy to join a podcast or reach out to a publication to discuss this. If you have any contacts you'd like to share with me, I'm all ears.",
      "",
      "Thanks for making it this far. Here come the links:",
      "- <a href=\"https://www.linkedin.com/posts/olafalders_duckduckgo-donates-25000-to-the-perl-and-activity-7379193904002359296-0IQL\">LinkedIn</a>",
      "- <a href=\"https://news.ycombinator.com/item?id=45439883\">Hacker News</a>",
      "- <a href=\"https://www.reddit.com/r/perl/comments/1nvddyp/duckduckgo_donates_25000_to_the_perl_and_raku/\">Reddit</a>",
      "- <a href=\"https://fosstodon.org/@oalders/115299940775703719\">Fosstodon</a>",
      "",
      "And the actual article is at <a href=\"https://www.perl.com/article/duckduckgo-donates-25-000-to-the-perl-and-raku-foundation-v2025/\">perl.com</a>",
      "",
      "Thanks again. TPRF is not yet out of the woods as far as funding goes, but things are really looking up.",
      "<hr>",
      "Enjoy your week!"
   ],
   "subject" : "Money to TPRF 💰"
}
