{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "During the Perl Toolchain Summit 2025 in Leipzig, we interviewed the CPAN Testers team. They told us about the history of the project, its recent problems, and how a new team formed around its (then) lone maintainer. They also told us about their plans for the future.",
               "title" : "Episode 6 - CPAN Testers",
               "ts" : "2025.10.10",
               "url" : "https://underbar.cpan.io/episodes/6/"
            },
            {
               "author" : "ron_savage",
               "text" : "",
               "title" : "ANNOUNCE: Wikis: Perl V 1.32 & Debian V 1.10 & Mojo V 1.07",
               "ts" : "2025.10.07",
               "url" : "https://blogs.perl.org/users/ron_savage/2025/10/announce-wikis-perl-v-132-debian-v-110-mojo-v-107.html"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "text" : "The post shares the recent upgrade to Class::Mite and thorough comparative analysis.",
               "title" : "bless vs Class::Mite",
               "ts" : "2025.10.09",
               "url" : "https://theweeklychallenge.org/blog/bless-vs-class-mite/"
            },
            {
               "author" : "thomas_klausner",
               "text" : "This is an excellent illustration of well-thought-out, useful personal software development. Instead of over-engineering or depending on bloated alternatives, \"snig\" exhibits excellent engineering judgment by using a focused, minimal tool to solve a real-world need. The project demonstrates a sophisticated approach to programming and efficient use of contemporary Perl.",
               "title" : "Static Image Gallery",
               "ts" : "2025.10.06",
               "url" : "https://domm.plix.at/perl/2025_10_braincoded_static_image_gallery.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "guido_brugnara",
               "text" : "Crypt::TimestampedData is the first open-source Perl implementation of the TimeStampedData format (RFC 5544). This format is particularly important in Italy, where it is widely used for legally-compliant certified timestamping of electronic documents.",
               "title" : "Crypt::TimestampedData",
               "ts" : "2025.10.11",
               "url" : "https://metacpan.org/dist/Crypt-TimestampedData"
            }
         ],
         "title" : "CPAN"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "Maintaining Perl 5 Core (Dave Mitchell): September 2025",
               "ts" : "2025.10.07",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_dave_mitchell_september_2025"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "Maintaining Perl (Tony Cook) September 2025",
               "ts" : "2025.10.07",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_tonyc_september_2025"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "PEVANS Core Perl 5: Grant Report for September 2025",
               "ts" : "2025.10.07",
               "url" : "https://news.perlfoundation.org/post/pevans_core_dev_september_2025"
            }
         ],
         "title" : "Grants"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Zero Friend\" and \"Champion Team\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 343",
               "ts" : "2025.10.13",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-343"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Balance String\" and \"Max Score\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 342",
               "ts" : "2025.10.13",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-342"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "These solutions exhibit clear, useful coding practices and outstanding problem-solving intuition. With simple logic that is simple to understand and debug, the author effectively converts the problem requirements into functional code.",
               "title" : "TWC342",
               "ts" : "2025.10.06",
               "url" : "https://deadmarshal.blogspot.com/2025/10/twc342.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "By using Raku's special features to write idiomatic, clear and concise code, it exhibits a sophisticated and successful approach to problem-solving, progressing from a brute-force solution to an optimized algorithm. The post is both instructive and useful because it provides a great illustration of how to evaluate and improve an algorithm.",
               "title" : "Maximum Balance",
               "ts" : "2025.10.11",
               "url" : "https://raku-musings.com/maximum-balance.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "Using List::MoreUtils is a sign of a skilled developer. Bob effectively assigns the difficult tasks of partitioning (part) and interleaving (mesh) to a well-tested, optimized external module rather than reimplementing common list operations.",
               "title" : "And a 1, and a 2",
               "ts" : "2025.10.10",
               "url" : "https://dev.to/boblied/pwc-342-balance-4eh4"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "This blog post is an excellent example of technical writing since it blends concise explanations with useful, organized code. Jaldhar solves problems with maturity, emphasizing accuracy and readability.",
               "title" : "Perl Weekly Challenge: Week 342",
               "ts" : "2025.10.08",
               "url" : "https://www.braincells.com/perl/2025/10/perl_weekly_challenge_week_342.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This is an example of technical writing that is understandable, instructive and useful. Luis exhibits a keen interest in testing, readability and methodical problem-solving. The solutions are great learning tools because they are offered as full, executable programs with extensive test suites. The approach is methodical and prioritizes accuracy and comprehension over cunning.",
               "title" : "Perl Weekly Challenge 342",
               "ts" : "2025.10.06",
               "url" : "https://wlmb.github.io/2025/10/06/PWC342/"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This technical article goes beyond the standard programming challenge solution and is extremely well-written and thoughtful. In addition to solving the issues, Packy takes advantage of them to delve deeper into language philosophy, performance trade-offs, and the craft of coding itself. The post's reflective tone, technical depth, and literary quality define it.",
               "title" : "Balanced Adagio for Strings",
               "ts" : "2025.10.08",
               "url" : "https://packy.dardan.com/b/cQ"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "This is an example of clear, effective and useful Perl programming. The solutions are simple, understandable and free of needless complexity, making them prime examples of the \"get it done right\" philosophy. Peter focuses on writing maintainable code and exhibits a solid command of Perl idioms.",
               "title" : "Fun with characters",
               "ts" : "2025.10.06",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/342"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "The article presents effective, thoughtful fixes for two different string manipulation issues. Strong algorithmic thinking and the capacity to apply solutions in a variety of programming paradigms are displayed by Roger.",
               "title" : "Balanced Max Scores the String",
               "ts" : "2025.10.12",
               "url" : "https://blog.firedrake.org/archive/2025/10/The_Weekly_Challenge_342__Balanced_Max_Scores_the_String.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This is a great technical blog post that is easy enough for beginners to understand and does a great job of simplifying difficult issues. Simon provides well-organized, useful code in both Python and Perl and exhibits a remarkable ability to communicate algorithmic thinking in straightforward terms. The post is technically sound, approachable, and instructive.",
               "title" : "Balancing the Score",
               "ts" : "2025.10.09",
               "url" : "https://dev.to/simongreennet/weekly-challenge-balancing-the-score-38kd"
            },
            {
               "author" : "torgny_lyon",
               "tags" : [],
               "text" : "This is an excellent example of idiomatic, succinct Perl programming. Torgny creates elegant and potent solutions by showcasing a thorough understanding of Perl's special features and the List::Util module. The code exhibits a high degree of Perl fluency and is remarkably compact without compromising readability.",
               "title" : "Week 342 - Balance String & Max Score",
               "ts" : "2025.10.10",
               "url" : "https://www.abc.se/~torgny/pwc.html#342"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "Commits, version numbers and closed issues are frequently used to gauge progress in the open source community. That's exactly what the most recent Rakudo Weekly News offers: a concise summary of key advancements that demonstrate how smoothly the language's engine is operating. A deprecated trait was strengthened there and a memory leak was fixed here. It's the necessary, unsexy task of laying a solid foundation.",
               "title" : "2025.40 Fosdem Calls",
               "ts" : "2025.10.06",
               "url" : "https://rakudoweekly.blog/2025/10/06/2025-40-fosdem-calls"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/10/dlxix-15-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2025/10/dcxvi-metacpan-weekly-report-perl.html\">MetaCPAN weekly report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.10.12",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-10-14T19:30:00-04:00",
               "text" : "October 14, 2025",
               "title" : "Boston.pm - online - (2d Tuesday)",
               "url" : "https://boston-pm.github.io/"
            },
            {
               "begin" : "2025-11-12T20:00:00+02:00",
               "text" : "November 12, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            },
            {
               "begin" : "2025-12-10T20:00:00+02:00",
               "text" : "December 10, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-10-13",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there,",
      "It has been immensely motivating to observe the evolution of the experimental <strong>class</strong> feature in the <strong>Perl</strong> core. Taking on one of the biggest language additions in recent memory, the core team is working heroically. But this type of ground-breaking invention requires a lot of work and resources. To maintain momentum and achieve a stable, production-ready object system swiftly, the core team needs our support. We all advance more quickly when we have more resources and more time to devote to it.",
      "This leads me to an important point regarding the overall health of our ecosystem. In order for projects like the <strong>Perl</strong> core and libraries to flourish, the <strong>Perl and Raku Foundation (TPRF)</strong> is essential. Our community is supported by <strong>TPRF</strong>'s advocacy, infrastructure and grant funding efforts.",
      "The corporate world has provided excellent confirmation of this. Businesses that understand the value that <strong>Perl</strong> adds to their infrastructure and products include <a href=\"https://geizhals.at\">Geizhals Preisvergleich</a>, <a href=\"https://www.suse.com\">SUSE</a>, <a href=\"https://www.proxmox.com/en\">Proxmox</a> and Ma href=\"https://duckduckgo.com\">DuckDuckGo</a>. Their recent, substantial gifts to <strong>TPRF</strong> are more than just money; they are a strong endorsement. They demonstrate that <strong>Perl</strong> is still an important and useful technology in today's tech environment. Our development is directly fueled by this corporate support.",
      "However, we are capable of more. The support of these progressive businesses demonstrates the path. If more of the tech giants, whose systems and success were partly based on <strong>Perl</strong>'s resilience, decided to reinvest in its future, just think of the faster progress we could achieve. Even a small contribution from them, a line item in their enormous budgets, would have a huge impact on <strong>TPRF</strong>, allowing for bigger grants, more developer funding and the continuation of <strong>Perl</strong> development for future generations.",
      "So, what can you do?",
      "Your feedback is greatly appreciated. Please continue testing and reporting on the experimental class feature. Above all, promote Perl in your own organizations. Let's start a discussion by using the kind examples provided by <strong>DuckDuckGo</strong>, <strong>SUSE</strong>, <strong>Proxmox</strong> and <strong>Geizhals</strong>. If <strong>Perl</strong> helps your business, please think about recommending that they do the same. Together, let's make sure that every boat in our thriving harbor is lifted as the tide of support continues to rise.",
      "Enjoy rest of the newsletter"
   ],
   "subject" : "Support TPRF"
}
