{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "eskild_hustvedt",
               "text" : "",
               "title" : "The joy of rediscovering Perl",
               "ts" : "2025.10",
               "url" : "https://blog.zerodogg.org/2025/10/13/the-joy-of-rediscovering-perl/"
            },
            {
               "author" : "boyd_duffee",
               "text" : "Debugging POST request headers in under 40 screen rows. Doesn't actually use Postman.",
               "title" : "Wait a minute, Mr POSTman",
               "ts" : "2025.10.16",
               "url" : "https://dev.to/duffee/wait-a-minute-mr-postman-3l3f"
            },
            {
               "author" : "steven_haryanto",
               "text" : "clipadd, a CLI included in the App::ClipboardUtils distribution, lets you add items to the desktop clipboard. It is clipboard-manager-agnostic, supporting backends like xclip and Klipper. It also has some convenient features which will be demonstrated in this document.",
               "title" : "Clipadd Cookbook",
               "ts" : "2025.10.16",
               "url" : "https://perlancar.wordpress.com/2025/10/16/clipadd-cookbook/"
            },
            {
               "author" : "mark_gardner",
               "text" : "Rewriting a script for the Homebrew package manager taught me how Go’s design choices align with platform-ready tools.",
               "title" : "Porting from Perl to Go: Simplifying for Platform Engineering",
               "ts" : "2025.10.15",
               "url" : "https://dev.to/mjgardner/porting-from-perl-to-go-simplifying-for-platform-engineering-301h"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "Full stack javascript developer looking to find a perl job",
               "ts" : "2025.10.19",
               "url" : "https://www.reddit.com/r/perl/comments/1ob1orm/full_stack_javascript_developer_looking_to_find_a/"
            },
            {
               "author" : "",
               "text" : "Would you like to add comments to this post with your suggestions on how to improve the code?",
               "title" : "Compute the Reverse Polish Notation using Perl",
               "ts" : "2025.10.18",
               "url" : "https://dev.to/sengseng/compute-the-reverse-polish-notation-using-perl-2ic0"
            },
            {
               "author" : "",
               "text" : "<a href=\"https://github.com/chrisarg/Task-MemManager-Device\">Task-MemManager-Device</a>",
               "title" : "Managing memory in the GPU with Perl",
               "ts" : "2025.10.18",
               "url" : "https://www.reddit.com/r/perl/comments/1o9iafv/managing_memory_in_the_gpu_with_perl/"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "perl XS modules for CUBIN files patching",
               "ts" : "2025.10.17",
               "url" : "https://www.reddit.com/r/perl/comments/1o90kac/perl_xs_modules_for_cubin_files_patching/"
            },
            {
               "author" : "",
               "text" : "There are a number of companies where one can have a full VPS for 4-5 USD / month with root access. You can run your own code there directly on the VPS or you can run a Docker container on it and as the load on the system growth you can upgrade the VPS to something bigger for slightly more money. I have been using Linode and Digital Ocean for many years and I am very satisfied.",
               "title" : "Would love a good web hosting company to run Perl in a fcgi or plack or whatever",
               "ts" : "2025.10.16",
               "url" : "https://www.reddit.com/r/perl/comments/1o7sxhd/would_love_a_good_web_hosting_company_to_run_perl/"
            }
         ],
         "title" : "Discussion"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "This week in PSC (204) | 2025-10-13",
               "ts" : "2025.10.14",
               "url" : "https://blogs.perl.org/users/psc/2025/10/this-week-in-psc-204-2025-10-13.html"
            }
         ],
         "title" : "Perl"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Array Form Compute\" and \"Array Formation\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 344",
               "ts" : "2025.10.20",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-344"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Zero Friend\" and \"Champion Team\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 343",
               "ts" : "2025.10.20",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-343"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Clear, effective, and showcasing strong Perl programming abilities. While Task 2 efficiently counts wins in a match matrix with clear logic and sensible hash usage, Task 1 demonstrates succinct numeric handling with strong absolute value comparisons. All things considered, the answers are clear, accurate, and elegantly demonstrate how to solve real-world problems using Perl.",
               "title" : "TWC343",
               "ts" : "2025.10.13",
               "url" : "https://deadmarshal.blogspot.com/2025/10/twc343.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "For both inexperienced and seasoned Raku developers, this is a great resource. It explores the nuances of the language and offers insightful lessons in efficient coding techniques in addition to offering workable answers to typical issues.",
               "title" : "Team Zero",
               "ts" : "2025.10.19",
               "url" : "https://raku-musings.com/team-zero.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "These solutions demonstrate superior algorithmic thinking and Perl programming at the expert level. This submission is incredibly impressive because it combines mathematical insight, language proficiency, and innovative problem-solving.",
               "title" : "Friendly Champions",
               "ts" : "2025.10.17",
               "url" : "https://github.sommrey.de/the-bears-den/2025/10/17/ch-343.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "The solutions demonstrate the useful application of PDL for array and matrix operations and are technically sound and reliable. They are great illustrations of algorithmic problem-solving in Perl since they are not only accurate but also optimized for readability and maintainability.",
               "title" : "Perl Weekly Challenge 343",
               "ts" : "2025.10.18",
               "url" : "https://wlmb.github.io/2025/10/18/PWC343/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "In addition to overcoming the obstacles, Matthias did so in a way that inspired and educated others. Programming challenges are valuable because of contributions like this one.",
               "title" : "The Zero Champion",
               "ts" : "2025.10.14",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-343/challenge-343/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "In addition to accurately resolving the difficulties, Packy has produced a superb analysis of how to apply the same algorithm across various programming paradigms while honoring the idioms and advantages of each language.",
               "title" : "Ze-ro the CHAMPIONS!",
               "ts" : "2025.10.13",
               "url" : "https://packy.dardan.com/b/cg"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Both solutions demonstrate a thorough grasp of Perl's capabilities and are executed with clarity and efficiency. They make sure the code is both functional and maintainable by following best practices for coding.",
               "title" : "No friends among the champions",
               "ts" : "2025.10.13",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/343"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "Robbie's solutions show a thorough comprehension of the problem requirements and the ability to apply efficient algorithms. They are both elegant and mathematically sound. His creative method of breaking the tie in Task 2 gives the solution an additional level of complexity.",
               "title" : "The Weekly Challenge #343",
               "ts" : "2025.10.16",
               "url" : "https://hatley-software.blogspot.com/2025/10/robbie-hatleys-solutions-in-perl-for_16.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "Roger's solutions exhibit a thorough comprehension of the problem requirements and are well-structured. The code is efficient and simple to understand because it makes use of Perl's built-in functions and simple logic. These implementations are great illustrations of how to precisely and clearly approach algorithmic problems.",
               "title" : "Zero to Champion",
               "ts" : "2025.10.19",
               "url" : "https://blog.firedrake.org/archive/2025/10/The_Weekly_Challenge_343__Zero_to_Champion.html"
            },
            {
               "author" : "ryan_thompson",
               "tags" : [],
               "text" : "The two challenges are thoughtfully and technically insightfully explored in Ryan's post. His elegant and effective solutions demonstrate a thorough comprehension of Perl's capabilities.",
               "title" : "It’s hard to make friends when you’re a zero",
               "ts" : "2025.10.19",
               "url" : "https://ry.ca/2025/10/pwc-343-its-hard-to-make-friends/"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "Simon's solution shows a thorough grasp of Python's capabilities and is both simple and effective. He makes sure the solution is reliable and capable of handling a variety of numerical inputs by utilizing the decimal module.",
               "title" : "Absolute Champion",
               "ts" : "2025.10.19",
               "url" : "https://dev.to/simongreennet/weekly-challenge-absolute-champion-57cf"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/10/dlxx-12-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2025/10/dcxvii-metacpan-weekly-report-dbdduckdb.html\">MetaCPAN weekly report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.10.19",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-11-12T20:00:00+02:00",
               "text" : "November 12, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            },
            {
               "begin" : "2025-12-10T20:00:00+02:00",
               "text" : "December 10, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-10-20",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there,",
      "Last week I went to a small conference on \"Teaching Computer Science in the era of AI/LLMs\" hosted at <a href=\"https://www.int.mta.ac.il/\">The Academic College of Tel Aviv-Yaffo</a>. It was very interesting to hear how at various institutions, for example at the <a href=\"https://www.technion.ac.il/en/\">Technion</a>, at the <a href=\"https://english.tau.ac.il/\">Tel Aviv University</a> and at <a href=\"https://www.bgu.ac.il/en/\">Ben Gurion University</a> the lecturers feel the need to change things as LLMs can now implement basically everything at the level of a CS student in a BSc program. How do you teach them to actually learn the syntax? How much should you let them use LLMs for the assignments and during the exams?",
      "I personally teach a course at the <a href=\"https://www.weizmann.ac.il/\">Weizmann Institute of Science</a> to Master's and Phd students of Biology and Life Sciences. I think 15 years ago there was a course in Perl, but now this is in Python. It is very different from teaching CS students. My students use the language a lot more to write one-time programs to analyze some data and most of them don't see themselves as 'programmers'. So they are way less interested in syntax, or 'good code'. They mostly want to get nice graphs.",
      "It is quite clear that giving them well written assignments is rather pointless. They can just put the assignment in an LLM and get the result. So what can be done?",
      "As the semester starts this coming Sunday I really need to figure out how and what to teach them. Should I basically teach them prompt engineering?",
      "<hr>",
      "Related to this I'd love to hear from you - either in an email or better yet in a blog post - on how do you use LLMs to write code? Especially Perl code. Which LLMs do you use? How do you make your prompts better? Anything special to Perl code?",
      "What would you recommend to fellow Perl developers, how to best use LLMs while writing Perl code?",
      "I know we are all still trying to figure this out, but learning from each other could make this process easier.",
      "Enjoy your week!"
   ],
   "subject" : "Writing Perl with LLMs"
}
