{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "This release focuses on Unicode handling improvements and internationalization support.",
               "title" : "Development release of Perl v5.43.4",
               "ts" : "2025.10.23",
               "url" : "https://metacpan.org/release/EHERMAN/perl-5.43.4/view/pod/perldelta.pod"
            },
            {
               "author" : "",
               "text" : "It's back again, please join us for an exciting informative one day event.",
               "title" : "London Perl Workshop 2025",
               "ts" : "2025.10.22",
               "url" : "https://www.londonperlworkshop.com/"
            },
            {
               "author" : "jason_crome",
               "text" : "Dancer2 2.0.1 has been released. It's a small maintenance release that fixes a few broken documentation links.",
               "title" : "Dancer2 2.0.1 Released",
               "ts" : "2025.10.22",
               "url" : "https://blogs.perl.org/users/jason_a_crome/2025/10/dancer2-201-released.html"
            },
            {
               "author" : "",
               "text" : "After 12 year hiatus, the Perl IDE Developer Survey has returned! Please do take part in the survey.",
               "title" : "The Perl IDE - Developer Survey 2025 is now live!",
               "ts" : "2025.10.22",
               "url" : "https://github.com/perl-ide/perl-ide-poll"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "marcontk",
               "text" : "The article is valuable and motivational, especially for people in the Perl community who feel Perl has had less representation in data science / notebooks / ML. It shows convincingly that the building blocks exist and invites people to experiment.",
               "title" : "Perl in Jupyter Notebook: A Modern Look for a Classic Language",
               "ts" : "2025.10.25",
               "url" : "https://medium.com/@marcontk/perl-in-jupyter-notebook-a-modern-look-for-a-classic-language-db2f3c0fd5e6"
            },
            {
               "author" : "federico_cagliero",
               "text" : "This article is inspiring and helpful, in my opinion. Anyone in the Perl community (or nearby) who wants to be reminded of Perl's modern capabilities and feel that it is still relevant should read it.",
               "title" : "0xblog — About “Perl”, in 2022",
               "ts" : "2025.10.12",
               "url" : "https://medium.com/@federico_cagliero/0xblog-about-perl-in-2022-06260317a64c"
            },
            {
               "author" : "lukas_mai",
               "text" : "Binary Golf Grand Prix is an annual small file format competition, currently in it's sixth year. The goal is to make the smallest possible file that fits the criteria of the challenge.",
               "title" : "A palindromic polyglot program in x86 machine code, Perl, shell, and make",
               "ts" : "2025.10.20",
               "url" : "https://blogs.perl.org/users/mauke/2025/10/a-palindromic-polyglot-program-in-x86-machine-code-perl-shell-and-make.html"
            },
            {
               "author" : "saif_ahmed",
               "text" : "Excellent technical writing - accessible deep knowledge, strong literary craft, authentic developer humor and clearly rooted in the Perl ecosystem.",
               "title" : "Beware of Geeks bearing Grifts",
               "ts" : "2025.10.24",
               "url" : "https://blogs.perl.org/users/saif/2025/10/beware-of-geeks-bearing-grifts.html"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "kobaken",
               "text" : "Test2::Plugin::SubtestFilter released for Perl tests, which allows filtering test targets by subtest name, similar to --testNamePattern in jest and vitest.",
               "title" : "Test2::Plugin::SubtestFilter",
               "ts" : "2025.10.21",
               "url" : "https://dev.to/kfly8/released-test2pluginsubtestfilter-which-filters-tests-by-subtest-name-18mh"
            }
         ],
         "title" : "CPAN"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Peak Positions\" and \"Last Visitor\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 345",
               "ts" : "2025.10.27",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-345"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Array Form Compute\" and \"Array Formation\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 344",
               "ts" : "2025.10.27",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-344"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "This blog post successfully guides the reader through the process of resolving two programming challenges and is technically sound and well-written. It exhibits sound coding techniques and strong problem-solving abilities. The main strength of the post is its easy-to-understand, step-by-step explanation style, which makes it suitable for programmers of all skill levels.",
               "title" : "TWC344",
               "ts" : "2025.10.26",
               "url" : "https://deadmarshal.blogspot.com/2025/10/twc344.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The post is well structured and easy to follow, introducing the challenge clearly and then solving it step by step. It uses clean, idiomatic Raku, showcasing native language strengths like permutations, MAIN signature validation and concise array/string transformations. The solutions are compact yet readable, demonstrating how expressive Raku can be for problems that would be verbose in other languages.",
               "title" : "Form Formation",
               "ts" : "2025.10.23",
               "url" : "https://raku-musings.com/form-formation.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "The post provides a clear, correct and well-structured solution using backtracking. It balances readability with reasonable efficiency for small to medium-sized inputs.",
               "title" : "Pick Up the Pieces",
               "ts" : "2025.10.23",
               "url" : "https://dev.to/boblied/pwc-344-task-2-pick-up-the-pieces-3391"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "This is a brief and useful article that emphasizes offering practical solutions with little fanfare. The author demonstrates a get-it-done mentality by using a \"one-liner\" approach for the first problem and a simple brute-force permutation strategy for the second. The review will draw attention to some crucial scalability and robustness considerations, even though the solutions are functionally correct for the examples provided.",
               "title" : "Perl Weekly Challenge: Week 344",
               "ts" : "2025.10.26",
               "url" : "https://www.braincells.com/perl/2025/10/perl_weekly_challenge_week_344.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "The blog post provides clear, concise and idiomatic Perl solutions to the week 344 tasks. The post provides multiple examples for each task, covering various scenarios and edge cases. This helps readers understand the problem's nuances and test their solutions effectively.",
               "title" : "Turning Arrays Into Arrays",
               "ts" : "2025.10.23",
               "url" : "https://github.sommrey.de/the-bears-den/2025/10/23/ch-344.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "The post is excellent as an educational and practical demonstration of Raku for these algorithmic challenges. It leverages Raku’s expressive features well amd for small to medium inputs, the solutions work effectively.",
               "title" : "Lazyness and too much tasks!",
               "ts" : "2025.10.20",
               "url" : "https://fluca1978.github.io/2025/10/20/PerlWeeklyChallenge344.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This is a sophisticated and well-engineered set of solutions that demonstrates deep expertise in Perl, particularly with the Perl Data Language (PDL). It provides multiple approaches for each task, showing a thorough understanding of different algorithmic strategies and their trade-offs. The code is professional, robust and well-documented.",
               "title" : "Perl Weekly Challenge 344",
               "ts" : "2025.10.20",
               "url" : "https://wlmb.github.io/2025/10/20/PWC344/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "This is a superb example of production-quality thinking that goes far beyond typical challenge solutions. Matthias demonstrates exceptional foresight in identifying edge cases and designing scalable, robust algorithms.",
               "title" : "Take it to the Limits",
               "ts" : "2025.10.26",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-344/challenge-344/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This technical blog post is incredibly well-written and captivating. It effectively achieves its main objective, which is to guide the reader through a challenging programming problem while elucidating the reasoning behind it, its dead ends and its elegant solution. In technical writing, it's the ideal illustration of \"show your work\".",
               "title" : "A-ray Sunshine!",
               "ts" : "2025.10.20",
               "url" : "https://packy.dardan.com/b/ct"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "In the great majority of real-world use cases, this solution accurately resolves the issue and is clear, practical and effective. It creates a sophisticated one-liner by utilizing Perl's advantages in handling strings and numbers. The fundamental requirement of the problem—converting between array and numerical representations—is clearly understood by Peter.",
               "title" : "Hip, hip, array!",
               "ts" : "2025.10.20",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/344"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "For the examples provided, Robbie offers two workable solutions that accurately address the challenge problems. The solutions are straightforward and practical, prioritizing clarity and simplicity over scalability or optimization for edge cases. The code has a clear structure and useful documentation.",
               "title" : "The Weekly Challenge #344",
               "ts" : "2025.10.26",
               "url" : "https://hatley-software.blogspot.com/2025/10/robbie-hatleys-solutions-in-perl-for_26.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This blog post goes beyond standard challenge solutions and is incredibly intelligent and sophisticated. In addition to solving the problems, Roger delves into complex computer science ideas and skillfully makes connections between the two seemingly unconnected tasks. The post exhibits expert-level understanding of functional programming paradigms, algorithms and programming language theory.",
               "title" : "All is Array Formation",
               "ts" : "2025.10.26",
               "url" : "https://blog.firedrake.org/archive/2025/10/The_Weekly_Challenge_344__All_is_Array_Formation.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This explanation of the Weekly Challenge solutions is clear, easy to understand and useful. Beginners and intermediate developers will find Simon's conversational, tutorial-like style especially approachable. The article emphasizes readability and direct problem-solving over algorithmic optimization, with a focus on concise, practical Perl solutions.",
               "title" : "The one about arrays",
               "ts" : "2025.10.26",
               "url" : "https://dev.to/simongreennet/weekly-challenge-the-one-about-arrays-1h8k"
            },
            {
               "author" : "vinod_kumar_k",
               "tags" : [],
               "text" : "These are clean, practical and clever solutions that demonstrate excellent Perl idioms and pragmatic problem-solving. Vinod favors simplicity and readability while leveraging Perl's unique strengths effectively.",
               "title" : "Perl Weekly Challenge: 344",
               "ts" : "2025.10.25",
               "url" : "https://dev.to/vinodk89/perl-weekly-challenge-344-1god"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2025.42 Release #186 (2025.10)",
               "ts" : "2025.10.20",
               "url" : "https://rakudoweekly.blog/2025/10/20/2025-42-release-186-2025-10/"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/10/dlxxi-10-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.10.25",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-11-12T20:00:00+02:00",
               "text" : "November 12, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-11-29T09:00:00+00:00",
               "text" : "November 29, 2025",
               "title" : "London Perl and Raku Workshop",
               "url" : "https://www.londonperlworkshop.com/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            },
            {
               "begin" : "2025-12-10T20:00:00+02:00",
               "text" : "December 10, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-10-27",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there,",
      "We are excited to announce that <strong>The Trampery</strong>, located on Old Street in London, will host the <strong>London Perl Workshop 2025</strong> on November 29, 2025. Bring your thoughts, your code, your queries and your excitement to this next must-attend <strong>Perl</strong> community event. To help shape the day, the organisers are already taking suggestions from sponsors and the community. We would like to express our gratitude in advance to all of the sponsors who help make this event possible. Our community thrives because of your support; if you or your organisation are interested in sponsorship opportunities, please review the information on the <a href=\"https://www.londonperlworkshop.com\">website</a>. This is your chance to interact, learn, share and develop whether you're an experienced <strong>Perl</strong> hacker, module author, maintainer or someone who is interested in the language's future developments.",
      "The <strong>Perl</strong> core team released the development release <strong>Perl v5.43.4</strong> concurrently with the announcement of the event. This version provides the most recent advancements in <strong>Perl</strong>'s development and is a member of the blead (development) branch. Please find the changes in the <a href=\"https://metacpan.org/release/EHERMAN/perl-5.43.4/view/pod/perldelta.pod\">perldelta</a> page.",
      "<strong>26th Oct</strong> marks the 30th anniversary of the Comprehensive Perl Archive Network (CPAN), which has been driving innovation, teamwork and the Perl ecosystem for 30 years. I can still clearly recall my initial feelings of excitement and apprehension when I uploaded a module to CPAN, knowing that it would be instantly mirrored globally. When CPAN was founded in 1995, it was truly revolutionary. Built before GitHub even existed, it gave Perl a superpower that no other language at the time possessed: a global, searchable, installable archive of reusable code. The people who created the archive as well as the archive itself are what most amaze me. CPAN has always been primarily a human network, with volunteers running PAUSE, tireless testers finding bugs before users ever notice them, authors who ship with care and toolsmiths who make installations run more smoothly each year. To celebrate the occassion, I uploaded v0.67 of <a href=\"https://metacpan.org/dist/BankAccount-Validator-UK\">BankAccount::Validator::UK</a>.",
      "Enjoy rest of the newsletter."
   ],
   "subject" : "London Perl Workshop 2025"
}
