{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "After a long hiatus the Perl IDE Survey is back to another round. It will take you about 20 seconds to fill it.",
               "title" : "Perl IDE survey",
               "ts" : "2025.10.20",
               "url" : "https://survey.perlide.org"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "david_delony",
               "text" : "",
               "title" : "6 Perl One-Liners to Replace Common Linux Utilities",
               "ts" : "2025.10.26",
               "url" : "https://www.howtogeek.com/perl-one-liners-to-replace-common-linux-utilities/"
            },
            {
               "author" : "",
               "text" : "A lesson in scoping?",
               "title" : "why for/foreach can't use existing vars?",
               "ts" : "2025.11.02",
               "url" : "https://www.reddit.com/r/perl/comments/1omedz9/why_forforeach_cant_use_existing_vars/"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "OpenAPI has become the standard for designing, building and documenting RESTful APIs. However, ensuring your OpenAPI specifications are both syntactically correct and follow best practices can be challenging. OpenAPI::Linter brings comprehensive validation and linting capabilities directly into your Perl applications and development workflow, helping you catch issues before they impact your API consumers.",
               "title" : "OpenAPI Linter",
               "ts" : "2025.11.02",
               "url" : "https://theweeklychallenge.org/blog/openapi-linter/"
            },
            {
               "author" : "charlie_gonzalez",
               "text" : "Excellent, showing the prompts help a lot!",
               "title" : "Increasing Code coverage with Gemini",
               "ts" : "2025.11.02",
               "url" : "https://blogs.perl.org/users/itcharlie/2025/11/increasing-code-coverage-with-gemini.html"
            },
            {
               "author" : "charlie_gonzalez",
               "text" : "",
               "title" : "Enhance your Gemini code assistance with a PRD document",
               "ts" : "2025.11.01",
               "url" : "https://blogs.perl.org/users/itcharlie/2025/11/enhance-your-gemini-code-assistance-with-a-prd-document.html"
            },
            {
               "author" : "karjala",
               "text" : "",
               "title" : "I made a multiple-insert as well as other methods for Mojo::Pg",
               "ts" : "2025.10",
               "url" : "https://blogs.perl.org/users/karjala/2025/10/i-made-a-multiple-insert-as-well-as-other-methods-for-mojopg.html"
            },
            {
               "author" : "ron_savage",
               "text" : "Ron moved to a retirement village and still coding at 75. Nice.",
               "title" : "ANNOUNCE: Perl.Wiki V 1.33 & Mojolicious.Wiki V 1.08",
               "ts" : "2025.10.31",
               "url" : "https://blogs.perl.org/users/ron_savage/2025/10/announce-perlwiki-v-133-mojoliciouswiki-v-108.html"
            },
            {
               "author" : "",
               "text" : "<a href=\"https://metacpan.org/pod/App::Test::Generator\">App::Test::Generator</a> - Generate fuzz and corpus-driven test harnesses. This module takes a formal input/output specification for a routine or method and automatically generates test cases.",
               "title" : "App::Test::Generator 0.12",
               "ts" : "2025.11.02",
               "url" : "https://www.reddit.com/r/perl/comments/1on01dm/apptestgenerator_012/"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Longest Parenthesis\" and \"Magic Expression\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 346",
               "ts" : "2025.11.03",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-346"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Peak Positions\" and \"Last Visitor\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 345",
               "ts" : "2025.11.03",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-345"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Code that is clear, effective and useful and that accurately addresses both issues. The solutions demonstrate good Perl fundamentals with straightforward algorithmic approaches.",
               "title" : "TWC345",
               "ts" : "2025.10.27",
               "url" : "https://deadmarshal.blogspot.com/2025/10/twc345.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "This is an excellent example of using Raku's special feature set to solve a problem in a stylish, understandable and effective manner. In addition to solving the problem, Arne uses it to illustrate why Raku is a delight for algorithmic and data-centric programming. It is a brilliant pedagogical move to go from a naive to an idiomatic solution.",
               "title" : "Last Peak",
               "ts" : "2025.11.01",
               "url" : "https://raku-musings.com/last-peak.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "Excellent practical Perl programming is demonstrated in this post, with an emphasis on readable, maintainable code that addresses the issue at hand directly. Bob takes a methodical, deliberate approach that is full of the kind of practical judgment that distinguishes good code from great code. The technical content is very interesting because of the conversational tone and cultural allusions.",
               "title" : "I Went to the Mountains",
               "ts" : "2025.10.30",
               "url" : "https://dev.to/boblied/pwc-345-i-went-to-the-mountains-43i0"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "Excellent approach to problem-solving that combines efficient debugging and logical reasoning. By pointing out edge cases, clearing up early misunderstandings and offering comprehensive explanations, Jaldhar exhibits strong analytical abilities.",
               "title" : "Perl Weekly Challenge: Week 345",
               "ts" : "2025.11.02",
               "url" : "https://www.braincells.com/perl/2025/11/perl_weekly_challenge_week_345.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "This is a thorough, engineering-focused in-depth analysis that places a premium on robustness, accuracy and beautiful API design. It is not merely a solution post. Jorg approaches the challenges with the rigor of a software engineer building production-grade code, not just solving puzzles.",
               "title" : "The Last Peak",
               "ts" : "2025.10.31",
               "url" : "https://github.sommrey.de/the-bears-den/2025/10/31/ch-345.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "A sophisticated, functionally-focused Perl solution that showcases complex programming methods like closures, iterators and functional composition. He tackles the problems with a thorough knowledge of Perl's functional programming features.",
               "title" : "Perl Weekly Challenge 345",
               "ts" : "2025.10.27",
               "url" : "https://wlmb.github.io/2025/10/27/PWC345/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "Brilliantly idiomatic Perl that makes use of sophisticated language features to produce succinct, effective and ingenious solutions. Matthias exhibits a thorough comprehension of Perl's contemporary features and functional programming capabilities.",
               "title" : "Visiting the Peaks",
               "ts" : "2025.10.31",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-345/challenge-345/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This is a philosophical and pedagogical analysis of the Perl Weekly Challenge itself rather than a solution post. The difficulties serve as a starting point for more in-depth conversations about community, learning and the nature of programming expertise.",
               "title" : "Teach Them How To Say PWC…",
               "ts" : "2025.10.28",
               "url" : "https://packy.dardan.com/b/dD"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "A simple, effective and useful Perl implementation that uses little code to accurately address both issues. Without superfluous abstraction or flourish, Peter concentrates on the fundamental algorithmic requirements. It is an example of \"get the job done\" programming.",
               "title" : "Peak at the answers",
               "ts" : "2025.10.27",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/345"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "A comprehensive, expertly designed set of solutions with a focus on robustness, extensive testing and unambiguous documentation. Robbie shows how to develop software in a methodical, quality-focused manner.",
               "title" : "The Weekly Challenge #345",
               "ts" : "2025.10.29",
               "url" : "https://hatley-software.blogspot.com/2025/10/robbie-hatleys-solutions-in-perl-for_29.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "A highly analytical and mathematically complex method that investigates the problems underlying structure. Beyond simple implementation, Roger explores mathematical properties, algorithmic complexity and sophisticated Raku idioms.",
               "title" : "Position the Visitor",
               "ts" : "2025.11.02",
               "url" : "https://blog.firedrake.org/archive/2025/11/The_Weekly_Challenge_345__Position_the_Visitor.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "A simple, useful implementation that puts accuracy and readability ahead of cunning. Simon is refreshingly honest about their comprehension of the issues and exhibits a methodical approach to problem-solving.",
               "title" : "Peak Visitors",
               "ts" : "2025.11.02",
               "url" : "https://dev.to/simongreennet/weekly-challenge-peak-visitors-3lei"
            },
            {
               "author" : "vinod_kumar_k",
               "tags" : [],
               "text" : "A clear, useful Perl implementation that uses simple, readable code to accurately address both issues. Vinod exhibits solid Perl foundations and a pragmatic approach to problem-solving.",
               "title" : "Perl Weekly Challenge: 345",
               "ts" : "2025.11.01",
               "url" : "https://dev.to/vinodk89/perl-weekly-challenge-345-2bld"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2025/11/dlxxii-15-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"\">MetaCPAN weekly report</a>;<br><a href=\"\">StackOverflow Perl report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2025.10",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2025-11-11T18:00:00+02:00",
               "text" : "November 11, 2025",
               "title" : "Perl Maven online: Adding tests to legacy Perl code",
               "url" : "https://luma.com/perl-maven"
            },
            {
               "begin" : "2025-11-12T20:00:00+02:00",
               "text" : "November 12, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2025-11-29T09:00:00+00:00",
               "text" : "November 29, 2025",
               "title" : "London Perl and Raku Workshop",
               "url" : "https://www.londonperlworkshop.com/"
            },
            {
               "begin" : "2025-12-06T13:00:00-04:00",
               "text" : "December 6, 2025",
               "title" : "Toronto.pm - online - How SUSE is using Perl",
               "url" : "https://lu.ma/v90mkqj5"
            },
            {
               "begin" : "2025-12-10T20:00:00+02:00",
               "text" : "December 10, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2025-11-03",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there!",
      "First of all, apologies. Apparently last edition included a link the source of the Perl IDE survey and not the actual <a href=\"https://survey.perlide.org\">Perl IDE Survey iteslf</a>. This week we hope to provide you with the correct link.",
      "The announcement about the <a href=\"https://londonperlworkshop.com/\">London Perl Workshop</a> might have also been a bit premature as it was still unclear if it will happen at all. I am still unclear about the exact situation, but this is an excellent opportunity for you to step up. Check out the web-site of LPW where you can find the names and the contact information of the organizers. Talk to them and offer your help. Any help. That will increase the chances for this to actually take place.",
      "I figured I need to update <a href=\"https://szabgab.com/\">my web site</a> and emphasize that I help companies deal with legacy code, and that made me think: What does 'legacy code' mean? How is it different from 'existing code' or 'code in production'? Is it a term use in a derogative manner? Does it mean 'code that is in use, but where the authors have disappeared'? Does it mean 'code that I am scared to touch'? Maybe 'code that still makes money, but we are unsure how it works, we need to make changes but we are scared to do'?",
      "I'd love to hear (well, read) what do you think about it. I know I could ask the AI overlord, but I am old-school and I prefer human intelligencce.",
      "While we are figuring out how to define legacy code I thought I'll organize an online event in which we'll take a CPAN module and add some tests to it. <a href=\"https://luma.com/perl-maven\">Register here</a>",
      "In any case, have a nice week!"
   ],
   "subject" : "Perl IDE Survey"
}
