{
   "date" : "2025-12-08",
   "editor" : "mohammad_anwar",
   "subject" : "Perl Advent Calendar 2025",
   "header" : [
     "Hi there,",
     "One of the most enjoyable yearly customs in the community, the <a href=\"https://perladvent.org/2025\">Perl Advent Calendar 2025</a>, is being introduced this week. A new article, tutorial, or in-depth analysis demonstrating the ingenuity and skill that continue to propel <strong>Perl</strong> forward is released every day.",
     "The calendar has something for every skill level, whether you're interested in cutting-edge <strong>Perl</strong> techniques, witty one-liners, <strong>CPAN</strong> gems, or true engineering tales. It serves as a reminder that <strong>Perl</strong>'s ecosystem is still active, creative, and developing-driven by a fervent community that enjoys exchanging knowledge.",
     "If you still want more, be sure to check out, <a href=\"https://theweeklychallenge.org/blog/advent-calendar-2025\">The Weekly Challenge Advent Calendar 2025</a>. There you'll find not just Perl, but Raku as well.",
     "Last but not least, I'd like to extend my heartfelt thanks to <strong>Gabor Szabo</strong> for kindly promoting my book: <a href=\"https://perlschool.com/books/design-patterns\">Design Patterns in Modern Perl</a> - your support means a great deal. And to the Perl community: thank you for embracing my first book with such warmth and encouragement. Your enthusiasm continues to inspire me.",
     "Enjoy rest of the newsletter, stay safe and healthy."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "PAGI: ASGI For Perl, or the Spiritual Successor to Plack",
               "author" : "john_napiorkowski",
               "text" : "PAGI (Perl Asynchronous Gateway Interface) is a new specification for async Perl web applications, inspired by Python's ASGI. It supports HTTP, WebSockets, and Server-Sent Events natively, and can wrap existing PSGI applications for backward compatibility.",
               "url" : "https://dev.to/jjn1056/pagi-asgi-for-perl-or-the-spiritual-successor-to-plack-3kb9",
               "ts" : "2025.12.02"
            },
            {
               "title" : "plenv-where",
               "author" : "mikko_koivunalho",
               "text" : "A plenv plugin to show which Perl versions have a particular module.",
               "url" : "https://blogs.perl.org/users/mikko_koivunalho/2025/12/plenv-where.html",
               "ts" : "2025.12.04"
            },
            {
               "title" : "LPW 2025 - Event Report",
               "author" : "mohammad_anwar",
               "text" : "Here is my detailed report of LPW 2025 that includes the slides of my presentation.",
               "url" : "https://theweeklychallenge.org/blog/lpw-2025/",
               "ts" : "2025.12.01"
            },
            {
               "title" : "Living Perl: Building a CNN Image Classifier with AI::MXNet",
               "author" : "marcontk",
               "text" : "This article demonstrates Perl's continued relevance in cutting-edge fields by showcasing integration with MXNet, a major deep learning framework. The ability to build convolutional neural networks (CNNs) in Perl for image classification represents significant technical sophistication.",
               "url" : "https://medium.com/@marcontk/living-perl-building-a-cnn-image-classifier-with-ai-mxnet-d38a0cbebdc6",
               "ts" : "2025.12.02"
            }
         ]
      },
      {
         "title" : "Perl Advent Calendar",
         "entries" : [
            {
               "title" : "The Ghost of Perl Developer Surveys Past, Present, and Future",
               "author" : "rawley_fowler",
               "text" : "The article demonstrates sophisticated understanding of developer tooling ecosystems and community trends. The comparison between 2009-2010 surveys and the 2025 results shows deep insight into how Perl development practices have evolved while maintaining continuity.",
               "url" : "https://perladvent.org/2025/2025-12-01.html",
               "ts" : "2025.12.01"
            },
            {
               "title" : "All I Want for Christmas Is the Right Aspect Ratio",
               "author" : "dave_cross",
               "text" : "The step-by-step progression from simple Perl script to full Docker deployment serves as an excellent tutorial on modern Perl module distribution. It shows how a well-designed module can serve diverse audiences from command-line power users to web developers to DevOps teams.",
               "url" : "https://perladvent.org/2025/2025-12-02.html",
               "ts" : "2025.12.02"
            },
            {
               "title" : "Santa's Secret Music Studio",
               "author" : "gene_boggs",
               "text" : "The step-by-step approach from \"need to identify devices\" to \"controlling a synth\" serves as an excellent mini-tutorial. The mention of related modules (MIDI::RtController, MIDI::RtController::Filter::Tonal) provides helpful pointers for readers wanting to explore further.",
               "url" : "https://perladvent.org/2025/2025-12-03.html",
               "ts" : "2025.12.03"
            },
            {
               "title" : "Stopping the Evil Grinch: A Holiday Defense Guide",
               "author" : "dragos_trif",
               "text" : "This article demonstrates enterprise-grade security automation using Perl as a robust orchestration layer. The solution elegantly combines multiple security tools (Lynis for auditing, ClamAV for malware scanning) with professional email reporting.",
               "url" : "https://perladvent.org/2025/2025-12-04.html",
               "ts" : "2025.12.04"
            },
            {
               "title" : "Santa needs to know about new toys...",
               "author" : "mike_whitaker",
               "text" : "This article successfully teaches professional API integration through storytelling, making technical concepts accessible while demonstrating production-ready Perl code patterns. The holiday theme enhances rather than distracts from the educational content.",
               "url" : "https://perladvent.org/2025/2025-12-05.html",
               "ts" : "2025.12.05"
            },
            {
               "title" : "ToyCo want to push new toy updates",
               "author" : "mike_whitaker",
               "text" : "This article beautifully demonstrates transitioning from a polling-based API client to a webhook-based service - a common and important architectural pattern in modern web development. The scenario of \"crippling ToyCo's servers\" with excessive polling is both realistic and educational.",
               "url" : "https://perladvent.org/2025/2025-12-06.html",
               "ts" : "2025.12.06"
            },
            {
               "title" : "Abstract storage of Christmas letters",
               "author" : "bartosz_jarzyna",
               "text" : "This solution demonstrates sophisticated software design with the strategic use of Storage::Abstract to create a clean abstraction layer between business logic and data storage. The anticipation of changing storage requirements and preemptive abstraction is professional forward-thinking.",
               "url" : "https://perladvent.org/2025/2025-12-07.html",
               "ts" : "2025.12.07"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Special Average\" and \"Arithmetic Progression\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 351",
               "ts" : "2025.12.08",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-351"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Good Substrings\" and \"Shuffle Pairs\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 350",
               "ts" : "2025.12.08",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-350"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "This implementation demonstrates elegant Perl craftsmanship. The good substrings solution is particularly clever, using a regex lookahead to capture all overlapping 3-character substrings in one pass, then filtering to ensure no repeated characters - a beautifully concise one-liner.",
               "title" : "TWC350",
               "ts" : "2025.12.05",
               "url" : "https://deadmarshal.blogspot.com/2025/12/twc350.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The solutions demonstrate strong understanding of both algorithmic thinking and Raku language features. The shuffle pairs solution is particularly clever in its use of canonical forms and early termination conditions.",
               "title" : "The Good Shuffle",
               "ts" : "2025.12.06",
               "url" : "https://raku-musings.com/good-shuffle.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "The Perl implementation demonstrates clean, readable code with thoughtful organization. The good substrings solution uses efficient array slicing and clear manual comparison logic that's easily understandable.",
               "title" : "Good Substring / Shuffle Pairs",
               "ts" : "2025.12.03",
               "url" : "https://dev.to/boblied/pwc-350-good-substring-shuffle-pairs-3gfn"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "This is an exceptionally elegant Perl implementation showcasing expert-level Perl idioms. Both solutions exemplify Perl's philosophy of \"making easy things easy and hard things possible\" with concise, expressive code that solves the problems elegantly without unnecessary complexity.",
               "title" : "Shuffled Strings",
               "ts" : "2025.12.05",
               "url" : "https://github.sommrey.de/the-bears-den/2025/12/05/ch-350.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "This is a comprehensive and impressively diverse implementation across multiple languages and environments. The Raku solutions showcase excellent use of the language's functional features. The PL/Perl implementations are particularly noteworthy for their adaptability to database environments.",
               "title" : "only Perl!",
               "ts" : "2025.12.01",
               "url" : "https://fluca1978.github.io/2025/12/01/PerlWeeklyChallenge350.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This solution stands out for its deep mathematical analysis and optimization. The Task 2 solution demonstrates remarkable theoretical insight by using modular arithmetic with modulo 9 to significantly reduce the search space - achieving a 5.2x speedup is an impressive feat of algorithmic optimization.",
               "title" : "Perl Weekly Challenge 350",
               "ts" : "2025.12.01",
               "url" : "https://wlmb.github.io/2025/12/01/PWC350/"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This solution demonstrates exceptional cross-language programming skills with clean, idiomatic implementations across four different languages (Raku, Perl, Python, Elixir). The consistent algorithmic approach while respecting each language's unique idioms shows deep understanding of multiple programming paradigms.",
               "title" : "Shuffling the Good",
               "ts" : "2025.12.01",
               "url" : "https://packy.dardan.com/b/er"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Both solutions showcase excellent Perl craftsmanship with thoughtful comments, clear variable naming, and robust handling of edge cases. Peter demonstrates both theoretical understanding (mathematical bounds, algorithmic complexity) and practical implementation skills.",
               "title" : "Good pairs",
               "ts" : "2025.12.01",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/350"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "This is a masterclass in professional Perl documentation and code structure. The solutions feature comprehensive POD documentation with clear attribution, problem descriptions, notes, and IO specifications - demonstrating exceptional software engineering practices.",
               "title" : "The Weekly Challenge #350",
               "ts" : "2025.12.04",
               "url" : "https://hatley-software.blogspot.com/2025/12/robbie-hatleys-solutions-in-perl-for.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This solution demonstrates elegant Perl craftsmanship with a particularly clever approach. Using a regex with a lookahead assertion /(?=(...))/g to capture overlapping substrings is an expert-level Perl idiom that showcases deep understanding of the language's regex capabilities.",
               "title" : "A Good Shuffle",
               "ts" : "2025.12.07",
               "url" : "https://blog.firedrake.org/archive/2025/12/The_Weekly_Challenge_350__A_Good_Shuffle.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This solution demonstrates excellent cross-language programming skills with clear parallel implementations in both Python and Perl. The Task 1 solution is elegantly simple - the Python version using set(substr) for uniqueness checking and the Perl version using a hash with early returns showcase appropriate idioms for each language while maintaining the same algorithmic approach.",
               "title" : "Good shuffling",
               "ts" : "2025.12.07",
               "url" : "https://dev.to/simongreennet/weekly-challenge-good-shuffling-3cdj"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2025.48 Advent is Here",
               "ts" : "2025.12.01",
               "url" : "https://rakudoweekly.blog/2025/12/01/2025-48-advent-is-here/"
            }
         ]
      },
      {
         "title" : "Training",
         "entries" : [
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2025/12/dlxxvii-12-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2025/12/dcxx-metacpan-weekly-report.html\">MetaCPAN weekly report</a>.",
              "ts" : "2025.12.06"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
