{
   "date" : "2026-01-05",
   "editor" : "mohammad_anwar",
   "subject" : "New Year Resolution",
   "header" : [
     "Hi there,",
     "<strong>Happy New Year</strong>, everyone (albeit a belated one).",
     "Any New Year's resolutions this time? For me, none. I'm too old for such customs. However, I always have a full plate, which is nice.",
     "Normally, you expect the new year to bring new energy but that rarely happens. Instead you often already feel tired from a busy schedule, gift shopping, and attending parties. How was yours?",
     "I luckily had an extended break this time, so I used it to work on my upcoming book on <strong>DBIx::Class</strong>. I have a habit of getting deep into the skin of a subject, and this time was no different. When I shared updates on social media, I received many positive reviews. One suggestion to add <strong>asynchronous</strong> operation support to <strong>DBIx::Class</strong>. I must admit that before this book, I had barely touched it, although my current work place uses it extensively. In the past, I mostly worked with an in-house ORM written in Perl.",
     "While working on the book, I decided to share my initial draft for supporting async operations in <strong>DBIx::Class</strong> and released <a href=\"https://metacpan.org/dist/DBIx-Class-Async\">DBIx::Class::Async</a> on the first day of 2026. It's still experimental, but I received a few suggestions from big shots, which led to another quick update to address their feedback. I wrote a <a href=\"https://theweeklychallenge.org/blog/dbix-class-async\">blog post</a> to introduce the new creation and am working on another post to discuss further improvements since the initial release. I had hoped to have it ready for this newsletter, but not everything goes according to plan. Never mind - in a couple of days - I will share it with you.",
     "Two major blockers I encountered during my research were <strong>transactions</strong> and <strong>searches with prefetch</strong>. I will continue working on these until I find a satisfactory solution. I also come across another new distribution on the same subject, <a href=\"https://metacpan.org/pod/DBIx::Quick\">DBIx::Quick</a>. I'm happy to see the sudden renewed interest in <strong>ORM</strong> in general.",
     "Today is my first working day of 2026, so I'm very excited. Please share your experiences.",
     "Enjoy rest of the newsletter."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "The Underbar, episode 8",
               "author" : "philippe_bruhat",
               "text" : "As preparations are underway for the Perl Toolchain Summit 2026, this short episode is the last excerpt recorded during PTS 2025 (as a tangent during the CPAN Testers interview, published as episode 6). BooK starts by explaining the selection process for the Perl Toolchain Summit and some of the history, and then Doug, Ruth, Breno and Ferki reminisce about what makes the event so special.",
               "url" : "https://underbar.cpan.io/episodes/8/",
               "ts" : "2025.12.29"
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "App::HTTPThis: the tiny web server I keep reaching for",
               "author" : "dave_cross",
               "text" : "Dave shares his long-time favorite tool for static site work: App::HTTPThis. This Perl module is a friction-free command-line web server that instantly serves any directory over HTTP, perfect for testing links, assets, and real browser behavior without the overhead of Apache or nginx.",
               "url" : "https://perlhacks.com/2026/01/apphttpthis-the-tiny-web-server-i-keep-reaching-for/",
               "ts" : "2026.01.04"
            },
            {
               "title" : "DBIx::Class::Async",
               "author" : "mohammad_anwar",
               "text" : "A gentle tntroduction to DBIx::Class::Async. Please share your suggestions.",
               "url" : "https://theweeklychallenge.org/blog/dbix-class-async",
               "ts" : "2026.01.01"
            },
            {
               "title" : "Episode 9: Perl, the Language That Refuses to Die (And Honestly, Good for It)",
               "author" : "dave_lumai",
               "text" : "A very interesting read, unfortunately it is behind Medium's paywall, marked as members only.",
               "url" : "https://medium.com/@DaveLumAI/episode-9-perl-the-language-that-refuses-to-die-and-honestly-good-for-it-f3b8b5d193e0",
               "ts" : "2026.01.04"
            },
            {
               "title" : "jq-lite: A jq Alternative for Legacy and Restricted Systems",
               "author" : "shingo_kawamura",
               "text" : "jq-lite is a jq-compatible JSON processor written in pure Perl. It is designed for legacy, restricted, and minimal environments where installing jq is not possible.",
               "url" : "https://medium.com/@pannakoota/jq-lite-a-jq-alternative-for-legacy-and-restricted-systems-223d29db69a6",
               "ts" : "2026.01.04"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Thousand Separator\" and \"Mountain Array\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 355",
               "ts" : "2026.01.05.",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-355"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Min Abs Diff\" and \"Shift Grid\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 354",
               "ts" : "2026.01.05.",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-354"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The post showcases excellent problem-solving skills and clear pedagogical explanations. The implemented code for the first challenge and the conceptual solution for the second are both technically sound and well-justified.",
               "title" : "MAD Shift",
               "ts" : "2026.01.02",
               "url" : "https://raku-musings.com/mad-shift.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "This is a competent Perl implementation that demonstrates strong algorithmic thinking, particularly for the grid rotation problem. Jorg shows good understanding of Perl's array manipulation capabilities and mathematical optimisation.",
               "title" : "Shifted Differences",
               "ts" : "2026.01.02",
               "url" : "https://github.sommrey.de/the-bears-den/2026/01/02/ch-354.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "Expert-level PDL implementation that leverages specialized numerical libraries for concise, high-performance solutions. This approach is optimal for numerical computing contexts but requires deep PDL knowledge.",
               "title" : "Perl Weekly Challenge 354",
               "ts" : "2025.12.28",
               "url" : "https://wlmb.github.io/2025/12/28/PWC354/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "Matthias demonstrates both theoretical knowledge (complexity analysis) and practical skill (performance optimisation), making this an exemplary technical solution.",
               "title" : "Min Abs Diff Shift Grid. What??",
               "ts" : "2026.01.04",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-354/challenge-354/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This is a well-written and highly educational post. Packy successfully demonstrates how to solve algorithmic problems using the distinct styles of different programming languages. The solutions are correct, clearly explained, and follow good practices.",
               "title" : "Some Grids",
               "ts" : "2025.12.30",
               "url" : "https://packy.dardan.com/b/gR"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "Peter demonstrates a pragmatic, straightforward approach to solving the weekly challenge #354. The code is clear, functional, and focuses on delivering correct results with minimal complexity.",
               "title" : "Mad numbers and shifty grid",
               "ts" : "2025.12.29",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/354"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "This solution set takes a functional but brute-force approach to the problems. While correct, it prioritizes straightforward implementation over algorithmic optimisation.",
               "title" : "The Weekly Challenge #354",
               "ts" : "2025.12.30",
               "url" : "https://hatley-software.blogspot.com/2025/12/robbie-hatleys-solutions-in-perl-for_30.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This is a sophisticated, well-optimized solution that correctly identifies and implements the most efficient algorithms for both challenges. Roger demonstrates strong understanding of algorithmic complexity and language-specific optimizations.",
               "title" : "Min Grid Diffs the Shift",
               "ts" : "2026.01.04",
               "url" : "https://blog.firedrake.org/archive/2026/01/The_Weekly_Challenge_354__Min_Grid_Diffs_the_Shift.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "High-quality, production-ready solutions with excellent algorithm choices, clean implementations, and thoughtful language-specific optimizations. Simon demonstrates strong command of both algorithmic thinking and practical coding.",
               "title" : "New Year, New Challenges",
               "ts" : "2026.01.02",
               "url" : "https://dev.to/simongreennet/weekly-challenge-new-year-new-challenges-2eab"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2025.52 Release #188 & State of the Onion",
               "ts" : "2025.12.29",
               "url" : "https://rakudoweekly.blog/2025/12/29/2025-52-release-188-state-of-the-onion/"
            }
         ]
      },
      {
         "title" : "Training",
         "entries" : [
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2026/01/dlxxxi-8-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
              "ts" : "2026.01.03"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
