{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "",
               "text" : "We mostly discussed the experimental refaliasing and declared_refs features to see if we can find a path towards declaring at least the latter non-experimental.",
               "title" : "This week in PSC (211) | 2026-01-12",
               "ts" : "2026.01.15",
               "url" : "https://blogs.perl.org/users/psc/2026/01/this-week-in-psc-211-2026-01-12.html"
            },
            {
               "author" : "max_maischein",
               "text" : "Max Maischein announces that CosmoShop, one of the world’s largest pure‑Perl shop systems, is once again sponsoring the German Perl Workshop in 2026, strengthening community support for this key Perl/Raku conference. This continued backing highlights the vibrant ecosystem and industry engagement around Perl events.",
               "title" : "Cosmoshop supports the German Perl Workshop 2026",
               "ts" : "2026.01.18",
               "url" : "https://blogs.perl.org/users/max_maischein/2026/01/cosmoshop-supports-the-german-perl-workshop-2026.html"
            },
            {
               "author" : "bartosz_jarzyna",
               "text" : "The blog announces the beta release of Thunderhorse, a new Perl web framework drawing on lessons from Kelp and built natively on PAGI, with real‑time features like WebSocket and SSE support and a focus on extensibility and high code quality.",
               "title" : "Thunderhorse Beta released!",
               "ts" : "2026.01.18",
               "url" : "https://bbrtj.eu/blog/article/thunderhorse-beta-released"
            },
            {
               "author" : "dave_cross",
               "text" : "Dave Cross has published an archive of slides from his long‑running technical training courses on Perl and other developer topics, going back many years and available for free download. These slide decks offer a valuable resource for anyone wanting concise, well‑structured material from experienced instruction.",
               "title" : "Slide archive: Learn with Dave Cross",
               "ts" : "2026.01.14",
               "url" : "https://learn.davecross.co.uk/slides/"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "gabor_szabo",
               "text" : "One of the best ways to learn is by reading other people's code, making small contributions and getting feedback. That's exactly what we do at these online sessions. The next one taking place on January 24 in a Zoom near you. <a href=\"https://luma.com/perl-maven\">Join us!</a>",
               "title" : "Perl code reading and open source contribution",
               "ts" : "2026.01.19",
               "url" : "https://luma.com/perl-maven"
            }
         ],
         "header" : "A couple of entries sneaked in by Gabor.",
         "title" : "The corner of Gabor"
      },
      {
         "entries" : [
            {
               "author" : "max_maischein",
               "text" : "In his year‑in‑review post, Corion reflects on a productive 2025 by highlighting several useful Perl modules he published, including Text::HTML::Turndown for converting HTML to Markdown and Date::Find for extracting dates from filenames. He also shares a paranoid Mojo::UserAgent extension and contributions to core modules, giving readers insight into both his releases and ongoing development work.",
               "title" : "What I released in 2025",
               "ts" : "2026.01.18",
               "url" : "https://corion.net/blog/2026/01/18/what-i-released-in-2025/"
            },
            {
               "author" : "toby_inkster",
               "text" : "Toby Inkster introduces performance‑boosting extensions to Moose with MooseX::XSAccessor and the new MooseX::XSConstructor, showing significant speedups in object creation and method access. His benchmarks suggest up to ~76 % faster performance using XS‑based accessors and constructors, offering a practical way to accelerate Moose‑based Perl code.",
               "title" : "How can we make this Moose faster?",
               "ts" : "2026.01.17",
               "url" : "https://blogs.perl.org/users/toby_inkster/2026/01/how-can-we-make-this-moose-faster.html"
            },
            {
               "author" : "makoto_nozaki",
               "text" : "Makoto Nozaki takes a clear, numbers‑driven look at The Perl and Raku Foundation’s 2024 financials, showing a significant increase in revenue but expenses that far exceeded income and halved its assets. His breakdown highlights both positive trends in donations and a strong call for greater transparency to ensure the foundation’s long‑term sustainability.",
               "title" : "Understanding TPRF's Finance, 2026 Edition",
               "ts" : "2026.01.13",
               "url" : "https://blogs.perl.org/users/makoto_nozaki/2026/01/understanding-tprfs-finance-2025-edition.html"
            },
            {
               "author" : "dean_hamstead",
               "text" : "Dean celebrates Perl’s improved position in the TIOBE Index during 2025 and highlights the ongoing momentum in the Perl community, from steady releases to vibrant events and tooling support. While acknowledging healthy skepticism about popularity metrics, he encourages readers to \"take the win\" and appreciate the positive signals for Perl’s ecosystem.",
               "title" : "Taking the Win - Perl in the TIOBE Index",
               "ts" : "2026.01.12",
               "url" : "https://blogs.perl.org/users/dean/2026/01/taking-the-win---perl-in-the-tiobe-index.html#comments"
            },
            {
               "author" : "xbill",
               "text" : "William McLean walks through building a minimal Perl‑based MCP (Model Context Protocol) server backed by Firestore, showing how to validate it locally and deploy it to Google Cloud Run using the Gemini CLI. The article highlights practical steps for integrating Perl with modern AI‑oriented workflows beyond the usual Python ecosystem and gives clear pointers for developers looking to experiment with MCP and Cloud Run deployments.",
               "title" : "Firestore MCP Development with Perl, Cloud Run, and Gemini CLI",
               "ts" : "2026.01.18",
               "url" : "https://medium.com/@xbill999/firestore-mcp-development-with-perl-cloud-run-and-gemini-cli-9dee6f0f1b4e"
            },
            {
               "author" : "robert_acock",
               "text" : "Robert explores when traditional arrays fall short and makes a compelling case for using doubly linked lists instead, especially for operations like O(1) insertions and intuitive cursor navigation. Through Perl examples and performance trade‑offs across multiple implementations, from pure Perl to thread‑safe C registries, the article highlights practical data‑structure choices and when they pay off.",
               "title" : "Doubly: Why Arrays Aren't Always Enough",
               "ts" : "2026.01.18",
               "url" : "https://dev.to/lnationorg/doubly-why-arrays-arent-always-enough-ji6"
            },
            {
               "author" : "dave_cross",
               "text" : "The Perl Ad Server makes it easy to promote Perl‑related announcements, from events and podcasts to jobs and newsletters, by embedding a tiny JavaScript snippet that displays rotating banners on your website. It’s simple to style and control, and contributions are welcomed via GitHub for anyone who wants to add or manage ads for the community.",
               "title" : "Perl Ad Server",
               "ts" : "2026.01.18",
               "url" : "https://perl-ads.perlhacks.com/"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "Maintaining Perl 5 Core (Dave Mitchell): December 2025",
               "ts" : "2026.01.14",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_dave_mitchell_december_2025"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "Maintaining Perl (Tony Cook) December 2025",
               "ts" : "2026.01.14",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_tonyc_december_2025"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "PEVANS Core Perl 5: Grant Report for December 2025",
               "ts" : "2026.01.14",
               "url" : "https://news.perlfoundation.org/post/pevans_core_dev_december_2025"
            }
         ],
         "title" : "Grants"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Kaprekar Constant\" and \"Unique Fraction Generator\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 357",
               "ts" : "2026.01.19",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-357"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Kolakoski Sequence\" and \"Who Wins\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 356",
               "ts" : "2026.01.19",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-356"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "The article clearly demonstrates a thoughtful Raku solution to generating the Kolakoski sequence and counting 1s, leveraging Raku’s gather/take constructs for elegant lazy sequence generation. The examples and code comments make the approach easy to understand.",
               "title" : "Kolakoski Wins",
               "ts" : "2026.01.18",
               "url" : "https://raku-musings.com/kolakoski-wins.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "The post delivers a technically clear explanation of both the Kolakoski Sequence and Who Wins tasks with illustrative examples and thoughtful insight into simplifying the problem logic—showcasing an effective balance between correctness and practical Perl coding. The walkthroughs help demystify the challenge specifications and offer useful implementation perspectives for Perl developers.",
               "title" : "Perl Weekly Challenge: Week 356",
               "ts" : "2026.01.18",
               "url" : "https://www.braincells.com/perl/2026/01/perl_weekly_challenge_week_356.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "The post delivers clear, well-structured solutions to both tasks, especially with its concise explanation of generating the Kolakoski sequence and counting elements. The breakdowns and examples make the logic easy to follow and practically useful for coding challenges.",
               "title" : "Self-Generating Games",
               "ts" : "2026.01.16",
               "url" : "https://github.sommrey.de/the-bears-den/2026/01/16/ch-356.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "The post showcases concise and effective Perl implementations for both the Kolakoski‑Sequence and Who‑Wins tasks, with a compact self‑referential sequence generator and a structured playoff progression model. The code is thoughtfully organised and demonstrates practical mastery of sequence construction and game logic within Perl’s syntax.",
               "title" : "Perl Weekly Challenge 356",
               "ts" : "2026.01.12",
               "url" : "https://wlmb.github.io/2026/01/12/PWC356/"
            },
            {
               "author" : "marc_perry",
               "tags" : [],
               "text" : "The post offers a thoughtful, well-commented Perl exploration of the Kolakoski sequence that breaks down the generation logic with clear analogies and illustrative code, making the algorithm approachable even for those new to the concept. Its lively explanation paired with working examples enhances understanding and practical problem-solving.",
               "title" : "Kolakoski called, he wants his sequence back(!)",
               "ts" : "2026.01.18",
               "url" : "https://awesomepowerofgenetics.blogspot.com/2026_01_18_archive.html#7775749283884135379"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "The write-up presents a thoughtful multilingual exploration of the Kolakoski challenge with clear logic and practical code that demonstrates command over sequence generation and problem constraints, making it both accessible and instructive. Packy’s commentary and stepwise approach enhance readability and offer valuable insights for anyone tackling the Weekly Challenge tasks.",
               "title" : "Who’s Kolakoski?",
               "ts" : "2026.01.15",
               "url" : "https://packy.dardan.com/b/hV"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "The post provides a clear, well-reasoned implementation of both tasks, with the Kolakoski solution closely following the Wikipedia algorithm and demonstrating impressive performance at scale. The NFL playoff logic is neatly modeled with concise Perl code, showing careful handling of seeding, sorting, and edge cases in a readable and maintainable way.",
               "title" : "Sequence and consequence",
               "ts" : "2026.01.12",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/356"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "The post offers clear, well-structured Perl solutions for both the Kolakoski sequence and \"Who Wins\" tasks, closely following the problem definitions with readable logic and solid use of Perl idioms. The explanations make the algorithms accessible while the included references help ground the implementation in established techniques.",
               "title" : "The Weekly Challenge #356",
               "ts" : "2026.01.18",
               "url" : "https://hatley-software.blogspot.com/2026/01/robbie-hatleys-solutions-in-perl-for_18.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "The post presents elegant and thoughtfully implemented solutions to both tasks, with the Kolakoski sequence logic clearly articulated and efficiently expressed in Raku. The playoff \"Who Wins\" solution demonstrates solid handling of round progression and seed logic, showcasing clean algorithm design and practical Rust usage.",
               "title" : "Kolakoski Wins",
               "ts" : "2026.01.18",
               "url" : "https://blog.firedrake.org/archive/2026/01/The_Weekly_Challenge_356__Kolakoski_Wins.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "The write-up delivers concise and effective Python solutions for both the Kolakoski Sequence and Who Wins tasks, with a clever analytical shortcut for the sequence count and a clean stepwise modeling of the playoff progression. The inclusion of examples and clear logic makes the implementations easy to follow and practically useful.",
               "title" : "Winning sequence",
               "ts" : "2026.01.13",
               "url" : "https://dev.to/simongreennet/weekly-challenge-winning-sequence-3eic"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2026.02 Resolutions",
               "ts" : "2026.01.12",
               "url" : "https://rakudoweekly.blog/2026/01/12/2026-02-resolutions/"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2026/01/dlxxxiii-9-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2026/01/dcxxii-metacpan-weekly-report-marlin.html\">MetaCPAN weekly report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2026.01.18",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "begin" : "2026-01-24T20:00:00+02:00",
               "text" : "January 24, 2025",
               "title" : "Perl Maven online: Live Open Source contribution",
               "url" : "https://luma.com/perl-maven"
            },
            {
               "begin" : "2026-02-10T19:00:00-05:00",
               "text" : "February 10, 2025",
               "title" : "Boston.pm - online",
               "url" : "https://mobilizon.us/search?search=Boston+Perl"
            },
            {
               "begin" : "2026-03-16T08:00:00+01:00",
               "text" : "March 16-18, 2025",
               "title" : "German Perl/Raku Workshop 2026 in Berlin",
               "url" : "https://act.yapc.eu/gpw2026/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2026-01-19",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there,",
      "<strong>Perl</strong> continues to show remarkable momentum in early 2026, with Dean highlighting the language's improved position in the <strong>TIOBE Index</strong>, signaling renewed attention and ongoing relevance. This renewed visibility is supported by active development and innovative tooling, from <strong>Toby Inkster</strong>'s performance-boosting <strong>Moose</strong> extensions to <strong>William McLean</strong>'s demonstration of deploying Perl MCP servers on Cloud Run.",
      "Community and ecosystem engagement remain strong, as seen with <strong>CosmoShop</strong> sponsoring the <strong>German Perl Workshop</strong> and the launch of the <strong>Thunderhorse</strong> web framework beta, offering modern features like WebSockets and SSE. Open-source contributions continue to thrive, exemplified by <strong>Corion</strong>'s 2025 module releases and <strong>Robert Acock</strong>'s work on practical data structures, helping developers build efficient, real-world applications.",
      "The Perl community also places emphasis on knowledge-sharing and accessibility. <strong>Dave Cross</strong>'s slide archives provide a wealth of training resources, while the <strong>Perl Ad Server</strong> enables easy promotion of community events, jobs, and podcasts, strengthening connections across the ecosystem.",
      "Finally, discussions within the <strong>Perl Steering Council</strong>, such as those on experimental features like refaliasing and declared_refs, demonstrate ongoing efforts to evolve the language responsibly. Alongside a growing focus on transparency and sustainability, as highlighted in <strong>Makoto Nozaki</strong>'s financial analysis of TPRF, these developments show a community that balances innovation, support, and stewardship.",
      "Stay positive and healthy, enjoy rest of the newsletter."
   ],
   "subject" : "Perl in 2026"
}
