{
   "date" : "2026-02-02",
   "editor" : "mohammad_anwar",
   "subject" : "PTS 2026",
   "header" : [
     "Hi there,",
     "The upcoming Perl Toolchain Summit (PTS) in Vienna is more than just a conference, it's an important event at which to maintain, discuss, and improve on the CPAN toolchain, which is the fundamental foundation of the Perl ecosystem. Through their commitment to volunteerism, the volunteers who attend this gathering can provide significant amounts of personal time and expertise towards supporting the efforts of others in the Perl community, benefiting every single person and company that utilises Perl.",
     "A recent <a href=\"https://blogs.perl.org/users/book/2026/01/a-new-sponsorship-model.html\">article</a> by <strong>Philippe Bruhat</strong> reports on the true cost associated with collaborating to support the PTS. The article provides a new paradigm for companies wanting to provide sponsorship for their employees who will be attending on paid time: consider \"paying it forward\". Estimate the cost of your employee's participation and provide that amount to the PTS in the form of a monetary sponsorship. By doing this simple action of doubling your company's investment, your company will directly provide the funding for another deserving attendee of the PTS to benefit as well, thus increasing the overall impact of the PTS.",
     "This proposed model transforms how a company supports the employee(s) attending, creating a ripple effect through the Perl community by providing additional funding to support a more diverse, larger pool of contributors, which will serve to support the continued viability and innovation of the tools that are relied upon by everyone within the community, regardless of whether or not they attend the PTS.",
     "This isn't simply charity, it's a wise business strategy for investing in the foundation of the Perl community. Through \"pay it forward\" sponsorship opportunities, companies have access to those developing the guidelines for developing and supporting the future of Perl. This creates visibility for them as true community supporters while helping the PTS remain the innovative, viable engine that brings Perl into a current competitive position. Let's continue to support all those that also support us.",
     "Last year, I was lucky enough to attend the event as I received a surprise invitation by the organisers. From this experience, I can say it was the best of all Perl events I have been to. Contributing in any small way was a great feeling and made it worthwhile. One of the highlights was observing how committed all the top individuals in the Perl community were. They worked together on multiple projects simultaneously, with maximum efficiency, to achieve all that they could during the event.",
     "Keep your spirits up and stay healthy. Enjoy rest of the newsletter."
   ],
   "footer" : [
   ],
   "chapters" : [
      {
         "title" : "Sponsors",
         "sponsor" : 1,
         "entries" : [
         ]
      },
      {
         "title" : "Announcements",
         "entries" : [
            {
               "title" : "Sydney February Meeting! 2025",
               "author" : "dean_hamstead",
               "text" : "Sydney Perl continues regular meetings with our next in February",
               "url" : "https://blogs.perl.org/users/dean/2026/02/sydney-february-meeting-2025.html",
               "ts" : "2026.02.01"
            },
            {
               "title" : "This week in PSC (213) | 2026-01-26",
               "author" : "",
               "text" : "Perl Steering Council, discussing topics like improvements to Perl's random number generator and integrating TLS functionality into the core.",
               "url" : "https://blogs.perl.org/users/psc/2026/01/this-week-in-psc-213-2026-01-26.html",
               "ts" : "2026.01.26"
            },
            {
               "title" : "A new sponsorship model",
               "author" : "philippe_bruhat",
               "text" : "A new sponsorship model for the 2026 Perl Toolchain Summit. It encourages employers sending staff to the event to \"pay it forward\" by also providing monetary sponsorship to help cover costs for other attendees.",
               "url" : "https://blogs.perl.org/users/book/2026/01/a-new-sponsorship-model.html",
               "ts" : "2026.01.31"
            },
            {
               "title" : "ANNOUNCE: Perl.Wiki V 1.39 & Mojolicious.Wiki V 1.13",
               "author" : "ron_savage",
               "text" : "",
               "url" : "https://blogs.perl.org/users/ron_savage/2026/02/announce-perlwiki-v-139-mojoliciouswiki-v-113.html",
               "ts" : "2026.02.01"
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "What I learned from being an editor/reviewer for the 2025 Perl Advent Calendar",
               "author" : "marc_perry",
               "text" : "Marc contemplates on having a wonderful experience reviewing for the Perl Advent Calendar 2025. He noted that through writing and editing articles about other peoples' articles and writing with CPAN, he learned about many new things (CPAN modules) as well as found renewed interest in various community activities such as The Weekly Perl Challenge.",
               "url" : "https://dev.to/marc_perry_be3c8ed5989a1b/what-i-learned-from-being-an-editorreviewer-for-the-2025-perl-advent-calendar-2bk9",
               "ts" : "2026.01.30"
            },
            {
               "title" : "Lock and unlock hash using Hash::Util",
               "author" : "gabor_szabo",
               "text" : "The post demonstrates how to use the Hash::Util module's lock_hash function in Perl to prevent accidental modifications to a hash, protecting it from changes, deletions, or new key additions. By unlocking the hash with unlock_hash, the program regains the ability to modify its structure, which is shown with practical code examples.",
               "url" : "https://perlmaven.com/lock-and-unlock-hash",
               "ts" : "2026.01.28"
            },
            {
               "title" : "Podlite comes to Perl: a lightweight block-based markup language for everyday use",
               "author" : "aliaksandr_zahatski",
               "text" : "The article introduces Podlite, a new lightweight, block-based markup language that brings the readability and structure of Raku's documentation format (Pod) to the Perl ecosystem. It highlights how Podlite offers three interchangeable block styles for writing documentation within Perl code and announces its arrival via a CPAN module, positioning it as a modern tool for everyday use.",
               "url" : "https://www.perl.com/article/podlite-comes-to-perl-a-lightweight-block-based-markup-language-for-everyday-use/",
               "ts" : "2026.01.27"
            }
         ]
      },
      {
         "title" : "The Weekly Challenge",
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Digital Root\" and \"String Reduction\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 359",
               "ts" : "2026.02.02",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-359"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Max Str Value\" and \"Encrypted String\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 358",
               "ts" : "2026.02.02",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-358"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "In addition to providing an intuitive method of handling both numeric and non-numeric strings, this solution illustrates Raku's syntax for implementing pattern matching and type-converting through the use of cleanly written code.",
               "title" : "/Stringed Max",
               "ts" : "2026.01.31",
               "url" : "https://raku-musings.com/stringed-max.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "Jaldhar is using both Raku and Perl versions in order to demonstrate an accurate solution and make the language-specific optimizations (e.g., using map and the modulo operator) obvious by showing how he was able to arrive at a practical solution in one line of code.",
               "title" : "Perl Weekly Challenge: Week 358",
               "ts" : "2026.02.01",
               "url" : "https://www.braincells.com/perl/2026/02/perl_weekly_challenge_week_358.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "An in-depth study of technical solutions where unique implementations are provided for both Perl as well as J. Jorg used sophisticated methods, such as the String::Compile::Tr module, to translate from one programming language to another at runtime and explores more unusual 'under' conjunctions in J.",
               "title" : "Maximum Encryption",
               "ts" : "2026.01.30",
               "url" : "https://github.sommrey.de/the-bears-den/2026/01/30/ch-358.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "Explicitly calling methods such as \"brute force\", Luca particularly favours a try-catch approach (as in Java and Python) for converting strings into integers. This method is an interesting and practical alternative to the regular expression check that most people use.",
               "title" : "using brute force!",
               "ts" : "2026.01.26",
               "url" : "https://fluca1978.github.io/2026/01/26/PerlWeeklyChallenge358.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This blog post offers a concise and efficient one-liner approach to both tasks of Weekly Challenge 358, with a particular focus on Perl's command-line capabilities.",
               "title" : "Perl Weekly Challenge 358",
               "ts" : "2026.01.26",
               "url" : "https://wlmb.github.io/2026/01/26/PWC358/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "Matthias Muth's solutions are exemplary for their elegant use of Perl's functional features and their practical robustness. They achieve maximum effect with minimal code, a hallmark of expert Perl programming.",
               "title" : "nbyqyyefswbuffyhay",
               "ts" : "2026.02.01",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-358/challenge-358/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "This solution from Packy is both distinctive and highly educational. It provides a fantastic comparative study across four languages (Raku, Perl, Python, and Elixir), showcasing how to solve the same problems with each language's unique idioms and strengths. The author's thoughtful explanations make it a great learning resource.",
               "title" : "It’s What You Value",
               "ts" : "2026.01.27",
               "url" : "https://packy.dardan.com/b/iJ"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "This approach places emphasis on clarity, detail, and practical (real-life) use of the code to solve the problem at hand as opposed to using clever short phrases (i.e., making it well-engineered). An example of properly designed, production focused,",
               "title" : "A number of strings",
               "ts" : "2026.01.26",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/358"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "Robbie Hatley's Perl provided an easy to follow solution which employed procedural programming techniques for the two tasks. The approach is reasonable and aligns closely with the specifications given in the problem statement.",
               "title" : "The Weekly Challenge #358",
               "ts" : "2026.01.30",
               "url" : "https://hatley-software.blogspot.com/2026/01/robbie-hatleys-solutions-in-perl-for_30.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "The practical programming method and mathematically careful design are what makes this solution stand out. It puts its emphasis on correctness and safety and places particular emphasis on how the modulo function and character encodings are handled; therefore, it is a well-thought-out and robust implementation.",
               "title" : "Encrypted Max",
               "ts" : "2026.02.01",
               "url" : "https://blog.firedrake.org/archive/2026/02/The_Weekly_Challenge_358__Encrypted_Max.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "Simon Green's solutions stand out for their practical efficiency, clear idiomatic code, and a smart pre-computation strategy that differentiates them from the more common inline calculation methods.",
               "title" : "Maximum Encryption",
               "ts" : "2026.01.27",
               "url" : "https://dev.to/simongreennet/weekly-challenge-maximum-encryption-49a8"
            },
            {
               "author" : "vinod_kumar_k",
               "tags" : [],
               "text" : "The main factor separating this solution from others is its pedagogical quality, not the code itself. The explanation of how the algorithms (digit validation, ASCII rotation) work is clear, and demonstrates Perl's suitability for these types of tasks. Additionally, this solution emphasizes the importance of writing testable code, which provides valuable insight.",
               "title" : "When Strings Become Numbers and Letters Start Shifting",
               "ts" : "2026.02.01",
               "url" : "https://dev.to/vinodk89/perl-weekly-challenge-358-when-strings-become-numbers-and-letters-start-shifting-j84"
            }
         ]
      },
      {
         "title" : "Perl Tutorial",
         "header" : "A section for newbies and for people who need some refreshing of their Perl knowledge. If you have questions or suggestions about the articles, let me know and I'll try to make the necessary changes. The included articles are from the <a href=\"https://perlmaven.com/perl-tutorial\">Perl Maven Tutorial</a> and are part of the <a href=\"https://leanpub.com/perl-maven\">Perl Maven eBook</a>.",
         "entries" : [
         ]
      },
      {
         "title" : "Rakudo",
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2026.04 Hello, Goodbye",
               "ts" : "2026.01.26",
               "url" : "https://rakudoweekly.blog/2026/01/26/2026-04-hello-goodbye/"
            }
         ]
      },
      {
         "title" : "Training",
         "entries" : [
         ]
      },
      {
         "title" : "Weekly collections",
         "entries" : [
            {
              "title" : "NICEPERL's lists",
              "author" : "miguel_prz",
              "url" : "http://niceperl.blogspot.com/",
              "text" : "<a href=\"https://niceperl.blogspot.com/2026/01/dlxxxv-14-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
              "ts" : "2026.01.31"
            }
         ]
      },
      {
         "title" : "The corner of Gabor",
         "header" : "A couple of entries sneaked in by Gabor.",
         "entries" : [
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
