{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "text" : "Known for its real‑time web capabilities, Mojo seemed like the perfect framework to experiment with WebSockets. What better way to test it than building a live chat room?",
               "title" : "Mojo with WebSocket",
               "ts" : "2026.02.07",
               "url" : "https://theweeklychallenge.org/blog/mojo-with-websocket/"
            },
            {
               "author" : "laurent_dami",
               "text" : "BLOCK : sequence of statements;  Lexical scope; Lexical scopes in Python are not like Perl; Lexical variables; Shadowing variables from higher scopes; Lexical pragmata",
               "title" : "Beautiful Perl feature: BLOCKs",
               "ts" : "2026.02.07",
               "url" : "https://dev.to/damil/beautiful-perl-feature-blocks-2o4"
            },
            {
               "author" : "laurent_dami",
               "text" : "Expressiveness of the Perl programming language. Perl vs other languages : Compare facts, not opinions.",
               "title" : "Beautiful Perl features - introduction to the series",
               "ts" : "2026.02.07",
               "url" : "https://dev.to/damil/beautiful-perl-features-introduction-to-the-series-b6a"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "",
               "title" : "Dancer2 + Dancer2::Plugin::DBIC::Async + HTMX",
               "ts" : "2026.02.05",
               "url" : "https://theweeklychallenge.org/blog/dancer2-dbic-async-htmx/"
            },
            {
               "author" : "",
               "text" : "",
               "title" : "Building a Solana Telemetry Engine with Perl 5.42 (AnyEvent, SQLite WAL)",
               "ts" : "2026.02.05",
               "url" : "https://www.reddit.com/r/perl/comments/1qwzhc6/building_a_solana_telemetry_engine_with_perl_542/"
            },
            {
               "author" : "olaf_alders",
               "text" : "",
               "title" : "Fastmail Donates USD 10,000 to The Perl and Raku Foundation",
               "ts" : "2026.02",
               "url" : "https://www.perl.com/article/fastmail-donates-usd-10-000-to-the-perl-and-raku-foundation/"
            },
            {
               "author" : "olaf_alders",
               "text" : "'Perl is my cast-iron pan - reliable, versatile, durable, and continues to be ever so useful.'",
               "title" : "Cast-Iron Community: Your Chance to Sponsor TPRC 2026",
               "ts" : "2026.02.",
               "url" : "https://www.perl.com/article/cast-iron-community-your-chance-to-sponsor-tprc-2026/"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "Beginner struggling with quotes",
               "ts" : "2026.02.03",
               "url" : "https://www.reddit.com/r/perl/comments/1qwkx82/beginner_struggling_with_quotes/"
            },
            {
               "author" : "",
               "text" : "It is more like a questionnaire, but you can discuss the answers.",
               "title" : "A day in the life with Perl",
               "ts" : "2026.02.03",
               "url" : "https://www.reddit.com/r/perl/comments/1qv88wv/a_day_in_the_life_with_perl/"
            },
            {
               "author" : "",
               "text" : "Would you like to have a tool that would look at your code-base and generate a perltidy configuration file that matches it?",
               "title" : "Auto format detection with perfidy anyone?",
               "ts" : "2026.02.09",
               "url" : "https://www.reddit.com/r/perl/comments/1qzq3am/auto_format_detection_with_perfidy_anyone/"
            }
         ],
         "title" : "Discussion"
      },
      {
         "entries" : [
            {
               "author" : "gabor_szabo",
               "text" : "Starting from December I organizer online events where we contribute to open source projects. This report is about the Perl-related contributions in January. BTW the next event is tomorrow. Sign up <a href=\"https://luma.com/perl-maven\">here</a>",
               "title" : "OSDC Perl 2026.01 report",
               "ts" : "2026.02.09",
               "url" : "https://szabgab.com/osdc-perl-2026-01"
            }
         ],
         "title" : "CPAN"
      },
      {
         "entries" : [
            {
               "author" : "dave_mitchell",
               "text" : "'During January, I finished working on another tranche of ExtUtils::ParseXS fixups.'",
               "title" : "Maintaining Perl 5 Core (Dave Mitchell): January 2026",
               "ts" : "2026.02.07",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_dave_mitchell_january_2026"
            },
            {
               "author" : "tony_cook",
               "text" : "",
               "title" : "Maintaining Perl (Tony Cook) January 2026",
               "ts" : "2026.02.07",
               "url" : "https://news.perlfoundation.org/post/maintaining_perl_tonyc_january_2026"
            },
            {
               "author" : "paul_evans",
               "text" : "This month I managed to finish off a few refalias-related issues, as well as lend some time to help BooK further progress implementing PPC0014.",
               "title" : "PEVANS Core Perl 5: Grant Report for January 2026",
               "ts" : "2026.02.07",
               "url" : "https://news.perlfoundation.org/post/pevans_core_dev_january_2026"
            }
         ],
         "title" : "Grants"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "",
               "title" : "This week in PSC (214) | 2026-02-02",
               "ts" : "2026.02",
               "url" : "https://blogs.perl.org/users/psc/2026/02/this-week-in-psc-213-2026-02-02.html"
            }
         ],
         "title" : "Perl"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Text Justifier\" and \"Word Sorter\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 360",
               "ts" : "2026.02.09",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-360"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Digital Root\" and \"String Reduction\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 359",
               "ts" : "2026.02.09",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-359"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "Using the power of Perl's capabilities, the provided solution provides an elegant solution to each of the two TWC359 challenges. Task 1 makes efficient use of a concise while loop to compute digital roots and persistence in less median time than most standard solutions would yield. In Task 2, you can see how the use of Perl's global regex substitution provides a very simple way to remove duplicate entries in adjacent positions with just one line of code. From a code implementation point of view, this solution exemplifies what a professional Perl implementation of both tasks would look like.",
               "title" : "TWC359",
               "ts" : "2026.02.08",
               "url" : "https://deadmarshal.blogspot.com/2026/02/twc359.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "This article provides two elegant solutions for the Raku programming language, which illustrate both Raku's clean syntax as well as the practical application of Raku's features. The digital root implementation uses method chaining features of Raku's expressive method chaining. The string reduction solution demonstrates how to use the regular expression and substitution features of Raku efficiently. There are verbose modes for both of these solutions that allow for an easy-to-follow, step-wise transformation of the result.",
               "title" : "Root Reduction",
               "ts" : "2026.02.07",
               "url" : "https://raku-musings.com/root-reduction.html"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "The answer presented here provides two great results for the TWC359 problems; both are simple and elegant solutions. The calculation for the digital root solution is driven through the length of the $root (using while length($root) > 1); it is a clever way to leverage counting of the number of persistence and summing all the digits to reduce their overall size into a single digit (the digital root). The string reduction solution is noteworthy due to the way that it has been written in a single line in Perl and uses regex to efficiently match and remove patterns.",
               "title" : "Perl Weekly Challenge: Week 359",
               "ts" : "2026.02.08",
               "url" : "https://www.braincells.com/perl/2026/02/perl_weekly_challenge_week_359.html"
            },
            {
               "author" : "jorg_sommrey",
               "tags" : [],
               "text" : "Task 1, Digital Root, uses a Perl implementation with the Math::Prime::Util's todigits and vecsum to effectively calculate roots of various number bases with great efficiency, along with an alternative J solution using the \"Fold Single\" conjunction for passing through each digit to compute its persistence. Task 2, String Reduction, solutions illustrate a similar range of concise processing with one-line Perl implementations. The J solution had a completely different approach using generalized run-length encoding to implement an algorithm that would work on any type of input.",
               "title" : "Reduced Roots",
               "ts" : "2026.02.06",
               "url" : "https://github.sommrey.de/the-bears-den/2026/02/06/ch-359.html"
            },
            {
               "author" : "luca_ferrari",
               "tags" : [],
               "text" : "A robust method has been found for addressing both TWC359 issues and demonstrates a high degree of clean and streamlined implementations across several languages. The explanation of how to calculate the digital root includes two approaches: the first uses the Raku code $root.Str.comb.map (*.Int) and the Perl code split //, $root, to break the digits apart; and the second uses a simple while loop to determine the number of times that digit root has been calculated. The implementation for string reduction demonstrates how well regular expressions can be utilized using the compact pattern s:g/ (.) $0 // in Raku and the approximately identical implementation in Perl, thus removing all adjacent duplicate characters in just one pass.",
               "title" : "quick and dirty!",
               "ts" : "2026.02.06",
               "url" : "https://fluca1978.github.io/2026/02/06/PerlWeeklyChallenge359.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This article provides ready-to-use versions of the Digital Root and String Reduction programs written in Perl, including a concise example showing what the results should look like. It uses clear, idiomatic programming style while giving short, simple explanations that will help anyone to understand how to implement an additive persistence and regex based string reduction algorithm.",
               "title" : "Perl Weekly Challenge 359",
               "ts" : "2026.02.02",
               "url" : "https://wlmb.github.io/2026/02/02/PWC359/"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "This clean and clever solution combines methods for both problems into one very helpful implementation. In the first case, digit summation and computing the persistent product were both implemented as a clear, fully-documented do...while construct. In the second case, there is an efficient method of removing all the nested duplicates with a do...while loop while providing an excellent explanation of loop semantics and Perl idioms. The detailed comments for each loop's semantics and the use of Perl idioms give a worthwhile educational opportunity.",
               "title" : "Loops Considered",
               "ts" : "2026.02.08",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-359/challenge-359/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "The post examines TWC359 comprehensively and insightfully via 4 programming languages (Recursive & Iterative Solutions). They show their vast knowledge of specific Languages through examples such as; Elixir using Integer.digits(), Raku displaying its fully typed nature, Perl's idiomatic approach with sum-split//, and generator expressions found in Python. The string reduction implementations use regular expressions extensively to reduce complexity and improve performance; especially with regards to the subtle differences between how each implement backreferences and substitutions.",
               "title" : "Root It All You Reduce",
               "ts" : "2026.02.03",
               "url" : "https://packy.dardan.com/b/ia"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "This approach is a good example of intentional design and practical implementation. The approach to handling very large integer strings uses the digital root function; the string reduction uses a simple loop. Peter also considers edge cases, such as case insensitivity and non-Latin alphabets, which will improve the overall usability and applicability in the real world.",
               "title" : "Persistent reduction",
               "ts" : "2026.02.02",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/359"
            },
            {
               "author" : "robbie_hatley",
               "tags" : [],
               "text" : "These two tasks were solved cleanly by providing clear context for each task with examples demonstrating how the tasks could be solved using idiomatic features of Perl 5.36. The logic used for both tasks can be easily read, and uses the core modules in a logical manner. Each task contains inline comments that describe what is being done and make it easy to follow. The backtracking method of solving the string reduction task using split is a particularly clever and efficient way of achieving a solution to the task.",
               "title" : "The Weekly Challenge #359",
               "ts" : "2026.02.04",
               "url" : "https://hatley-software.blogspot.com/2026/02/robbie-hatleys-solutions-in-perl-for.html"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This blog post clearly presents The Weekly Challenge #359 - Roots and Digits (Digital root task). It is a very clean write-up making use of Raku code and does not use extraneous conversion methods. The attention to algorithm and cross-language consistency creates a very good resource for other participants in the challenge and is an excellent technical overview.",
               "title" : "Roots and Digits",
               "ts" : "2026.02.08",
               "url" : "https://blog.firedrake.org/archive/2026/02/The_Weekly_Challenge_359__Roots_and_Digits.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "Both parts of The Weekly Challenge #359 are clearly explained, with detailed explanations of the logic behind the solutions and concrete examples to help you understand how each solution works, in either Python or Perl. By providing a solution in both Python and Perl, Simon is able to reach a broader audience by explaining how the digital root and string reduction algorithms work.",
               "title" : "Digital reduction",
               "ts" : "2026.02.02",
               "url" : "https://dev.to/simongreennet/weekly-challenge-digital-reduction-1aci"
            },
            {
               "author" : "yitzchak_scott_thoennes",
               "tags" : [],
               "text" : "In this article, you can find an excellent and easily read comparison of how each of Go, Python and Perl treats returning multiple values from a function, with good examples for each and some commentary on why certain designs are idiomatically preferred in each language, as well as why to use a structured return (structure, tuple, etc.) instead of returning the multiple values returned naked. Overall, this article is a very technically sound and informative read for anyone interested in designing a function across different languages.",
               "title" : "I Contain Multitudes",
               "ts" : "2026.02.08",
               "url" : "https://blog.ysth.info/i-contain-multitudes-returning-multiple-values-in-go-python-and-perl/"
            },
            {
               "author" : "yitzchak_scott_thoennes",
               "tags" : [],
               "text" : "This article compares three elegant methods for the string reduction problem. The methods are presented in three different programming languages: Perl (using regular expressions), Python (using recursive regular expressions), and Go (using a stack-based algorithm). Each method has been chosen to demonstrate the strengths of the respective programming language.",
               "title" : "Return to Sender",
               "ts" : "2026.02.05",
               "url" : "https://blog.ysth.info/return-to-sender-rejecting-letters-three-different-ways-weekly-challenge-359-part-2/"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2026/02/dlxxxvi-10-great-cpan-modules-released.html\">Great CPAN modules released last week</a>;<br><a href=\"https://niceperl.blogspot.com/2026/02/dcxxiv-metacpan-weekly-report-xsjit.html\">MetaCPAN weekly report</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2026.02.07",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "Join the Perl Maven chat group on WhatsApp!",
               "title" : "WhatsApp",
               "ts" : "2026.02.02",
               "url" : "https://chat.whatsapp.com/LRrkZsSRDvGLLwppyLnKHy"
            },
            {
               "author" : "",
               "text" : "Join the Perl Maven chat group on Telegram!",
               "title" : "Telegram",
               "ts" : "2026.02.02",
               "url" : "https://t.me/PerlMaven"
            }
         ],
         "title" : "Chat about Perl"
      },
      {
         "entries" : [
            {
               "begin" : "2026-02-10T20:00:00+02:00",
               "text" : "February 10, 2025",
               "title" : "Perl Maven online: Code-reading and Open Source contribution",
               "url" : "https://luma.com/perl-maven"
            },
            {
               "begin" : "2026-02-10T19:00:00-05:00",
               "text" : "February 10, 2025",
               "title" : "Boston.pm - online",
               "url" : "https://mobilizon.us/search?search=Boston+Perl"
            },
            {
               "begin" : "2026-02-11T20:00:00+01:00",
               "text" : "February 11, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2026-03-11T20:00:00+01:00",
               "text" : "March 11, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2026-03-16T08:00:00+01:00",
               "text" : "March 16-18, 2025",
               "title" : "German Perl/Raku Workshop 2026 in Berlin",
               "url" : "https://act.yapc.eu/gpw2026/"
            },
            {
               "begin" : "2026-06-26",
               "text" : "June 26-29, 2026, Greenville, SC, USA",
               "title" : "The Perl and Raku Conference 2026",
               "url" : "https://tprc.us/tprc-2026-gsp/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2026-02-09",
   "editor" : "gabor_szabo",
   "footer" : [],
   "header" : [
      "Hi there!",
      "6 years ago we had an edition in which I wrote a bit about <a href=\"https://perlweekly.com/archive/457.html\">Perl on LinkedIn</a>. Back then I collected some basic stats about the Perl groups on LinkedIn. I checked them again: The <a href=\"https://www.linkedin.com/groups/40830/\">Perl Mongers</a> group has 7,635 members (down from 8,283). The <a href=\"https://www.linkedin.com/groups/3686926/\">Perl Developer</a> group has 3,587 members (up from 3,122). There is also a group called <a href=\"https://www.linkedin.com/groups/106254/\">Perl</a> with 18,994 that I apparently forgot to mention the last time.",
      "Besides those groups there is also the <a href=\"https://www.linkedin.com/showcase/perl-maven/\">Perl Maven</a> page I maintain with 845 followers and <a href=\"https://www.linkedin.com/in/szabgab/\">my own personal page</a> with 5,998 followers.",
      "Even if you don't use LinkedIn on a daily basis I'd like to invite you to send a <a href=\"https://www.linkedin.com/in/szabgab/\">connect request to me</a>. That way I'll have a better chance knowing who are the readers of the Perl Weekly.",
      "Also a reminder that tomorrow we'll have another session of the <a href=\"https://luma.com/perl-maven\">Online Perl code-reading an open source contribution</a> and not long after that there will be meeting of the <a href=\"https://mobilizon.us/search?search=Boston+Perl\">Boston Perl Mongers</a>",
      "Enjoy your week!"
   ],
   "subject" : "Perl on LinkedIn"
}
