{
   "chapters" : [
      {
         "entries" : [
            {
               "author" : "ruth_bavousett",
               "text" : "It’s great to see the announcement for The Perl and Raku Conference 2026 (TPRC) taking shape, with registration opening and plans underway for a vibrant community gathering in Greenville, SC this June. The post reinforces the value of bringing Perl and Raku developers together for talks, workshops, and networking. A highlight on the opensource calendar that strengthens the ecosystem and connects contributors across projects.",
               "title" : "Join us for TPRC 2026 in Greenville, SC!",
               "ts" : "2026.02.13",
               "url" : "https://news.perlfoundation.org/post/tprc-2026-gsp-announce"
            },
            {
               "author" : "",
               "text" : "In This week in PSC 215, the Perl Steering Council covered a deep discussion around legal identifier name restrictions for security without reaching consensus and planning to broaden the conversation beyond p5p, tackled the challenge of an absent maintainer for the dual‑life Encode module, and decided to hold off on merging larger PRs like magic v2 and attributes v2 due to the upcoming freeze in this release cycle. These updates give a clear snapshot of ongoing governance and core maintenance decisions within the Perl project.",
               "title" : "This week in PSC (215) | 2026-02-11",
               "ts" : "2026.02.11",
               "url" : "https://blogs.perl.org/users/psc/2026/02/this-week-in-psc-215-2026-02-11.html"
            }
         ],
         "title" : "Announcements"
      },
      {
         "entries" : [
            {
               "author" : "saif_ahmed",
               "text" : "The post reflects on the challenge of rational decision‑making with a quirky, human‑centred anecdote, weaving in the idea that structured data models, like decision trees, can help bring objectivity to complex choices. The post’s blend of storytelling and commentary on data structures adds a thoughtful and entertaining perspective for programmers thinking about reasoning and modeling in code.",
               "title" : "Poplar Decisions",
               "ts" : "2026.02.08",
               "url" : "https://blogs.perl.org/users/saif/2026/02/poplar-decisions.html"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "A practical real‑world example of using Mojolicious’ built‑in WebSocket support to build an interactive online chat app in Perl, complete with multiple server variants and integration options like Redis or PostgreSQL. The repository showcases how easily Mojolicious can handle real‑time bidirectional communication with WebSockets, making it a solid reference for Perl developers exploring event‑driven web apps.",
               "title" : "Mojo with WebSocket",
               "ts" : "2026.02.13",
               "url" : "https://github.com/manwar/Mojo-with-WebSocket"
            },
            {
               "author" : "max_maischein",
               "text" : "The post previews Max's talk at the German Perl Workshop 2026, exploring how modern AI coding agents from Anthropic and z.ai can assist with Perl development, what differences exist between the models, and tips for getting them to write good code. It’s an engaging look at practical uses of agentic AI in real world programming contexts, a timely topic for anyone curious about AI‑assisted development.",
               "title" : "Coding Agents using Anthropic and z.ai - presentation at the German Perl Workshop 2026",
               "ts" : "2026.02.12",
               "url" : "https://blogs.perl.org/users/max_maischein/2026/02/coding-agents-using-anthropic-and-zai---presentation-at-the-german-perl-workshop-2026.html"
            },
            {
               "author" : "laurent_dami",
               "text" : "This article highlights one of Perl’s unique strengths, the local keyword, showing how it enables temporary, dynamic changes to global variables without permanent side effects. With clear examples manipulating %ENV, special Perl variables and even symbol table entries, it makes a compelling case for using local judiciously to solve real world problems that lexical scoping alone can’t.",
               "title" : "Beautiful Perl feature: 'local', for temporary changes to global variables",
               "ts" : "2026.02.15",
               "url" : "https://dev.to/damil/beautiful-perl-feature-local-for-temporary-changes-to-global-variables-4ejk"
            }
         ],
         "title" : "Articles"
      },
      {
         "entries" : [
            {
               "author" : "john_napiorkowski",
               "text" : "The announcement of PAGI::Server 0.001017 highlights experimental HTTP/2 support built on nghttp2, bringing both cleartext h2c and TLS‑based HTTP/2 to Perl web services with automatic protocol detection and solid h2spec compliance. The write‑up explains why HTTP/2 matters for backend performance and modern use cases like gRPC and multiplexed APIs, and it also outlines other quality‑of‑life improvements and operational fixes in the release.",
               "title" : "PAGI::Server, now with HTTP/2!",
               "ts" : "2026.02.11",
               "url" : "https://dev.to/jjn1056/pagiserver-now-with-http2-37gf"
            },
            {
               "author" : "nigel_horne",
               "text" : "Version 0.28 of App::Test::Generator, the black‑box test case generator, has just been released with improved schema extraction and test generation accuracy, tightening detection of getter/setter methods and better typing in generated tests. These enhancements make it easier to produce honest, robust fuzz and corpus driven test harnesses from your Perl modules.",
               "title" : "Black box test generator version 0.28 released",
               "ts" : "2026.02.10",
               "url" : "https://www.reddit.com/r/perl/comments/1r10dfk/black_box_test_generator_version_028_released/"
            },
            {
               "author" : "yitzchak_scott_thoennes",
               "text" : "Run::WeeklyChallenge is a small but useful CPAN module that helps you automate running solutions to challenges from The Weekly Challenge site by passing one or more sets of JSON‑formatted inputs to your code. It cleanly wraps your solution logic and input schema validation, making it easier to test and reuse challenge solutions programmatically.",
               "title" : "Run::WeeklyChallenge",
               "ts" : "2026.02.09",
               "url" : "https://metacpan.org/pod/Run::WeeklyChallenge"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "DBIx::Class::Async is a modern asynchronous wrapper for DBIx::Class that allows non‑blocking database operations in Perl, keeping the familiar DBIC interface while running queries in the background via futures. The latest update brings several improvements: caching is now disabled by default (TTL 0), automatic detection of non-deterministic SQL functions (like NOW() and RAND()) ensures safe bypass of caching, cache invalidation on update/delete operations is more precise using primary keys, and count() queries are no longer cached to guarantee accurate row counts. These enhancements make asynchronous DBIC usage both safer and more reliable.",
               "title" : "DBIx::Class::Async",
               "ts" : "2026.02.10",
               "url" : "https://metacpan.org/pod/DBIx::Class::Async"
            },
            {
               "author" : "mohammad_anwar",
               "text" : "Syntax::Highlight::Engine::Kate provides Perl programs with robust syntax highlighting using the same engine as the Kate editor. The latest update fixes Issue #23 in Template.pm: the testDetectSpaces() regex was corrected, ensuring only spaces and tabs are matched and improving number highlighting in Perl and other languages. The test suite expected outputs were also updated to reflect the corrected highlighting behavior.",
               "title" : "Syntax::Highlight::Engine::Kate",
               "ts" : "2026.02.15",
               "url" : "https://metacpan.org/dist/Syntax-Highlight-Engine-Kate"
            }
         ],
         "title" : "CPAN"
      },
      {
         "entries" : [
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Welcome to a new week with a couple of fun tasks \"Zeckendorf Representation\" and \"Find Celebrity\". If you are new to the weekly challenge then why not join us and have fun every week. For more information, please read the <a href=\"https://theweeklychallenge.org/faq\">FAQ</a>.",
               "title" : "The Weekly Challenge - 361",
               "ts" : "2026.02.16",
               "url" : "https://theweeklychallenge.org/blog/perl-weekly-challenge-361"
            },
            {
               "author" : "mohammad_anwar",
               "tags" : [],
               "text" : "Enjoy a quick recap of last week's contributions by Team PWC dealing with the \"Text Justifier\" and \"Word Sorter\" tasks in Perl and Raku. You will find plenty of solutions to keep you busy.",
               "title" : "RECAP - The Weekly Challenge - 360",
               "ts" : "2026.02.16",
               "url" : "https://theweeklychallenge.org/blog/recap-challenge-360"
            },
            {
               "author" : "ali",
               "tags" : [],
               "text" : "This write-up delivers straightforward, idiomatic Perl solutions for both text justification and word sorting, showing practical use of fc for case-insensitive comparisons and clear subroutine design. The concise code examples make the challenge solutions easy to follow and apply.",
               "title" : "TWC360",
               "ts" : "2026.02.09",
               "url" : "https://deadmarshal.blogspot.com/2026/02/twc360.html"
            },
            {
               "author" : "arne_sommer",
               "tags" : [],
               "text" : "In this post, an effective solution to The Weekly Challenge #360 is given, with beautiful examples showing how Raku can be implemented for text justification and sorting as the output. Most of the explanations are fairly short, but they are clearly defined, giving lots of examples; and, they consider the idiomatic usage of Raku's features to make the output readable and helpful.",
               "title" : "Full Circle",
               "ts" : "2026.02.15",
               "url" : "https://raku-musings.com/full-circle.html"
            },
            {
               "author" : "bob_lied",
               "tags" : [],
               "text" : "This article offers a thoughtful take on the Word Sorter task from PWC 360, with a clear explanation of the case-insensitive sort and an efficient Perl solution using a Schwartzian transform. The benchmarking insight and attention to Unicode case folding nuance show both practical coding skill and depth of understanding.",
               "title" : "Pertaining to a subtlety of sorting",
               "ts" : "2026.02.11",
               "url" : "https://dev.to/boblied/pwc-360-pertaining-to-a-subtlety-of-sorting-39b4"
            },
            {
               "author" : "jaldhar_vyas",
               "tags" : [],
               "text" : "This write-up clearly presents both Text Justifier and Word Sorter tasks with simple, idiomatic Perl and Raku solutions that showcase practical string manipulation and sorting techniques. The inclusion of multiple examples and cross-language snippets makes the challenge approachable and highlights the expressive power of each language.",
               "title" : "Perl Weekly Challenge: Week 360",
               "ts" : "2026.02.15",
               "url" : "https://www.braincells.com/perl/2026/02/perl_weekly_challenge_week_360.html"
            },
            {
               "author" : "luis_mochan",
               "tags" : [],
               "text" : "This post showcases clear, idiomatic Perl solutions for both the Text Justifier and Word Sorter tasks, with one‑liner examples and concise logic that demonstrate practical use of integer arithmetic and case‑preserving sorting. The included sample inputs and outputs make the behavior easy to follow and verify.",
               "title" : "Perl Weekly Challenge 360",
               "ts" : "2026.02.08",
               "url" : "https://wlmb.github.io/2026/02/08/PWC360/"
            },
            {
               "author" : "marc_perry",
               "tags" : [],
               "text" : "This post methodically implements both Text Justifier and Word Sorter solutions for PWC 360 in clear Perl code, showing careful step-by-step padding logic and idiomatic sorting. The explanations of how the examples are handled make the approach easy to follow and instructive for readers.",
               "title" : "This is exactly the sort of justification that I was looking for",
               "ts" : "2026.02.08",
               "url" : "https://awesomepowerofgenetics.blogspot.com/2026_02_08_archive.html#3048441554558263005"
            },
            {
               "author" : "matthias_muth",
               "tags" : [],
               "text" : "The post offers well‑structured Perl solutions that clearly implement both text justification and alphabetical word sorting with idiomatic constructs and practical tests. The use of case‑preserving sorting and centered padding logic demonstrates good command of Perl’s core features and makes the solutions easy to follow and reuse.",
               "title" : "Justifying TIMTOWTDI",
               "ts" : "2026.02.15",
               "url" : "https://github.com/MatthiasMuth/perlweeklychallenge-club/tree/muthm-360/challenge-360/matthias-muth#readme"
            },
            {
               "author" : "packy_anderson",
               "tags" : [],
               "text" : "An excellent and clear walk-through of the Perl Weekly Challenge tasks, with well-structured multi-language solutions and thoughtful explanations that make the text justification and word sorting problems easy to follow. The blend of Perl, Raku, Python, and Elixir examples shows both depth and versatility of approach.",
               "title" : "Word Crimes are Justified",
               "ts" : "2026.02.12",
               "url" : "https://packy.dardan.com/b/j8"
            },
            {
               "author" : "peter_campbell_smith",
               "tags" : [],
               "text" : "The post presents the Text Justifier and Word Sorter tasks clearly with well-explained inputs and desired outputs, giving readers a solid grounding in the problem definitions. The examples are practical and show the expected string centering and alphabetical ordering behavior in a way that supports straightforward implementation.",
               "title" : "Padding and sorting",
               "ts" : "2026.02.09",
               "url" : "http://ccgi.campbellsmiths.force9.co.uk/challenge/360"
            },
            {
               "author" : "reinier_maliepaard",
               "tags" : [],
               "text" : "This post demonstrates a practical and idiomatic Perl solution by leveraging String::Pad for Text Justifier, showcasing how using existing modules can simplify challenge tasks. The concise examples with clear input/output make it easy to grasp the task mechanics and verify correctness.",
               "title" : "The Weekly Challenge - 360: Text Justifier",
               "ts" : "2026.02.09",
               "url" : "https://reiniermaliepaard.nl/pwc/index.php?id=pwc360-1"
            },
            {
               "author" : "reinier_maliepaard",
               "tags" : [],
               "text" : "This write-up delivers a succinct and idiomatic Perl solution to the Word Sorter task, using a case-insensitive sort and clean split/grep logic that keeps words unchanged while ordering them alphabetically. The included test cases make the behavior clear and easy to verify.",
               "title" : "The Weekly Challenge - 360: Word Sorter",
               "ts" : "2026.02.09",
               "url" : "https://reiniermaliepaard.nl/pwc/index.php?id=pwc360-2"
            },
            {
               "author" : "roger_bell_west",
               "tags" : [],
               "text" : "This post delivers clear and well-commented solutions to both Text Justifier and Word Sorter tasks from The Weekly Challenge 360, using concise Lua, Raku, Perl and other language examples with practical explanations of key steps like centered padding and case-insensitive sorting. The author’s discussion of different implementation strategies highlights thoughtful coding decisions that make the techniques accessible and educational for readers.",
               "title" : "Justify the Words",
               "ts" : "2026.02.15",
               "url" : "https://blog.firedrake.org/archive/2026/02/The_Weekly_Challenge_360__Justify_the_Words.html"
            },
            {
               "author" : "simon_green",
               "tags" : [],
               "text" : "This write‑up walks through both the Text Justifier and Word Sorter tasks from The Weekly Challenge 360 with clear Python and Perl solutions, showing well‑structured logic for string padding and case‑insensitive sorting. The practical examples and side‑by‑side language implementations make the techniques easy to understand and apply.",
               "title" : "Padding and sorting",
               "ts" : "2026.02.09",
               "url" : "https://dev.to/simongreennet/weekly-challenge-padding-and-sorting-3oj8"
            },
            {
               "author" : "vinod_kumar_k",
               "tags" : [],
               "text" : "This write‑up distills both Text Justifier and Word Sorter solutions into clean, minimal Perl scripts with clear logic for padding and sorting, and emphasizes solid test‑driven development and edge‑case handling. The examples and explanation of core techniques make it both beginner‑friendly and technically sound.",
               "title" : "Perl Power: Two Tiny Scripts, Big Learning!",
               "ts" : "2026.02.15",
               "url" : "https://dev.to/vinodk89/perl-weekly-challenge-360-perl-power-two-tiny-scripts-big-learning-2o61"
            }
         ],
         "header" : "<a href=\"https://theweeklychallenge.org\">The Weekly Challenge</a> by <a href=\"https://manwar.org\">Mohammad Sajid Anwar</a> will help you step out of your comfort-zone. You can even win prize money of $50 by participating in the weekly challenge. We pick one champion at the end of the month from among all of the contributors during the month, thanks to the sponsor Lance Wicks.",
         "title" : "The Weekly Challenge"
      },
      {
         "entries" : [
            {
               "author" : "liztormato",
               "tags" : [],
               "text" : "",
               "title" : "2026.06 CÔD YN GYMRAEG",
               "ts" : "2026.02.09",
               "url" : "https://rakudoweekly.blog/2026/02/09/2026-06-cod-yn-gymraeg/"
            }
         ],
         "title" : "Rakudo"
      },
      {
         "entries" : [
            {
               "author" : "miguel_prz",
               "text" : "<a href=\"https://niceperl.blogspot.com/2026/02/dlxxxvii-10-great-cpan-modules-released.html\">Great CPAN modules released last week</a>.",
               "title" : "NICEPERL's lists",
               "ts" : "2026.02.14",
               "url" : "http://niceperl.blogspot.com/"
            }
         ],
         "title" : "Weekly collections"
      },
      {
         "entries" : [
            {
               "author" : "",
               "text" : "Do you use WhatsApp? Join the Perl Maven chat group!",
               "title" : "WhatsApp",
               "ts" : "2026.02.02",
               "url" : "https://chat.whatsapp.com/LRrkZsSRDvGLLwppyLnKHy"
            }
         ],
         "header" : "A couple of entries sneaked in by Gabor.",
         "title" : "The corner of Gabor"
      },
      {
         "entries" : [
            {
               "begin" : "2026-03-11T20:00:00+01:00",
               "text" : "March 11, 2025",
               "title" : "Paris.pm monthly meeting",
               "url" : "https://paris.mongueurs.net/"
            },
            {
               "begin" : "2026-03-16T08:00:00+01:00",
               "text" : "March 16-18, 2025",
               "title" : "German Perl/Raku Workshop 2026 in Berlin",
               "url" : "https://act.yapc.eu/gpw2026/"
            },
            {
               "begin" : "2026-06-26",
               "text" : "June 26-29, 2026, Greenville, SC, USA",
               "title" : "The Perl and Raku Conference 2026",
               "url" : "https://tprc.us/tprc-2026-gsp/"
            }
         ],
         "title" : "Events"
      }
   ],
   "date" : "2026-02-16",
   "editor" : "mohammad_anwar",
   "footer" : [],
   "header" : [
      "Hi there,",
      "Perl's asynchronous ecosystem continues to grow, enabling developers to build non-blocking, responsive applications with ease. Modules like <a href=\"https://metacpan.org/pod/IO::Async\">IO::Async</a>, async features in <a href=\"https://metacpan.org/pod/Mojolicious\">Mojolicious</a>, and helpers for asynchronous database operations (such as <a href=\"https://metacpan.org/pod/DBIx::Class::Async\">DBIx::Class::Async</a>) allow event-driven designs, background tasks, and futures/promises, making high-throughput web services, real time APIs, and streaming pipelines straightforward to implement.",
      "Projects like <a href=\"https://metacpan.org/dist/PAGI\">PAGI</a> and <a href=\"https://metacpan.org/pod/PAGI::Server\">PAGI::Server</a>, now with HTTP/2 support, and <a href=\"https://metacpan.org/pod/Thunderhorse\">Thunderhorse</a> showcase how Perl can handle multiple connections efficiently while keeping code clear and maintainable. Together, these tools make it easier to build responsive, scalable, and maintainable applications, all while retaining the expressive, pragmatic style that continues to define Perl.",
      "With each new module and project, Perl's potential in the modern, concurrent world keeps expanding, the best is yet to come.",
      "A small milestone reached with this issue, my <strong>200th</strong> edition. Enjoy rest of the newsletter and stay safe."
   ],
   "subject" : "Async Perl"
}
