{
   "date" : "September 12, 2011",
   "header" : [
   "Let's see how creative are the people reading this newsletter? My earlier attempts to tweet about the newsletter got 4-12 retweets. What if I asked you to just click on this link, edit the text and send out the tweet? What would you add to the end of the text?",
   "<a href=http://twitter.com/intent/tweet?text=Reading+issue+#7+of+the+Perl+Weekly+Newsletter+http://perlweekly.com/archive/7.html>tweet</a>"
   ],
   "chapters" : [
      {
         "title": "Headlines",
         "entries" : [
            {
               "title" : "",
               "text" : "",
               "url" : "",
               "ts" : "2011.09.",
               "tags" : []
            }
         ]
      },
      {
         "title" : "Articles",
         "entries" : [
            {
               "title" : "Perl says 'Hello I-Programmer'",
               "text" : "This is the first article I wrote to the I-Programmer.info web site. It probably won't be an earth shattering article for you but it is my first one on I-Programmer. It is mostly there so I'll have an in-house article to refer to on how to start using Perl when I write more complex examples.",
               "url" : "http://www.i-programmer.info/programming/perl/3001-perl-says-hi-to-i-programmer.html",
               "ts" : "2011.09.07",
               "tags" : ["Padre", "introduction", "hello world", "I-Programmer"]
            },
            {
               "title" : "Lessons from running Perl Weekly for the first 6 weeks",
               "text" : "This is an article I wrote describing my experience with this list. It might be interesting to you if you'd like to look a bit at the details. I am also comparing the experience with that of Peter Cooper who runs the Ruby Weekly which was the inspiartion to this newsletter.",
               "url" : "http://szabgab.com/blog/2011/09/lessons-from-running-perl-weekly-for-the-first-6-weeks.html",
               "ts" : "2011.09.08",
               "tags" : ["Perl Weekly", "newsletter", "traffic", "subscribers", "statistics"]
            },
            {
               "title" : "DotCloud::Environment",
               "text" : "Flavio Poletti introduces his yet to be full released module to make it easy to handle the environment in DotCloud",
               "url" : "http://blogs.perl.org/users/polettix/2011/09/dotcloudenvironment.html",
               "ts" : "2011.09.09",
               "tags" : ["DotCloud", "DotCloud::Environment"]
            },
            {
               "title" : "Testing with sqlite ",
               "text" : "Anthony Pallatto (actualeyes) suggests to use SQLite in your testing environment instead of the database used in production. Using SQLite certainly has some advantages but there is the great danger of anything in production being different from the testing environment. SQLite can be good to reduce the complexity to setup development and testing environments but just as you do full test cycles every now and then (preferably frequently) so should you use a system as close to the deployment environment as possible.",
               "url" : "http://engineerofdanger.blogspot.com/2011/09/testing-with-sqlite.html",
               "ts" : "2011.09.08",
               "tags" : ["SQLite", "testing"]
            }
           ]
      },
      {
         "title" : "Parrot",
         "entries" : [
            {
               "title" : "Parrot is a foundering project on top of a wonderful vision.",
               "text" : "Christoph Otto took off the gloves and started to describe how he wants Parrot and more importantly the Parrot development process should change. This is a link to the opening message on the parrot-dev mailing list.",
               "url" : "http://lists.parrot.org/pipermail/parrot-dev/2011-September/006179.html",
               "ts" : "2011.09.05",
               "tags" : ["Parrot", "Perl 6"]
            },
            {
               "title" : "Parrot, the Smoke Clears",
               "text" : "Andrew Whitworth (aka Whiteknight on black background) takes the above e-mail discussion and writes a lengthy article about the interaction between the Parrot and the Rakudo (Perl 6) projects. Compared with the JVM and the CLR how they have a primary language but how they have started to be good targets for other languages as well.",
               "url" : "http://whiteknight.github.com/2011/09/10/dust_settles.html",
               "ts" : "2011.09.10",
               "tags" : ["Parrot", "Rakudo", "Perl 6", "JVM", "CLR"]
            }
          ]
      },
      {
         "title" : "Code",
         "entries" : [
            {
               "title" : "Parameterized Roles with MooseX::Declare",
               "text" : "Florian Ragwitz (rafl) shows the new, undocumented feature of MooseX::Declare and points to the Github repository where you could help improve the documentation.",
               "url" : "http://metacpan.perldition.org/articles/Parameterized%20Roles%20with%20MooseX%3A%3ADeclare.pod",
               "ts" : "2011.08.19",
               "tags" : ["MooseX::Declare", "MooseX::Role::Parameterized"]
            },
            {
               "title" : "Going Postal (with Dancer)",
               "text" : "Yanick Champoux (yanick), in his usual colorful way, describes how he wrote a plugin for Dancer to handle postal fees in Canada. I am sure if it can be done in Canada it can be done elsewhere as well. The nice thing is that he even provides a way to save money. Even if not on the actual postal fees.",
               "url" : "http://babyl.dyndns.org/techblog/entry/going-postal",
               "ts" : "2011.09.05",
               "tags" : ["Dancer", "Dancer::Plugin::Cache::CHI", "Business::CanadaPost", "web"]
            },
            {
               "title" : "Simple Mojolicious RSS feed",
               "text" : "Mark Meyer (mark) gives a nice and simple example on how distribute updates about changes in a system with a very simple  Mojolicious application. If only the fonts were bigger on this blog...",
               "url" : "http://markam.posterous.com/simple-mojolicious-rss-feed",
               "ts" : "2011.09.05",
               "tags" : ["Mojolicious", "RSS"]
            },
            {
               "title" : "How to Run a Long Background Process in a Web App ",
               "text" : "Peter Thoeny from Twiki explains a way how to handle long running processes in response to browser requests. This is an ongoing question that trips a lot of people who want to build a web interface to an existing system. Eg. a build machine. Unfortunatelly his solution does not work on Windows.",
               "url" : "http://twiki.org/cgi-bin/view/Blog/BlogEntry201109x2",
               "ts" : "2011.09.07",
               "tags" : ["Proc::Daemon", "IO::CaptureOutput"]
            }
         ]
      },
      {
         "title" : "Perl 6",
         "entries" : [
            {
               "title" : "'nom' branch is now default, release status",
               "text" : "Patrick Michaud (pmichaud) provides us with an update on the status of the Rakudo development. The next release is furthed delayed but the good news that it will already come from the new 'nom' branch that is the new rewrite of the whole engine.",
               "url" : "http://rakudo.org/2011/09/09/nom-branch-default/",
               "ts" : "2011.09.09",
               "tags" : ["Perl 6", "Rakudo"]
            },
            {
               "title" : "-n and -p",
               "text" : "This is the third part of the series Carl Mäsak has written showing us how the -n and -p parameters work in Rakudo Perl 6. The others are on his blog as well.",
               "url" : "http://strangelyconsistent.org/blog/dash-n-and-dash-p-part-three",
               "ts" : "2011.09.",
               "tags" : ["Perl 6", "Rakudo"]
            }
         ]
      },
      {
         "title" : "Padre",
         "entries" : [
            {
               "title" : "Fancy syntax checking with Padre ",
               "text" : "Ahmad M. Zawawi (azawawi) shows a screenshot of his new addition to Padre, the Perl IDE. You don't even have to wait for the next release of Padre to use that. You can run it directly from the development environment.",
               "url" : "http://ahmadzawawi.blogspot.com/2011/09/fancy-syntax-checking-with-padre.html",
               "ts" : "2011.09.07",
               "tags" : ["Padre", "IDE"]
            }
         ]
      },
      {
         "title" : "Events",
         "entries" : [
         ]
      }
   ]
}
