[
  {
         "entries" : [
            {
               "ts" : "2018.07.02",
               "text" : "Branding your business is often difficult but it doesn’t have to be. StickerYou.com is your one-stop shop for making your brand stick with <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">custom vinyl stickers</a>, labels, decals, and more. You can order any size, shape and quantity. Start branding today and make what matters stick! Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Save money and make your brand stick with Custom Vinyl Stickers from StickerYou.com",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.07.09",
               "text" : "Stand out from the crowd by creating <a href=\"https://www.stickeryou.com/products/vinyl-logo-stickers/214/\">custom logo stickers</a> at StickerYou.com. Stickers are always a great giveaway at events and even fun to hand out to friends. Make your message stick and become memorable wherever you go. You can create custom orders of any size, shape and quantity. Use code <b>PERL10</b> for a 10% discount.",
               "title" : "StickerYou.com can help make your brand more memorable with custom logo stickers",
               "url" : "https://www.stickeryou.com/products/vinyl-logo-stickers/214/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.07.16",
               "text" : "Create <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">custom vinyl stickers</a>, product labels, badges, patches and more with StickerYou.com to market your brand effectively. Our products are perfect to hand out at events or sell to make extra money. You can print any size, shape and order quantity. Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Conference coming up? Make your brand memorable with custom stickers from StickerYou",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.07.23",
               "text" : "StickerYou.com allows you to create completely customizable stickers and much more. If you’re looking for the perfect way to have your brand seen wherever you go, StickerYou’s custom stickers are great to use as <a href=\"https://www.stickeryou.com/products/laptop-stickers/190/\">laptop stickers</a>, leaving no residue. You can order any size, shape and order quantity. Use code <b>PERL10</b> at checkout for 10% off.",
               "title" : "Brand your laptop with great custom stickers and build awareness wherever you go",
               "url" : "https://www.stickeryou.com/products/laptop-stickers/190/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.07.30",
               "text" : "StickerYou is your one-stop shop to make your business branding stick. You can create custom stickers, labels, decals, magnets, patches, badges, iron-ons and more in any size, shape, and order quantity. If you’re printing <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">custom vinyl stickers</a> for your business, StickerYou.com has you covered. Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "StickerYou.com is offering 10% off to the Perl Weekly community. Forever.",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.08.06",
               "text" : "Web designers and developers need to brand themselves and StickerYou makes the process easy. StickerYou allows you to purchase stickers, labels, decals, and more, in any size, shape, and order quantity. Whether you want <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">custom stickers</a> for laptops or a wall decal for the office, we’re here for you. Use code <b>PERL10</b> at checkout for 10% off.",
               "title" : "StickerYou.com offers a 10% discount to the Perl Weekly community",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.08.13",
               "text" : "Do you, your kids or your staff lose your phones or other devices way too often? If the lost device is locked, the person who finds it won’t know whose it is. StickerYou.com is here to help! Order <a href=\"https://www.stickeryou.com/products/custom-labels/173/\">personalized labels</a> for you, your family & your colleagues and stick them to anything you might lose. Use code <b>PERL10</b> at checkout for 10% off.",
               "title" : "Label your devices in case you lose them! 10% off at StickerYou for the Perl community",
               "url" : "https://www.stickeryou.com/products/custom-labels/173/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.08.20",
               "text" : "StickerYou makes branding easy. Our completely customizable <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">vinyl stickers</a> are perfect to give away at events. It’s an easy way to get your brand name out there. StickerYou allows you to order and size, shape, and order quantity. What are you waiting for? Use code <b>PERL10</b> at checkout for an exclusive Perl Weekly discount.",
               "title" : "As a proud backer of the Perl community, StickerYou is offering a lifetime discount",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.08.27",
               "text" : "StickerYou is your one-stop shop to make your business stick. You can create <a href=\"https://www.stickeryou.com/products/custom-stickers/335/\">custom stickers</a>, labels, decals, magnets, and more in any size, shape, and order quantity. Whether you’re a freelancer or aspiring entrepreneur, StickerYou makes it easy to create personal brand awareness. Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Make your business stick! StickerYou has a discount for all Perl Weekly subscribers",
               "url" : "https://www.stickeryou.com/products/custom-stickers/335/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.09.03",
               "text" : "StickerYou sells custom labels, decals, stickers, temporary tattoos and more. You can print any size, shape, and order quantities to make your message stick. Our vinyl <a href=\"https://www.stickeryou.com/products/vinyl-logo-stickers/214/\">logo stickers</a> are perfect to brand your business. What are you waiting for? Make it stick! Use code<b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Logo stickers help tell your story. Perl Weekly subscribers save money at StickerYou.com",
               "url" : "https://www.stickeryou.com/products/vinyl-logo-stickers/214/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.09.10",
               "text" : "Are you looking for an easy way to wow your colleagues with the coolest laptop and desk at the office? Visit StickerYou.com for stickers, labels, decals, and more. Start branding today with <a href=\"https://www.stickeryou.com/products/laptop-stickers/190/\">laptop stickers</a> and awesome personalized labels. You can order any size, shape, and order quantity. Use code <b>PERL10</b> at checkout for 10% off.",
               "title" : "Personalize your laptop with custom labels or logo stickers from StickerYou.com",
               "url" : "https://www.stickeryou.com/products/laptop-stickers/190/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.09.17",
               "text" : "StickerYou.com makes branding easy. Customizable <a href=\"https://www.stickeryou.com/products/vinyl-stickers/815/\">vinyl stickers</a> are perfect to give away at events or to add to your company’s laptops and other devices. Stickers are an easy way to make your brand stick! StickerYou allows you to order any size, shape and order quantity. What are you waiting for? Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Let StickerYou help brand your business now with customizable stickers and labels",
               "url" : "https://www.stickeryou.com/products/vinyl-stickers/815/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      },
     {
         "entries" : [
            {
               "ts" : "2018.09.24",
               "text" : "StickerYou.com is your one-stop shop to make your business stick. You can create custom stickers, labels, decals, magnets, and more in any size, shape, and order quantity. If you’re printing your own <a href=\"https://www.stickeryou.com/products/custom-stickers/335/\">custom stickers</a> for your staff or to hand out at events, we have you covered. Start designing today with StickerYou’s world-leading sticker maker. Use code <b>PERL10</b> at checkout for a 10% discount.",
               "title" : "Make your business stick with StickerYou.com’s world-leading sticker maker",
               "url" : "https://www.stickeryou.com/products/custom-stickers/335/"
            }
         ],
         "sponsor" : 2,
         "title" : "Sponsors"
      }
]
